# coding=utf-8
import re

str1 = '''       
本公司董事会、监事会及董事、监事、高级管理人员保证本报告所载资料不存在任何虚假
记载、误导性陈述或者重大遗漏，并对其内容的真实性、准确性和完整性承担个别及连带责任。 
没有董事、监事、高级管理人员对年度报告内容的真实性、准确性、完整性无法保证或存
在异议。 
信永中和会计师事务所为本公司出具了标准无保留意见的审计报告。 
公司负责人谭文鋕先生、主管会计工作负责人莫尚云先生及会计机构负责人曹岷女士声明：
保证年度报告中财务报告的真实、完整。 

目    录 

第一章  公司基本情况简介………………………………………..………………………………1
第二章  会计数据和业务数据摘要……………….……………….………………………………2
第三章  股本变动及股东情况………………………….………….………………………………4
第四章  董事、监事、高级管理人员和员工情况……..….……...………………………………8
第五章  公司治理结构…………………………….…….…..……………………………………16
第六章  股东大会情况介绍…………………….….…………..…………………………………22
第七章   董事会报告…………………………….….……….………….…………………………23
第八章   监事会报告………………………….…….……….……….……………………………40
第九章   重要事项…………………………….……..……………….……………………………42
第十章   财务报告…………………………….….……………………..…………………………57
第十一章 备查文件目录…………………….…….….…………..…………………………………57 

附：审计报告 







                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
1 


第一章 公司基本情况简介 

一、公司法定中文名称：深圳长城开发科技股份有限公司 
公司法定英文名称：SHENZHEN KAIFA TECHNOLOGY CO., LTD. 
公司英文名称缩写：KAIFA 
二、公司法定代表人：谭文鋕 
三、公司董事会秘书：葛伟强 
证券事务代表：李丽杰 
联系地址：深圳市福田区彩田路 7006号 
联系电话：0755-83200095   0755-83205285 
传    真：0755-83275075 
电子信箱：stock@kaifa.cn 
四、公司注册及办公地址：深圳市福田区彩田路 7006号 
邮政编码：518035 
国际互联网网址：http: / / www.kaifa. cn 
电子信箱：stock@kaifa.cn 
五、公司选定的信息披露报纸：《中国证券报》、《证券时报》 
登载公司年度报告的国际互联网网址：http: / / www.cninfo.com.cn 
公司年度报告备置地点：公司董事会办公室 
六、公司股票上市交易所：深圳证券交易所 
股票简称：长城开发 
股票代码：000021 
七、其他有关资料 
公司首次注册登记日期：1985年 7月 4日 
公司注册登记地址：深圳市福田区彩田路 7006号 
企业法人营业执照注册号：440301501126473 
税务登记号码：440301618873567 
组织机构代码：61887356-7 
公司聘请的会计师事务所名称：信永中和会计师事务所有限责任公司 
办公地址：北京市东城区朝阳门北大街 8号富华大厦 A座 9层 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
2 


第二章   会计数据和业务数据摘要 

一、公司本年度主要会计数据                                         单位：人民币元 
项   目 金   额 
营业利润   417,522,755.98 
利润总额   399,721,373.78 
归属于上市公司股东的净利润     384,257,878.66 
归属于上市公司股东的扣除非经常性损益后的净利润   290,736,783.93 
经营活动产生的现金流量净额   114,433,971.14 
扣除非经常性损益涉及的项目和金额                                   单位：人民币元 
非经常性损益项目 金   额 
非流动资产处置损益 115,292,474.28 
计入当期损益的政府补助 9,891,326.76 
除同公司正常经营业务相关的有效套期保值业务外，
持有交易性金融资产、交易性金融负债产生的公允价
值变动损益，以及处置交易性金融资产、交易性金融
负债和可供出售金融资产取得的投资收益 
267,814.09 
单独进行减值测试的应收款项减值准备转回（备注） -28,689,034.66 
除上述各项之外的其他营业外收支净额 -1,152,950.78 
所得税影响数 -25,316,636.11 
少数股东权益影响额（税后） 23,228,101.15 
合计 93,521,094.73 

备注：为本公司之子公司开发磁记录委托贷款全额计提减值准备，详见会计报表附注八、11 所述。 






                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
3 




二、 公司近三年主要会计数据和财务指标                               
1. 主要会计数据                                                            单位：人民币元 
 2010年 2009年 本年比上年 增减（％） 2008 年 
营业总收入 20,771,541,038.17 13,405,312,857.43 54.95% 15,109,065,833.71 
利润总额 399,721,373.78 310,390,512.26 28.78% 319,767,458.36 
归属于上市公司股东的净利润 384,257,878.66 258,619,909.73 48.58% 322,738,594.81 
归属于上市公司股东的扣除非
经常性损益的净利润 290,736,783.93 245,730,202.67 18.32% 302,407,922.14 
经营活动产生的现金流量净额 114,433,971.14 493,691,448.31 -76.82% 554,214,984.93 
 2010年末 2009年末 本年末比上年末增减(％) 2008 年末 
总资产 6,666,538,139.82 5,428,294,599.13 22.81% 4,926,609,268.83 
归属于上市公司股东的所有者
权益 4,183,036,283.55 3,630,897,925.14 15.21% 3,508,976,782.58 
股本 1,319,277,781 879,518,521.00 50.00% 879,518,521.00 
2. 主要财务指标                                                            单位：人民币元  
 2010年 2009年 本年比上年 增减（％） 2008年 
基本每股收益（元/股） 0.2913 0.1960  48.62% 0.2446  
稀释每股收益（元/股） 0.2913 0.1960  48.62% 0.2446  
扣除非经常性损益后的基本每股收益（元/股） 0.2204  0.1863  18.30% 0.2292  
加权平均净资产收益率（%） 10.29%  7.24% 增加 3.05 个 百分点  9.29% 
扣除非经常性损益后的加权平均净资产收益率（%）  7.78%  6.88% 增加 0.90 个 百分点  8.71% 
每股经营活动产生的现金流量净额（元/股） 0.0867  0.5613 -84.55% 0.6301 
 2010年末 2009年末 本年末比上年末增减（％） 2008年末 
归属于上市公司股东的每股净资产（元/股） 3.1707 4.1283 -23.20% 3.9897 






                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
4 


第三章   股本变动及股东情况 

一、 股本变动情况 
1. 公司股份变动情况表                                                        数量单位：股 
本报告期变动前 本报告期变动增减（+，-） 本报告期变动后 

数量 比例 发行新股 送股 
公积金 
转股 其他 小计 数量 比例 
一、有限售条件股份 922,084 0.10%  184,417 276,625  461,042 1,383,126 0.10% 
1、国家持股          
2、国有法人持股          
3、其他内资持股          
其中：境内非国有法
人持股          
 境内自然人持股          
4、外资持股          
其中：境外法人持股          
  境外自然人持股          
5、高管股份 922,084 0.10%  184,417 276,625 0 461,042 1,383,126 0.10% 
二、无限售条件股份 878,596,437 99.90%  175,719,287 263,578,931 0 439,298,218 1,317,894,655 99.90% 
1、人民币普通股 878,596,437 99.90%  175,719,287 263,578,931 0 439,298,218 1,317,894,655 99.90% 
2、境内上市的外资股          
3、境外上市的外资股          
4、其他          
三、股份总数 879,518,521 100.00%  175,903,704 263,855,556 0 439,759,260 1,319,277,781 100.00% 
注：2010年6月10日，公司实施2009年度利润分配方案，以公司总股本879,518,521股为基数，
向全体股东每10股送2股、转增3股、派2元现金（含税），送转股后公司总股本由879,518,521股
增至1,319,277,781股，各股东持股数相应发生变化。 


                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
5 
2. 限售股份变动情况表                                                           单位：股 
股东名称 年初 限售股数 本年解除 限售股数 本年增加 限售股数 年末 限售股数 限售原因 解除限售日期 
谭文鋕 835,408 0 417,704 1,253,112 董事持股 
郑国荣 83,541 0 41,770 125,311 董事持股 
杜和平 3,135 0 1,568 4,703 董事持股 
依据有关董事、监
事、高管持股变动
的法规规定予以
锁定或流通。 
合  计 922,084 0 461,042 1,383,126 - - 

3. 证券发行与上市情况 
（1） 截止报告期末为止的前三年，公司无证券发行情况。 
（2） 报告期内公司股份总数由 879,518,521股增至 1,319,277,781股，具体如下： 
A) 2010年 6月 10日，公司实施 2009年度权益分派方案，以公司总股本 879,518,521股为
基数，向全体股东每 10股送红股 2股，派 2元人民币现金（含税）；同时，以资本
公积金向全体股东每 10股转增 3股。 
B) 报告期内，公司董事、监事、高级管理人员所持股份依据有关董事、监事、高管持股
变动的法规规定予以锁定或流通，锁定股份总数由 922,084股变为 1,383,126股。 
（3） 企业内部职工股情况 
本公司内部职工股股票于 1993年 11月 22日与社会公众股同时发行，发行量 500万股，每
股发行价 4.65元。1994年 8月 26日获准上市，上市数量 4,553,500股。截止本报告期末，公司
无内部职工股。 
二、 股东情况介绍 
1. 截止 2010年 12月 31日，公司在册股东总数为 107,097户。 
2. 前十名股东、前十名无限售条件股东持股情况表                           单位：股 
股 东 总 数 107,097 
股 东 名 称 股份性质 持股比例 年末持股总数 持有有限售 条件股份数量 
质押或冻结 
的股份数量 
长城科技股份有限公司 国有法人 49.64% 654,839,851 0 0 
博旭（香港）有限公司 境外法人 8.10% 106,799,381 0 0 
交通银行－博时新兴成长股票型
证券投资基金 其他 1.67% 21,999,712 0 0 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
6 
大成价值增长证券投资基金 其他 0.98% 12,960,343 0 0 
中国光大银行股份有限公司－泰
信先行策略开放式证券投资基金 其他 0.91% 12,049,820 0 0 
中国农业银行－信诚四季红混合
型证券投资基金 其他 0.81% 10,627,943 0 0 
中国银行－大成蓝筹稳健证券投
资基金 其他 0.69% 9,056,961 0 0 
中国农业银行－长盛同德主题增
长股票型证券投资基金 其他 0.68% 9,009,789 0 0 
中国银行－易方达深证 100交易
型开放式指数证券投资基金 其他 0.59% 7,826,750 0 0 
龙力控股有限公司 境外法人 0.53% 7,000,000 0 0 
前 10名无限售条件股东持股情况 
股 东 名 称 持有无限售条件股份数量 股份种类 
长城科技股份有限公司 654,839,851 人民币普通股 
博旭（香港）有限公司 106,799,381 人民币普通股 
交通银行－博时新兴成长股票型证券投资基金 21,999,712 人民币普通股 
大成价值增长证券投资基金 12,960,343 人民币普通股 
中国光大银行股份有限公司－泰信先行策略开放式证券投资
基金 12,049,820 人民币普通股 
中国农业银行－信诚四季红混合型证券投资基金 10,627,943 人民币普通股 
中国银行－大成蓝筹稳健证券投资基金  9,056,961 人民币普通股 
中国农业银行－长盛同德主题增长股票型证券投资基金  9,009,789 人民币普通股 
中国银行－易方达深证 100交易型开放式指数证券投资基金  7,826,750 人民币普通股 
龙力控股有限公司  7,000,000 人民币普通股 
上述股东关联关系或一致行动的说明 
公司第一、第二大股东之间及与上述其他股东之间不存在关
联关系，也不属于一致行动人，大成价值增长证券投资基金
和中国银行－大成蓝筹稳健证券投资基金同为大成基金管
理公司有限管理，而上述其他股东之间未知是否存在关联关
系或属于一致行动人。 
3. 本公司控股股东情况 
股东名称：长城科技股份有限公司 
法定代表人：刘烈宏 
成立日期：1998年 3月 20日 
注册资本：人民币 1,197,742,000元 
H股上市地：香港联合交易所有限公司 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
7 
股票简称：长城科技 
股票代码：0074 
公司概况：长城科技股份有限公司是由中国长城计算机集团公司独家发起的大型高科技企
业集团，1998年 3 月 20日在中国深圳注册成立，并于 1999年 8月 5日在香港联交所挂牌上市。
2000年 5月，长城科技被香港恒生指数服务有限公司定为资讯科技股。长城科技及其附属企业
核心业务涵盖计算机核心零部件、计算机整机制造、软件和系统集成等多个领域。 
4. 公司实际控制人情况 
实际控制人名称：中国电子信息产业集团有限公司 
法定代表人：熊群力 
成立日期：1989年 5月 26日 
注册资本：人民币 7,930,222,000元 
主营业务：电子原材料、电子元器件、电子仪器仪表、电子整机产品、电子应用产品及应
用系统、电子专用设备、配套产品、软件的科研、开发、设计、制造、产品配套销售、储运与
组织管理、电子应用系统工程、建筑工程、通讯工程、水处理工程的总承包与组织管理；环保
和节能技术的开发、推广、应用；房地产开发、经营；汽车、汽车零配件、五金交电、照相器
材、建筑材料、装饰材料、服装的销售；承办展览；房屋修缮业务；咨询服务、技术服务及转
让；家用电器的维修与销售。 
中国电子信息产业集团有限公司为国有独资企业，其实际控制人为国务院国有资产监督管
理委员会。 
5. 公司与控股股东、实际控制人之间的产权及控制关系图 
















49.64%
62.11%
100%
国务院国有资产监督管理委员会
100%
中国电子信息产业集团有限公司
中国长城计算机集团公司
长城科技股份有限公司
深圳长城开发科技股份有限公司
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
8 


6. 其他持股 10%（含 10%）以上的法人股东情况 
报告期内，本公司没有其他持股 10%（含 10%）以上的法人股东。  


第四章   董事、监事、高级管理人员和员工情况 
一、 基本情况 
报告期被授予的
股权激励情况
姓 名 职 务 性别 年龄 任职期间 年初   持股数 年末 持股数 
变动 原因 
报告期
内从公
司领取
的报酬
总额 
(万元) 
可
行
权
股
数 
已
行
权
数
量 
行
权
价 
期
末
股
票
市
价 
是否在股东单位或其他关联单位领取薪酬
谭文鋕 董事长 男 63 2010.05-2013.05 1,113,878 1,670,817 注 95.40 - - - - 是 
钟际民 副董事长 男 56 2010.05-2013.05      -      -  - 5.00 - - - - 是 
卢  明 董事 男 61 2010.05-2013.05      -     -  -    - - - - - 是 
郑国荣 董事、总裁 男 53 2010.05-2013.05  111,388  167,082 注 80.00 - - - - 是 
陈建十 董事 男 52 2010.05-2013.05      -      -  -  5.00 - - - - 是 
杜和平 董事 男 56 2010.05-2013.05    4,180    6,270 注  5.00 - - - - 是 
李致洁 独立董事 男 74 2010.05-2011.05      -      -  -  5.00 - - - - 否 
周俊祥 独立董事 男 46 2010.05-2013.05      -      -  -  5.00 - - - - 否 
张  鹏 独立董事 男 46 2010.05-2013.05      -      -  -    - - - - - 否 
宋建华 监事会主席 男 55 2009.05-2012.05      -      -  - 42.73 - - - - 是 
王  维 监事 男 54 2009.05-2012.05      -      -  - 28.17 - - - - 否 
谢少华 监事 男 45 2009.05-2012.05      -      -  - 38.41 - - - - 否 
李单单 监事 女 40 2009.05-2012.05      -      -  - 41.14 - - - - 否 
林  平 监事 男 49 2009.05-2012.05      -      -  -  3.00 - - - - 是 
葛伟强 董事会秘书 男 48 2010.05-2013.05      -      -  - 36.51 - - - - 否 
陈朱江 副总裁 男 44 2010.05-2013.05      -      -  - 58.93 - - - - 否 
石界福 副总裁 男 41 2010.05-2013.05      -      -  - 42.95 - - - - 否 
蔡立雄 副总裁 男 48 2010.09-2013.05      -      -  -  9.81  - - - - 否 
莫尚云 财务总监 男 45 2010.05-2013.05      -      -  - 43.58 - - - - 否 
合  计 1,229,446 1,844,169  545.63      
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
9 
注1：2010年6月10日，公司实施2009年度利润分配方案，以公司总股本879,518,521股为基数，
向全体股东每10股送2股、转增3股、派2元现金（含税），公司董事、监事、高级管理人员持有
的股份数量相应发生变化。 
注 2：报告期内，公司没有实施股票期权、被授予的限制性股票的情况。 
公司董事、监事、高管人员在股东单位任职情况 
姓  名 任职单位 职  务 任职期间 
长城科技股份有限公司 执行董事 2010年 06月-2013年 06月 谭文鋕 博旭（香港）有限公司 董事 1987年 01月-至今 
钟际民 长城科技股份有限公司 副总裁 2008年 01月-至今 
卢  明 长城科技股份有限公司 执行董事 2010年 06月-2013年 06月 
郑国荣 博旭（香港）有限公司 董事 1998年 07月-至今 
执行董事 2010年 06月-2013年 06月 杜和平 长城科技股份有限公司 总裁 2009年 01月-至今 
宋建华 长城科技股份有限公司 监事 2010年 06月-2013年 06月 
林  平 长城科技股份有限公司 财务经理 2005年 04月-至今 
二、 现任董事、监事、高级管理人员最近五年主要工作经历 
1. 董事 
谭文鋕先生，本公司董事长，英国国籍，本公司创始人之一。现任长城科技股份有限公司
执行董事，中国长城计算机深圳股份有限公司董事，冠捷科技有限公司董事，昂纳光通信（集
团）有限公司董事，开发科技（香港）有限公司董事，深圳开发磁记录股份有限公司董事、总
裁，Excelstor Group Limited董事，深圳易拓科技有限公司董事，昂纳信息技术（深圳）有限公司
董事长等。曾获国家“友谊奖”、“广东省劳动模范”、“深圳市优秀外资企业家”、首届“深商”
风云人物“新锐奖”等荣誉称号。1985年 7月起任本公司总裁，1988年 11月首次担任本公司董
事、副董事长，历任第一届、第二届、第三届、第四届董事会董事、副董事长，2008年 1月起
担任本公司第五届董事会董事长，2010年 5月换届选举时再次连任本公司第六届董事会董事长。 
钟际民先生，本公司副董事长，中国国籍。毕业于华中工学院无线电专业，大学学历，主
任编辑。现任长城科技股份有限公司副总裁、中国长城计算机深圳股份有限公司董事、副董事
长，兼任中国电子科技公司董事、深圳开发磁记录股份有限公司董事。曾任中国电子信息产业
集团公司办公厅主任、国际合作部负责人、中国电子国际投资有限公司执行董事、香港三讯电
子公司董事长、总经理、中国通广电子公司副总经理、中国电子信息产业集团公司经理部副主
任、机电部办公厅综合处干部（正处级）、中国电子报社编辑部主任、国营第 798厂设计所助工
等职。2008年 1月首次担任本公司副董事长，2010年 5月换届选举时再次连任本公司第六届董
事会副董事长。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
10 

卢明先生，本公司董事，中国国籍。长城集团创始人之一，毕业于中国科学院研究生院，
获计算机科学硕士学位，研究员级高级工程师，曾留学德国，在汉堡高能物理研究所师从丁肇
中先生。现任长城科技股份有限公司执行董事，冠捷科技有限公司董事。曾任中国电子信息产
业集团公司副总经理，中国长城计算机集团公司董事、总经理，长城科技股份有限公司董事长，
中国长城计算机深圳股份有限公司董事长、副董事长等。1998年 5月首次担任本公司董事，历
任第二届、第三届、第四届、第五届董事会董事，2010年 5月换届选举时再次连任本公司第六
届董事会董事。 
郑国荣先生，本公司董事、总裁，中国（香港）国籍，工商管理硕士和商业经济硕士。现
任开发科技（香港）有限公司董事、苏州长城开发科技有限公司董事、深圳开发磁记录股份有
限公司董事等。1989年 11月起任本公司副总裁、高级副总裁，1990年 4月首次担任本公司董事，
历任第一届、第二届、第三届、第四届、第五届董事会董事，2010年 5月换届选举时再次连任
本公司第六届董事会董事，并担任本公司总裁。 
陈建十先生，本公司董事，中国国籍，毕业于清华大学第一分校电子技术专业，本科，工
程师。现任中国电子信息产业集团公司产业发展部副总经理，兼任深圳市爱华电子有限公司董
事、北京长城高腾信息产品有限公司董事、信息产业电子第十一设计研究院有限公司董事、中
国电子产业工程公司董事，曾任中国电子信息产业集团公司经营管理部副总经理，中国长城计
算机集团公司经营管理部经理、计划发展部、企业管理部副经理，北京三丰电子技术公司部门
经理，中国长城计算机集团公司生产物资处工程师，中国计算机发展公司物资部工程师等。2005
年 5月首次担任本公司董事，历任第五届董事会董事，2010年 5月换届选举时连任本公司第六
届董事会董事。   
杜和平先生，本公司董事，中国国籍。毕业于中央党校经济管理专业，在职研究生学历，
高级经营师。现任长城科技股份有限公司董事兼总裁、中国长城计算机深圳股份有限公司董事
长兼党委书记、深圳长城开发科技股份有限公司董事、冠捷科技有限公司董事、中国长城计算
机（香港）控股有限公司董事长、桂林长海科技有限责任公司董事。兼任深圳市科学技术协会
副主席、深圳市计算机行业协会会长、深圳市电脑学会副理事长、深圳市科普志愿者协会理事
长等。曾任中国长城计算机深圳股份有限公司副总裁、董事会秘书，中国长城计算机深圳公司
副总经理，长城电源厂筹备负责人、厂长，国营 4393 厂副总工程师等职务。2005 年 11 月首次
担任本公司董事，历任第五届董事会董事，2010年 5月换届选举时连任本公司第六届董事会董
事。2010年 12月荣获“2010广东上市公司 10大杰出企业家”称号。 
李致洁先生，本公司独立董事，中国国籍。吉林大学物理系毕业，研究员。现任中国科学
院老科技工作者协会常务理事、副理事长，兼任北京威特咨询有限公司项目投资顾问。曾在中
国科技促进经济投资公司从事投资分析和决策工作等。2005年 5月首次担任本公司独立董事，
历任第五届董事会独立董事，2010年 5月换届选举时连任本公司第六届董事会独立董事。  
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
11 

周俊祥先生，本公司独立董事，中国国籍。毕业于武汉大学和财政部财政科学研究所研究
生部，获理学学士和经济学硕士学位，中国注册会计师、中国注册资产评估师。现任天健正信
会计师事务所有限公司合伙人兼深圳分所负责人，兼任深圳天源迪科信息技术股份有限公司。
曾任深圳银华会计师事务所合伙人、珠海公诚信会计师事务所所长、珠海立信会计师事务所副
所长、珠海市会计师事务所审计部经理等。2008年 7月首次担任本公司独立董事，2010年 5月
换届选举时连任本公司第六届董事会独立董事。  
张鹏先生，本公司独立董事，中国国籍。武汉大学经济学硕士、西安交通大学管理学博士，
审计师。张鹏先生现任国信证券有限责任公司投资银行事业部副总裁，重庆华立药业股份有限
公司独立董事，深圳顺络电子股份有限公司独立董事。曾先后担任光大证券有限责任公司投资
银行南方总部副总经理、平安证券有限责任公司二部总经理、联合证券有限责任公司投资银行
西南总部总经理、大鹏证券有限责任公司投资银行总部董事、总经理、昆明制药独立董事，黔
轮胎独立董事。2009年 12月首次担任本公司独立董事，2009年 12月首次担任本公司独立董事，
2010年 5月换届选举时连任本公司第六届董事会独立董事。 
2. 监事 
宋建华先生，本公司监事会主席，中国国籍，毕业于宣化炮兵学院，中央党校国资委分校
2006年直属进修班结业。现任本公司党委副书记、纪委书记、工会主席，兼任长城科技股份有
限公司监事会监事，苏州长城开发科技有限公司监事。曾任 35304 部队营长、昆明市劳动人事
局办公室副主任，1990 年入职开发科技，历任公司办公室主任、行政总监、工会副主席。1993
年 12 月首次担任本公司第一届监事会监事，第四届、第五届监事会监事、监事会主席，2009
年 5月换届选举时再次连任本公司第六届监事会监事、监事会主席。 
王维先生，本公司监事会监事，中国国籍，毕业于成都电讯工程学院和中央党校广东分院，
曾任湖南省洪江市团委干事，国营建南机器厂副科长，深圳微科电子有限公司人事部经理，1991
年入职开发科技，任人力资源部高级经理、本公司第三届监事会监事，现任本公司安委会办公
室主任、后勤保障部总监，深圳开发光磁科技有限公司董事。2000年 5月首次担任本公司监事，
历任第三届、第四届、第五届监事会监事，2009年 5月换届选举时再次连任本公司第六届监事
会监事。 
谢少华先生，本公司监事会监事，中国国籍，毕业于澳门科技大学，获工商管理硕士学位，
1985年入职开发科技，历任本公司加工部、日立生产线、JTS生产部、IBM-HGA生产线、磁头厂
装配一、二部、采购部及进出口部技术员、助工、主管、高级主管及经理、高级经理等职。本
公司第三届监事会监事，现任本公司物流部总监，兼任苏州长城开发科技有限公司副总经理。
2000年 5月首次担任本公司监事，历任第三届、第四届、第五届监事会监事，2009年 5月换届
选举时再次连任本公司第六届监事会监事。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
12 
李单单女士，本公司监事会监事，中国国籍，毕业于贵州工业大学，曾在江苏昆山台湾统
一企业食品有限公司、深圳巨灵信息公司工作，1996年入职开发科技，曾担任生产管理，生产
计划，生产运营，质量系统管理，六西格玛推进等工作。现任本公司电子产品厂副总经理。2003
年 5月首次担任本公司监事，历任第四届、第五届监事会监事，2009年 5月换届选举时再次连
任本公司第六届监事会监事。 
林平先生，本公司监事会监事，中国国籍，毕业于中国社会科学研究生院企业管理专业，
高级会计师。现任长城科技股份有限公司资产财务部经理。兼任长城宽带网络服务有限公司董
事、长城计算机软件与系统有限公司监事。曾任湖南计算机厂总会计师，湖南计算机股份有限
公司董事、副总裁、财务总监。2006年 8月首次担任本公司监事，2009年 5月换届选举时连任
本公司第六届监事会监事。 
3. 高级管理人员 
郑国荣先生，本公司总裁，工作经历见董事部分。 
陈朱江先生，本公司副总裁，中国国籍。1989年天津大学毕业，吉林大学企业管理硕士。
工程师、经济师，高级职业经理。现任开发科技(香港)有限公司董事、深圳开发光磁科技有限公
司董事长、深圳开发微电子有限公司董事长、苏州长城开发科技有限公司董事长、昂纳光通信
（集团）有限公司董事、昂纳信息技术（深圳）有限公司董事、深圳长城科美技术有限公司董
事。曾任长城集团深圳市华明计算机有限公司董事、总经理，中国长城计算机深圳股份有限公
司董事长秘书、办公室副主任等。当选深圳市青联委员、深圳企业家协会副会长及深圳计算机
行业协会常务副会长。2005年 1月首次担任本公司副总裁，2010年 5月换届选举时再次连任本
公司副总裁。 
石界福先生，本公司副总裁，马来西亚国籍，毕业于英国爱丁堡大学电子与电气专业，工
学学士。现任苏州长城开发科技有限公司董事。曾任 Conner Peripherals测试工艺工程师、采购工
程师，JTS Corporation 采购高级工程师，1997 年入职长城开发，历任公司 PMC 副经理、采购部
经理、硬盘磁头厂副总经理、总经理。2010年 2月首次担任本公司副总裁。 
蔡立雄先生，本公司副总裁，中国（香港）国籍，毕业于英国华威大学，获生产及工业工
程硕士学位。现任深圳开发光磁科技有限公司董事、总经理。曾任伟易达电讯公司市场部副总
裁、运营总经理，王氏港建有限公司营业及项目部副总经理。2010年 9月首次担任本公司副总
裁。 
葛伟强先生，本公司董事会秘书，中国国籍。毕业于北京航空航天大学自动设计与自动生
成专业，硕士研究生，高级工程师。曾任中科院计算机语言信息工程研究中心高级工程师，中
国系统工程公司软件中心软件开发工程师等。2006年 2月首次担任本公司董事会秘书，2010年
5月换届选举时再次连任本公司董事会秘书。2010年 11月荣获“深圳市地方经济领军人物”称
号。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
13 

莫尚云先生，本公司财务总监，中国国籍。毕业于财政部财政科学研究所财政专业企业财
务方向，获经济学硕士学位，高级会计师，注册会计师。现任深圳开发光磁科技有限公司董事、
苏州长城开发科技有限公司董事。曾任本公司财务部高级经理，大鹏网络有限责任公司财务经
理，深圳市中侨发展股份有限公司财务部经理，蛇口龙电实业股份有限公司总会计师，深圳通
广-北电有限公司财务部主管，湖南省株洲火炬火花塞股份有限公司总会计师助理等。2004年 10
月首次担任本公司财务总监，2010年 5月换届选举时再次连任本公司财务总监。 
三、 现任董事、监事、高级管理人员在除股东单位外的其他单位的任职或兼职情况 
姓名 担任本公司职务 任职/兼职单位 职务 
中国长城计算机深圳股份有限公司 董事 
冠捷科技有限公司 董事 
昂纳光通信（集团）有限公司 董事 
开发科技（香港）有限公司 董事 
深圳开发磁记录股份有限公司 董事、总裁 
Excelstor Group Limited 董事 
深圳易拓科技有限公司 董事 
谭文鋕 董事长 
昂纳信息技术（深圳）有限公司 董事长 
中国电子科技公司 董事 钟际民 副董事长 深圳开发磁记录股份有限公司 董事 
卢  明 董事 冠捷科技有限公司 董事 
开发科技（香港）有限公司 董事 
苏州长城开发科技有限公司 董事 郑国荣 董事、总裁 
深圳开发磁记录股份有限公司 董事 
中国电子信息产业集团公司 产业发展部副总经理 
深圳市爱华电子有限公司 董事 
北京长城高腾信息产品有限公司 董事 
信息产业电子第十一设计研究院有限公司 董事 
陈建十 董事 
中国电子产业工程公司 董事 
中国长城计算机深圳股份有限公司 董事长、党委书记 
冠捷科技有限公司 董事 
中国长城计算机（香港）控股有限公司 董事长 
桂林长海科技有限责任公司 董事 
深圳市科学技术协会 副主席 
深圳市计算机行业协会 会长 
深圳市电脑学会 副理事长 
杜和平 董事 
深圳市科普志愿者协会 理事长 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
14 
中国科学院老科技工作者协会 常务理事、副理事长 李致洁 独立董事 北京威特咨询有限公司 项目投资顾问 
天健正信会计师事务所有限公司 合伙人兼深圳分所负责人 周俊祥 独立董事 深圳天源迪科信息技术股份有限公司 独立董事 
国信证券有限责任公司 投资银行事业部副总裁 
重庆华立药业股份有限公司 独立董事 张  鹏 独立董事 
深圳顺络电子股份有限公司 独立董事 
宋建华 监事会主席 苏州长城开发科技有限公司 监事 
王  维 监事 深圳开发光磁科技有限公司 董事 
谢少华 监事 苏州长城开发科技有限公司 副总经理 
开发科技（香港）有限公司 董事 
深圳开发光磁科技有限公司 董事长 
深圳开发微电子有限公司 董事长 
苏州长城开发科技有限公司 董事长 
昂纳光通信（集团）有限公司 董事 
昂纳信息技术（深圳）有限公司 董事 
陈朱江 副总裁 
深圳长城科美技术有限公司  董事 
深圳开发微电子有限公司 董事 石界福 副总裁 
苏州长城开发科技有限公司 董事 
蔡立雄 副总裁 深圳开发光磁科技有限公司 董事、总经理 
深圳开发光磁科技有限公司 董事 莫尚云 财务总监 苏州长城开发科技有限公司 董事 
四、 年度报酬情况 
根据《公司章程》的有关规定，董事、监事的报酬由股东大会决定，高级管理人员的报酬
由董事会决定。2010年 5月 14日召开的第十八次（2009年度）股东大会审议通过了公司董事、
监事津贴调整标准议案，相关公告参见 2010年 5月 15日的《中国证券报》、《证券时报》。 
报告期内，公司董事、监事、高级管理人员 19 人，在公司领取报酬 18 人，年度报酬总额
为人民币 545.63万元（含税），其中卢明董事未在本公司领取报酬，其薪酬在中国电子信息产业
集团有限公司领取。 
五、 离任的董事、监事、高级管理人员姓名及离任原因 
报告期内，公司副总裁潘利明先生因个人原因申请辞去公司副总裁职务，并不再担任公司
任何职务。公司董事会对潘利明先生在任职期间为公司经营发展所作出的杰出贡献表示感谢。 
六、 聘任公司总裁、副总裁、财务总监、董事会秘书等高级管理人员情况 
1. 2010年 2月 1日，公司第五届董事会第二十五次会议聘请石界福先生担任本公司副总裁。
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
15 
相关公告参见 2010年 2月 2日的《中国证券报》、《证券时报》。 
2. 2010 年 5 月 14 日，公司第十八次（2009 年度）股东大会审议通过了公司第五届董事会换
届选举议案，同意选举谭文鋕、钟际民、卢明、郑国荣、陈建十、杜和平、李致洁、周俊
祥、张鹏为公司第六届董事会董事，其中李致洁、周俊祥、张鹏为独立董事。相关公告参
见 2010年 5月 15日的《中国证券报》、《证券时报》。 
3. 2010年 5月 14日，公司第六届董事会第一次会议形成决议如下： 
（1） 选举谭文鋕先生为公司第六届董事会董事长； 
（2） 选举钟际民先生为公司第六届董事会副董事长； 
（3） 公司第六届董事会聘请郑国荣先生为公司总裁； 
（4） 公司第六届董事会聘请陈朱江先生为公司副总裁； 
（5） 公司第六届董事会聘请石界福先生为公司副总裁； 
（6） 公司第六届董事会聘请葛伟强先生为公司董事会秘书； 
（7） 公司第六届董事会聘请莫尚云先生为公司财务总监。 
相关公告参见 2010年 5月 15日的《中国证券报》、《证券时报》。 
4. 2010 年 9 月 28 日，公司第六届董事会聘请蔡立雄先生担任本公司副总裁。相关公告参见
2010年 9月 29日的《中国证券报》、《证券时报》。 
七、 公司员工情况 
截止 2010年 12月 31日，本公司共有员工 17,489人，公司没有需承担费用的离退休人员。 
公司现有员工的分类构成如下： 
类别 人数 所占比例（%） 
生产人员 14,935 85.40% 
销售人员 98 0.60% 
技术人员 1,713 9.80% 
财务人员 65 0.40% 
行政人员 678 3.80% 
按
职
能
划
分

合计 17,489 100% 
硕士及以上 142 0.80% 
本科 1,037 5.90% 
大专 1,423 8.10% 
中专 5,822 33.30% 
其他 9,065 51.90% 
按
教
育
程
度
划
分
 合计 17,489    100% 

                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
16 



第五章  公司治理结构 
一、 公司治理情况 
报告期内，公司严格按照《公司法》、《证券法》、《上市公司治理准则》、《深圳证券交易所
股票上市规则》等法律、法规的要求，不断完善公司治理结构，建立健全内部管理和控制制度，
持续深入开展公司治理活动，进一步规范公司运作，提高公司治理水平。 
1. 完善公司治理规范制度情况 
（1） 报告期内，根据中国证监会《关于做好上市公司 2009年年度报告及相关工作的公告》（证
监会公告〔2009〕34号）、深圳证券交易所《关于做好上市公司 2009年年度报告工作的通
知》和深圳证监局《关于制定上市公司年报信息披露重大差错责任追究制度的通知》（深
证局公司字〔2010〕14号）等文件的要求，为进一步提高公司年报信息披露的规范运作水
平和加强定期报告及重大事项的编制、审议和披露期间对公司外部信息使用人的管理，公
司制定了《年报信息披露重大差错责任责任追究制度》和《外部信息使用人管理制度》，
明确了年报信息披露责任人的问责和外部信息使用人的管理； 
（2） 为规范财务负责人和会计机构负责人的行为，加强对公司财务监督，公司根据相关法律法
规制定了《财务会计相关负责人管理制度》，进一步明确了相关负责人的任职资格、职责
与权限、考核与奖惩等； 
（3） 为有效防范、及时控制和化解在中国电子财务有限责任公司存款的资金风险，维护资金安
全，保证资金的流动性，公司建立了《关于在中国电子财务有限责任公司存款风险的应急
处理预案》。 
2. 推进公司治理专项活动开展情况 
报告期内，公司严格按照中国证监会和深圳证监局的相关规定和要求，持续推进公司治理
专项活动，继续巩固治理专项活动的整改成果，未发现存在以前年度未完成整改的治理问题，
本年度公司也未发现新的需进行整改的治理问题，年度内不存在因部分改制而产生同业竞争和
关联交易的情形。 

公司将一如既往地按照治理专项活动的相关要求，不断提高公司的规范运作意识和治理水
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
17 
平，把完善治理工作作为一项长期的工作，持续认真地做好公司治理，巩固并强化各项内控制
度的完善和执行，以不断提高公司核心竞争力，确保公司持续、健康、稳定的发展。 
3. 深入开展规范财务会计基础工作专项活动  
报告期内，根据深圳证监局《关于在深圳辖区深入全面开展规范会计基础工作专项活动的
通知》（深证局发〔2010〕109 号）的要求，公司成立了财务会计基础工作专项活动领导小组，
制定了《长城开发财务会计基础工作专项活动工作方案》，并于 2010 年 5 月在全公司范围内组
织开展规范财务会计基础工作专项活动，对公司财务会计基础建设情况进行了全面自查，相关
自查报告报经审计委员会和董事会审议通过。公司依据自查结果进行了整改，并出具了《长城
开发财务会计基础工作专项活动整改报告》。通过本次专项活动，进一步规范了财务会计基础工
作，提升了公司财务会计规范运作水平。 
4. 防止资金占用长效机制的建立和落实情况 
报告期内，根据深圳证监局《关于对防止资金占用长效机制建立和落实情况开展自查工作
的通知》（深证局公司字〔2010〕59号，以下简称“《通知》”) 要求，公司成立了防止资金占用
专项工作领导小组，积极开展了相关自查工作，通过梳理相关公司规章制度，进一步建立健全
了防止资金占用长效机制，并对 2010 年以来大股东及其关联方资金占用情况、资金往来项目逐
一进行审查。根据自查结果，公司防止资金占用的长效机制符合《通知》要求；未发现公司存
在大股东及其关联方资金占用情况。 
5. 财务报告内部控制制度的建立和运行情况 
公司年度财务报告内部控制制度运行良好，公司负责人对财务报告的真实性、完整性负责，
全体董事、监事和高级管理人员对公司财务报告的真实性和完整性承担责任。 
公司根据《会计法》、《企业会计准则》等法律、法规，结合公司具体情况制定了相关财务
管理制度，包括《收付货币资金管理流程》、《费用开支审批管理办法》、《全面预算管理制度》、
《投资管理制度》、《销售合同财务管理规定》、《资产管理》、《股权管理规定》等一系列制度，
构建了公司的财务内部控制制度体系。 
公司严格按照会计法律法规和国家统一的会计准则制度的要求编制财务报告。财务报告的
编制流程合理完善，编制人员职责分工明确，不相容岗位相分离；相关工作人员及时学习和掌
握财务报告编制及披露制度的新动态。 
公司执行内部审计制度，有专职审计人员对公司财务收支活动进行内部审计监督。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
18 
公司上一报告期的财务报告没有发现重大遗漏，本报告期亦未发现财务报告内部控制存在
重大缺陷。 
6. 向大股东报送未公开信息情况 
本公司大股东长城科技股份有限公司为香港联交所上市公司，因其合并报表以及定期报告
披露需要，经公司第五届董事会第六次会议审议同意本公司每月向其报送财务报表，同时，为
确保公司未公开信息的合规使用，长城科技已签署《加强未公开信息管理承诺函》。 
公司已按深圳证监局《关于对上市公司向大股东、实际控制人提供未公开信息行为加强监
管的通知》（深证局公司字〔2007〕11号）和《关于对上市公司向大股东、实际控制人提供未公
开信息等治理非规范行为加强监管的补充通知》（深证局公司字〔2007〕39号）的文件要求，履
行严格的审批程序并及时履行报备相关信息等义务。 
二、 董事履行职责情况 
1. 董事参加董事会的出席情况 
姓 名 本年应参加董事会次数 亲自出席(次) 委托出席(次) 缺席(次) 备注 
谭文鋕 12 12 0 0  
钟际民 12 12 0 0  
卢  明 12 12 0 0  
郑国荣 12 12 0 0  
陈建十 12 12 0 0  
杜和平 12 12 0 0  
李致洁 12 12 0 0  
周俊祥 12 12 0 0  
张  鹏 12 12 0 0  

2. 独立董事工作制度的建立健全情况、主要内容及履职情况 
根据《公司法》、《上市公司治理准则》、《关于在上市公司建立独立董事制度的指导意见》、
《公司章程》及法律法规的有关规定，并结合公司的实际情况，公司制定了《独立董事议事规
则》、《独立董事年报工作制度》，对独立董事的任职条件、产生与更换、行使的职权、履行的义
务以及在年报编制和披露过程中的具体责任和义务进行了详细规定。 
报告期内，公司独立董事能够勤勉尽责，认真参加董事会和股东大会，积极了解和关注公
司生产经营和依法运作情况，作为所处各领域的专家，为公司战略发展及风险控制等重大问题
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
19 
提出有建设性的意见，对董事会科学决策起到了积极作用。同时，独立董事在工作中能够保持
充分的独立性，从股东利益、尤其是中小股东利益出发，在董事会决策以及各项议案审议过程
中认真行使职权，按照规定发表独立意见，年审期间与年审注册会计师进行面对面沟通等，切
实履行了独立董事职责。 
3. 独立董事对公司有关事项提出异议的情况 
报告期内，公司独立董事对公司本年度董事会各项议案以及非董事会议案的其他事项未提
出异议。 
《深圳长城开发科技股份有限公司 2010年度独立董事述职报告》详见与本年报同时在巨潮
咨询网（http://www.cninfo.com.cn）的披露内容。 
三、 公司与控股股东“五分开”情况 
公司控股股东为长城科技股份有限公司。报告期内，公司与控股股东在业务、人员、资产、
机构、财务等方面实现了“五分开”，公司具有独立完整的业务及自主经营能力。 
1. 业务方面 
公司拥有独立的采购、生产、销售系统，具有独立完整的核心业务和自主决策与自主经营
能力，与控股股东不存在同业竞争的情况。 
2. 人员方面 
公司拥有独立的人事、劳动及工资管理体系。公司实行董事会领导下的总裁负责制，由董
事会聘任或解聘公司高级管理人员，员工实行聘任制。公司总裁、副总裁、财务总监、董事会
秘书等高级管理人员专职在公司工作，在公司领取报酬，未在股东单位兼任除董事外的其他任
何职务。无控股股东干预公司董事会和股东大会已做出的人事任免决定的情况。 
3. 资产方面 
公司资产独立完整、权属清晰，拥有独立的生产系统、辅助生产系统及配套设施，独立拥
有工业产权、商标、非专利技术等无形资产。 
4. 机构方面 
公司具有独立完整的法人治理结构，组织机构体系健全，内部机构独立。公司股东大会、
董事会、监事会和经营管理机构等均依法设立，并规范运作，同时严格按照上市公司规范运作
要求设立了各职能部门，并按照独立运作原则制定了各部门规章制度以及业务规范流程。公司
与控股股东职能部门之间不存在从属关系，也不存在与控股股东混合经营及合署办公的情况。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
20 
5. 财务方面 
公司设有独立的财务部门，建立了独立的会计核算体系和财务管理制度，独立在银行开立
帐户，依法独立核算，独立纳税，无控股股东干预本公司资金使用的情况。 
四、 公司内部控制制度建立和健全情况 
1. 内部控制建设的总体情况 
公司长期以来一直高度重视内部控制建设，已建立并逐步形成了日益健全、有效、规范的
公司治理和内部控制体系，并在实践中不断加以完善和优化，为公司创建了良好的企业内部管
理环境和规范的生产经营秩序。 
公司内控制度涉及公司治理和经营管理的各个层面，主要有《公司章程》、《股东大会议事
规则》、《董事会议事规则》、《监事会议事规则》、《独立董事议事规则》、《各专门委员会工作条
例》、《独立董事年报工作制度》、《审计委员会年报审计工作程序》、《总裁工作细则》、《募集资
金管理办法》、《关联交易管理制度》、《对外担保管理制度》、《信息披露管理制度》、《投资者关
系管理制度》、《重大信息内部报告制度》、《非公开信息知情人保密制度》、《内幕信息知情人员
报备制度》、《防范控股股东及关联方资金占用管理办法》、《新股申购业务内部控制制度》、《年
报信息披露重大差错责任责任追究制度》、《外部信息使用人管理制度》、《财务会计相关负责人
管理制度》、《关于在中国电子财务有限责任公司存款风险的应急处理预案》、《全面预算管理制
度》、《公司印章报备管理规定》、《公司内部审计办法》、《公司组织管控模式及职能部门工作说
明书》等近 200 余项，在公司重大投资决策、财务管理、物流管理、生产经营管理、产品研发
管理、技术支持管理、人力资源管理、信息披露管理、关联交易管理等方面发挥了重要的作用，
共同构成了一个系统的、完整的、科学合理的内部控制体系。 
2. 内部监督 
公司已建立起涵盖总部、各分子公司层面的监督检查体系，总部职能部门负责对各业务领
域的控制执行情况的检查，保证控制活动的存在并有效运行。 
审计监察部负责公司内部日常及专项审计、运营风险控制监察、经营道德监督等工作，根
据内部审计管理办法独立行使审计职权，对公司及下属子公司的经营管理、财务状况、内控执
行等情况进行内部检查，对其生产经营的合法、合规性与经济效益的真实、合理性做出客观评
价，有效发挥监督管理作用。 
董事会审计委员会是董事会的专门工作机构，主要负责公司内、外部审计的沟通、监督和
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
21 
核查工作，确保董事会对经营班子的有效监督。 
监事会负责对董事、高级管理人员的履职情形及公司依法运作情况等情况进行监督，对股
东大会负责。 
3. 内部控制制度自我评价 
（1） 公司内部控制自我评价报告 
公司现有内部控制制度能够适应公司管理的要求和发展的需要，已建立的内部控制体系在
合规性、有效性等方面不存在重大缺陷，但由于内部控制固有的局限性、以及宏观环境、政策
法规的持续变化，使得完善内部控制制度成为一项长期工作。公司将根据《企业内部控制基本
规范》、《中央企业全面风险管理指引》持续优化内部控制制度，健全全面风险管理体系，以提
高经营管理水平和风险防范能力，为公司可持续健康发展和经营目标的实现提供合理保障。 
详细内容请参见与本年报同时披露的《深圳长城开发科技股份有限公司 2010年度内部控制
自我评价报告》。 
（2） 公司监事会对内部控制自我评价的意见 
报告期内，公司根据中国证监会、深圳证券交易所的有关规定，遵循内部控制的基本原则，
按照自身的实际情况，建立了较为完善的内部控制制度，公司组织机构完整，运转有效，确保
了公司资产的安全和完整。 
监事会认为，公司内部控制自我评价全面、真实、准确，反映了公司内部控制的实际情况。 
（3） 公司独立董事对内部控制自我评价的意见 
报告期内，公司制定和重新修订了一系列管理制度，公司内部控制体系完善健全，符合国
家有关法律、法规和监管部门的要求，也符合公司经营管理活动的实际情况需要。 
公司内部控制重点活动能够按照公司内部控制制度的规定进行，内部控制措施在企业管理
的各环节发挥了较好的作用，保证了公司经营管理活动的正常进行，保护了公司资产的安全和
完整。 
独立董事认为，公司内部控制自我评价客观、全面地反映了公司内部控制的实际情况。 
五、 公司 2010年度社会责任报告 
公司认为，积极履行社会责任，不但是我们推动社会发展的义务，更是我们对自身持续发
展的承诺。报告期内，公司在追求经济效益的同时，注重维护股东与债权人利益，全面保护债
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
22 
权人和职工的合法权益，诚信对待供应商、客户和消费者，积极从事环境保护、社区建设等公
益事业，得到了社会的肯定与认可。2011 年是公司绿色主题年，公司将“着力打造低碳经济、
加快进军绿色产业”确立为发展主题，并一如既往地推进新能源产业的发展，为国家的绿色 GDP
贡献力量。同时，公司也将继续秉承为股东、为客户、为职工、为社会创造价值的理念，不断
将社会责任融入到公司发展的各个层面中去，成为受社会尊重的上市公司。 
详细内容请参见与本年报同时披露的《深圳长城开发科技股份有限公司 2010年度社会责任
报告》。 
六、 公司对高级管理人员的考评与激励机制、相关奖励制度的建立及实施情况 
公司建立了较为完善的绩效考核与评价体系。公司董事会下设薪酬与考核委员会，由独立
董事作为委员会的召集人，对高管人员的绩效进行评价。 
报告期内，公司严格按照年度经营业绩考核暂行办法对经营班子进行考核，使高级管理人
员的收入与责任、风险、业绩等进一步紧密相联。 


第六章   股东大会情况介绍 

报告期内，公司召开了三次股东大会，即第十八次（2009年度）股东大会、2010年度（第
一次）临时股东大会、2010年度（第二次）临时股东大会。 
一、 第十八次（2009年度）股东大会情况 
2010年 5月 14日，公司第十八次（2009年度）股东大会在本公司二楼五号会议室以现场方
式召开，会议决议公告刊登于 2010年 5月 15日的《中国证券报》、《证券时报》和巨潮资讯网。 
二、 2010年度（第一次）临时股东大会情况 
2010年 8月 19日，公司 2010年度（第一次）临时股东大会在本公司二楼五号会议室以现
场方式召开，会议决议公告刊登于 2010 年 8 月 20 日的《中国证券报》、《证券时报》和巨潮资
讯网。 
三、 2010年度（第二次）临时股东大会情况 
2010年 12月 7日，公司 2010年度（第二次）临时股东大会在本公司二楼五号会议室以现
场投票与网络投票相结合的方式召开，会议决议公告刊登于 2010年 12月 8日的《中国证券报》、
《证券时报》和巨潮资讯网。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
23 





第七章   董事会报告 

一、 管理层讨论与分析 
（一）经营情况回顾与展望 
2010年，在发达经济体稳步复苏和新兴经济体高速增长的带动下，世界经济形势呈现稳步
回升态势。公司所处的电子信息产业在世界经济稳步复苏的促进下开始走出低谷，电子信息产
品市场全面进入回升通道。在集团公司的正确领导下，公司积极推动产业结构调整，突出重点，
做强做大优势业务，同时加大科技创新力度，发展自主研发产品，各项业务都获得实质性增长
并继续呈现蓬勃发展的良好态势，2010 年全年主营业务突破 200 亿，实现了新的飞跃。报告期
间，公司还与台湾晶元光电等企业在厦门共同投资设立了 LED外延片项目，切入了新兴产业链
的高端。该项目的成功引入标志着公司正式进入新能源领域，是公司实施“两个转变”的重要
举措。 
报告期内，公司实现营业收入 207.71亿元，实现净利润 3.84亿元，分别比去年同期增长 54.95%
和 48.58%，净资产达到了 41.83亿元。 
(1) 硬盘相关产品 
公司硬盘相关产品包括：硬盘磁头、PCBA板、盘基片等。报告期间，公司硬盘相关产品实
现营业收入 88.06 亿元，较去年同期增长 19%。报告期内，公司磁头产品实现营业收入 42.5 亿
元，较去年同期增长 39.66%。重点客户希捷订单稳定增长，磁头业务好于预期，目前公司是希
捷全球唯一的服务器硬盘头堆生产制造供应商。2010年公司通过对现有设备进行调整并增加了
一批新的生产线，进一步扩大了磁头产能，满足了大客户希捷订单不断扩大的需求。苏州开发
的硬盘电路板销售稳定增长。2010 年度，硬盘电路板实现主营收入 35.93 亿元，较去年同期增
长 6.75%。希捷硬盘磁头出货量创苏州开发有史以来最高纪录。公司荣获希捷“2010 年供应商
奖”，这是希捷对公司多年来所做杰出贡献的肯定。报告期内，苏州二期厂房顺利投产，产能大
大提升，更好地满足了客户需求。同时，苏州海关正式批准苏州开发开展“委内加工”业务，
这也是园区内第一家获批开展该类业务的企业，此举将给公司带来更多的商机。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
24 

 (2) 自有产品 
报告期内，公司自有产品方面实现营业收入 4.19亿元，较去年同期增长 46%。计量产品实
现营业收入 3.42 亿元，较去年同期增长 27.78%。税控产品实现营业收入 2,019 万元，较去年同
期增长 25.45 %。数字产品销售额大幅提高，实现营业收入 5,632万元。公司继续加大自主产品
研发和市场开拓力度，产品线和市场范围进一步得到延伸与扩展。电表业务继续扩大在欧洲、
亚洲和南美地区的市场份额，并成功进入水表业务领域。税控机产品和金融 POS机产品在国内
多个省份实现市场突破，与中国移动支付开展 POS电子商务合作项目，并获得国外市场订单，
销售额有较大增长。数字家庭产品也在国内外的市场上有所斩获，新获印度和南美市场机顶盒
业务订单。 
知识产权方面，公司 2010年新申请专利 33项，其中发明 1件，实用新型 20件，外观 2件，
PCT 申请 3 件。新获 29 项专利授权，其中发明专利 2 项，实用新型 20 件，外观 7 件。新获 8
项软件著作授权。 目前公司拥有全部有效专利 63项，其中发明 4项，拥有授权软件著作权 42
项。 
 (3) 电子产品制造业务 
电子产品主要包括内存条、电子产品加工等。报告期内，该类制造业务实现销售额 114.93
亿,同比增长 102%。公司内存条、U盘业务实现营业收入 107.3 亿元，较去年同期增长 100.92%。
公司其他电子产品来料加工业务实现营业收入 7.62亿元，较去年同期增长 125.63%。报告期间，
公司不断拓展新的业务领域和合作伙伴，在手机、医疗器械等业务领域均取得较大的业绩增长。
公司先后引进了华勤、龙旗的手机业务。医疗器械方面继续扩大澳洲市场，并新增了新加坡市
场。南山分公司中兴手机月产量首次突破一百万个，荣膺“中兴手机百万月产能合作伙伴”殊
荣。随着业务量的快速增长，公司人员、设备及厂房需求也迅速增大。目前公司 SMT生产线已
达 100条。公司目前正在筹建东莞新的生产基地，以适应生产规模不断扩大的需求。 
报告期内，公司配合长科集团更新了《计算机及核心零部件专项规划》，并于 8月中旬，在
惠州成功召开 2010年度战略规划会，明确了公司在“十二五”末争取进入全球 IEMS企业前列、
每年复合增长 20%的发展目标。去年 12月，在中国电子的大力支持下，公司成功举行了“开发
晶照明（厦门）有限公司”LED 合资项目的签约仪式，并落户厦门火炬产业开发区。公司还参
与了中国电子在东莞虎门的基地建设项目。该基地一旦建成，将为公司进一步战略扩张奠定良
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
25 
好基础。另外，公司正在积极推动并进一步加强与捷荣的项目合作，同时也在努力寻找其它项
目投资机会，积极调整产业结构，以更好地促进公司各项业务的持续健康发展。 
（二）经营中面临的挑战及解决方案 
（1）复杂的经济环境带来的不利影响 
当前全球经济复苏基础仍然脆弱，全球经济面临的不确定性因素依然很多。在此背景下，
公司将继续保持稳健财务，积极开拓国内外市场，坚持相关行业多元化战略，培育朝阳行业的
大客户，分散与消减外部运营环境对公司业务的冲击。 
（2）人民币升值的影响 
迫于欧美等西方国家的压力，人民币可能在今后一段时间持续升值。公司 90%以上的产品
均出口，人民币汇率变动对公司影响较大，公司面临较大的人民币升值压力。为此，公司将采
取各种积极的财务措施如远期结汇、用美元贷款支付供应商货款、开展 NDF远期外汇交易组合
业务等来规避人民币升值产生的影响。 
（3）用工成本增加、面临招工困难的状况 
新《劳动合同法》的实施和深圳市最低工资标准大幅调高，去年底公司也大幅调整了员工
的薪酬待遇，公司人工成本有明显增加。对此，公司制定并实施了一系列应对措施，包括公司
人事政策调整、员工年活动、工人薪酬提升、员工关爱行动、与技工学校建立良好的校企关系
等，共建和谐劳动关系，为公司稳健发展保驾护航。 
展望 2011年，公司将抓住机遇，努力在保持公司各项业务良好发展态势的前提下，坚持以
集团“十二五”规划纲要为引领，除快速推进厦门 LED等各项重大项目外，公司本部也将继续
在芯片封装领域进行投资，以满足开发晶和中国电子集团内的市场需求，积极研发和寻找高附
加值的产品和业务，逐步建立以业务为导向的运营管理体系，着力提升先进制造能力，不断提
升产品设计、新产品导入、物流及客户服务等全价值链服务能力，同时还要加强科技创新能力
的培养，大力发展战略性新兴产业，加快发展方式的转变，做强长城开发。 
二、 公司经营情况 
1. 主营业务范围及其经营状况 
（1） 经批准的公司经营范围：开发、生产、经营计算机软、硬件系统及其外部设备、通讯设
备、电子仪器仪表及其零部件、原器件、接插件和原材料，生产、经营家用商品电脑及
电子玩具（以上生产项目均不含限制项目）；金融计算机软件模型的制作和设计、精密模
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
26 
具 CAD/CAM技术、节能型自动化机电产品和智能自动化控制系统、办公自动化设备、激
光仪器、光电产品及金卡系统、光通讯系统和信息网络系统的技术开发和安装工程；商
用机器（含税控设备、税控系统）、机顶盒、表计类产品（水表、气表等）、网络多媒体
产品的开发、设计、生产、销售及服务；金融终端设备的开发、设计、生产、销售、技
术服务、售后服务及系统集成；经营进出口业务。 
（2） 报告期内，主要经营指标情况                                  单位：人民币元 
变动原因分析： 
A、 报告期内，公司营业收入比去年同期增长 54.95%，主要原因是今年全球经济逐步复苏，
公司订单增加； 
B、 报告期内，公司营业利润比去年同期增长 36.65%，主要原因是投资收益与上年相比有较
大幅度的增加； 
C、 报告期内，公司归属于上市公司股东的净利润比去年同期增长 48.58%，主要原因是投资
收益与上年相比有较大幅度增加。 
（3） 报告期内，公司利润构成情况 
报告期内，公司利润构成整体情况与上年相比有所变化，其中因本期出售昂纳光通信股份
导致本期投资收益大幅增加，其占利润总额的比例有较大幅度上升。因投资收益占利润总额的
比重增加导致主营业务利润占利润总额的比重有所下降。 
（4） 报告期内，分行业类别的主营业务收入和利润构成情况               单位：人民币元 
产   品 营业收入 营业成本 毛利率 （%） 
营业收入比
上年同期  
增减（%） 
营业成本比
上年同期  
增减（%） 
毛利率比去年同期增减 
计算机及相关设
备制造业 20,717,278,115.82 20,228,208,542.27 2.36% 55.14% 57.05% 
减少 1.19个 
百分点 
其他业务 54,262,922.35 37,230,883.72 31.39% 5.68% 6.77% 
减少 0.69个 
百分点 
合    计 20,771,541,038.17 20,265,439,425.99 2.44% 54.95% 56.91% 
减少 1.22个 
百分点 



项  目 2010年度 2009年度 增减（%） 
营业收入 20,771,541,038.17 13,405,312,857.43 54.95% 
营业利润 417,522,755.98   305,541,924.57 36.65% 
归属于上市公司股东的净利润 384,257,878.66   258,619,909.73 48.58% 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
27 

（5） 报告期内，分产品类别的主营业务收入和利润构成情况                单位：人民币元 
产   品 营业收入 营业成本 毛利率 （%） 
营业收入比
上年同期 
 增减（%） 
营业成本比
上年同期  
增减（%） 
毛利率比去年同期增减 
硬盘相关产品 8,806,187,964.78 8,666,518,176.91 1.59% 19.14% 21.58% 
减少 1.98个 
百分点 
自有产品 418,572,625.09 323,766,408.73 22.65% 46.13% 48.51% 
减少 1.24个 
百分点 
OEM产品 11,492,517,525.95 11,237,923,956.63 2.22% 102.48% 103.07% 
减少 0.28个 
百分点 
合    计 20,717,278,115.82 20,228,208,542.27 2.36% 55.14% 57.05% 
减少 1.19个 
百分点 
其中：关联交易    75,874,299.55    73,344,587.15 3.33% 6.38% 7.83% 减少 1.30个 百分点 

（6） 报告期内，分产品地域分布的主营业务收入和利润构成情况            单位：人民币元 
地    区 营业收入 营业成本 营业收入比上年同期增减（%） 
营业成本比上年同
期增减（%） 
中国（含香港） 602,166,526.09 465,707,393.67 14.86% 4.39% 
亚太地区（中国除外） 9,284,896,556.18 9,028,368,371.72 25.15% 27.09% 
北 美 洲 10,792,497,116.63 10,704,574,209.63 100.21% 101.39% 
其    他 37,717,916.92 29,558,567.25 90.22% 105.60% 
合    计 20,717,278,115.82 20,228,208,542.27 55.14% 57.05% 

（7） 占公司营业收入或营业利润总额 10%以上的产品销售情况              单位：人民币元 
产   品 营业收入 营业成本 毛利率 （%） 
营业收入比
上年同期  
增减（%） 
营业成本比
上年同期  
增减（%） 
毛利率比去年同期增减 
硬盘相关产品 8,806,187,964.78 8,666,518,176.91 1.59% 19.14% 21.58% 
减少 1.98个 
百分点 
自有产品 418,572,625.09 323,766,408.73 22.65% 46.13% 48.51% 
减少 1.24个 
百分点 
OEM产品 11,492,517,525.95 11,237,923,956.63 2.22% 102.48% 103.07% 
减少 0.28个 
百分点 

（8） 公司主营业务及其结构变化情况 
报告期内，公司主营业务结构有所变化，主要是硬盘相关产品比重下降而 OEM产品比重增
加。本报告期主营业务毛利率较上年降低了 1.19%，主要原因是硬盘相关产品毛利率有所下降。 
（9） 报告期内，主要供应商、客户情况 
报告期内，公司向前五名供应商采购的金额合计 18,516,000,,005.03 元，占年度采购总额的
89.73 %；公司向前五名客户销售的合计金额 19,280,641,754.26元，占年度销售总额的 92.83%。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
28 

2. 公司财务状况分析 
（1） 公司财务状况                                                单位：人民币元 
指标项目 2010年 2009年 增减变动（%） 
总资产 6,666,538,139.82 5,428,294,599.13   22.81% 
归属于上市公司股东的所有者权益 4,183,036,283.55 3,630,897,925.14   15.21% 
现金及现金等价物净增加额 -204,364,785.50  171,424,439.09 -219.22% 

变动原因： 
A、 截止报告期末，总资产比去年同期增长 22.81%，主要是因为主营业务收入增长导致应收
帐款有较大幅度增长所致； 
B、 截止报告期末，归属于上市公司股东的所有者权益比去年同期增长 15.21%，主要是由于
本年净利润与上年相比有一定幅度增长； 
C、 报告期内，现金及现金等价物净增加额比上年减少 375,789,224.59 元，主要是由于投资
活动现金流出大幅增加所致。 
（2） 公司资产构成情况                                            单位：人民币元   
2010年 2009年 
项目 金额(元) 占总资产的比重(%) 金额(元) 
占总资产
的比重(%) 
占总资产的比重 
增长百分点 
总资产 6,666,538,139.82 100.00% 5,428,294,599.13 100.00% - 
货币资金 1,779,646,183.21 26.70% 1,866,328,409.69 34.38% 减少 7.68 个百分点 
交易性金融资产            - -  10,307,177.46 0.19% 减少 0.19 个百分点 
应收票据 48,041,789.22 0.72% 7,287,350.23 0.13% 增加 0.59 个百分点 
预付款项 34,441,686.37 0.52% 56,651,530.75 1.04% 减少 0.52 个百分点 
应收帐款 1,474,416,408.63 22.12% 997,951,939.81 18.38% 增加 3.74 个百分点 
应收利息 25,659,470.54 0.38% 21,517,770.00 0.40% 减少 0.02 个百分点 
其他应收款 23,633,546.99 0.35% 42,696,038.52 0.79% 减少 0.44 个百分点 
存货 648,226,692.17 9.72% 430,504,213.94 7.93% 增加 1.79 个百分点 
其他流动资产 23,707,811.55 0.36% 9,948,068.25 0.18% 增加 0.18 个百分点 
可供出售金融资产 392,558,850.25 5.89% - - 增加 5.89 个百分点 
持有至到期投资 - - 30,992,986.24 0.57% 减少 0.57 个百分点 
长期股权投资 537,905,882.34 8.07% 334,260,675.93 6.16% 增加 1.91 个百分点 
投资性房地产 135,084,077.74 2.03% 155,587,178.99 2.87% 减少 0.84 个百分点 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
29 
固定资产 1,337,156,668.91 20.06% 1,307,041,201.44 24.08% 减少 4.02 个百分点 
在建工程 128,001,856.57 1.92% 61,051,643.69 1.12% 增加 0.80 个百分点 
无形资产 12,212,181.48 0.18% 12,466,887.72 0.23% 减少 0.05 个百分点 
长期待摊费用 17,788,699.20 0.27% 33,169,597.73 0.61% 减少 0.34 个百分点 
递延所得税资产 48,056,334.65 0.72% 50,531,928.74 0.93% 减少 0.21 个百分点 
变动原因： 
A、 货币资金占资产总额的比重有所减少，主要是因为经营活动及投资活动现金流出大幅增
加； 
B、 应收账款占资产总额的比重增加，主要是因为本期主营业务收入有较大幅度增长； 
C、 可供出售金融资产占资产总额的比例增加，主要是因为可供出售权益工具增加； 
D、 长期股权投资占总资产的比重有所增加，主要是由于本公司之权益法核算的投资公司
O-Net Communications（Group) 2010年在香港联合交易所主板上市形成了资本溢价所致； 
E、 固定资产占总资产的比重减少，主要是因为应收帐款和可供出售金融资产占资产比重增
加所致。 
（3） 公司期间费用、所得税等变化情况                              单位：人民币元 

项目 2010年 2009年 增减(%) 
销售费用    51,009,662.89    57,844,670.83 -11.82% 
管理费用   239,719,823.62       196,527,900.63  21.98% 
财务费用   -19,685,881.33       -31,348,161.66  -37.20% 
所得税费用   43,379,553.75    44,453,992.93  -2.42% 
变动原因： 
A、 销售费用减少，主要是由于出口产品运费减少； 
B、 管理费用增加，主要是由于研发费、租赁费等大幅增加所致； 
C、 财务费用有较大幅度增长，主要是由于人民币升值导致汇兑损失增加。 
（4） 公司现金流量情况                                            单位：人民币元 
项目 2010年 2009年 增减(%) 
经营活动产生的现金流量净额    114,433,971.14   493,691,448.31 -76.82% 
投资活动产生的现金流量净额   -385,235,254.74  -237,141,209.97 62.45% 
筹资活动产生的现金流量净额    70,208,826.06   -82,697,142.94 184.90% 
现金及现金等价物净增加额   -204,364,785.50   171,424,439.09 -219.22% 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
30 
变动原因： 
A、 经营活动产生的现金流量净额减少，主要原因是公司控股子公司开发磁记录保证金资金
增加； 
B、 投资活动产生的现金流量净额减少，主要是由于本年固定资产购建支出增加； 
C、 筹资活动产生的现金流量净额增加，主要原因是银行借款增加； 
D、 以上三个因素综合影响，导致现金及现金等价物净增加额减少。 
（5） 报告期内，公司经营活动产生的现金流量与报告期净利润不存在重大差异。 
（6） 报告期内，公司主要资产采用的计量属性 
报告期内，公司以权责发生制为记帐基础，会计要素发生时，除以公允价值计量且其变动
计入当期损益的金融资产或金融负债采用公允价值计量外，其他均采用历史成本计量。公司主
要资产采用的计量属性详见审计报告之会计附注四“主要会计政策、会计估计和合并财务报表
的编制方法”。报告期内，公司计量属性未发生变化。 
（7） 公司无控制的特殊目的主体情况。 
（8） 公允价值计量相关的内部控制制度 
公司根据《企业会计准则》及财政部《企业内部控制基本规范》的相关规定，对公允价值
的取得、计量、披露、使用的假设以及选择适当的估价方法都进行了慎重的选择。财务核算方
面，公司严格按照企业会计准则的相关规定进行核算；在内部核算方面，公司指派专人对公允
价值进行确认，并接受内、外部审计，对审计过程中提出的问题，及时进行改进。 

（9） 采用公允价值计量的项目                                        单位：人民币元 
项目 期初金额 本期公允价值变动损益 
计入权益的累计
公允价值变动 
本期计提
的减值 期末金额 
金融资产： 
其中：1.以公允价值计量且其变
动计入当期损益的金融资产  10,098,817.46     -98,817.46    
其中：衍生金融资产      
2.可供出售金融资产   211,108,853.45  392,558,850.25 
3.交易性权益工具投资    208,360.00    
金融资产小计  10,307,177.46 -98,817.46 211,108,853.45  392,558,850.25 
金融负债   
投资性房地产   
生产性生物资产   
其他   
合计  10,307,177.46 -98,817.46 211,108,853.45  392,558,850.25 

                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
31 

（10） 采用公允价值计量的金融工具或投资性房地产情况 
报告期内，公司出售了南京证券—神州 2 号稳健增值集合资产管理计划产品，产生公允价
值变动损益-98,817.46元，截止报告期末余额为 0。可供出售金融资产余额为 392,558,850.25元，
为按公允价值计量的对中国光大银行及中国长城计算机深圳股份有限公司的投资，公允价值变
动部分 211,108,853.45元已计入资本公积。 
报告期内，公司没有采用公允价值计量的投资性房地产项目。 
（11） 公司未持有外币金融资产和金融负债。 
（12） 报告期内，公司没有衍生品投资的情况。   
3. 公司主要控股公司及参股公司的经营情况及业绩（单位：人民币元） 
（1） 开发科技（香港）有限公司【简称“开发香港”】 
“开发香港”注册资本为港币 390万元，本公司直接持有其 100%股权，该公司主要从事商
业贸易。2010 年度该公司的主营业务收入为 1,919,889.05 万元，净利润为 24,932.81 万元，总资
产为 195,171.04万元，净资产为 73,091.21万元。 
（2） 深圳开发微电子有限公司【简称“开发微电子”】 
“开发微电子”注册资本为 2,000 万美元，本公司和全资子公司“开发香港”分别持有其
70%和 30%的股权，该公司主营业务为生产内存条、U 盘以及其他 OEM 业务等。2010 年度该公
司的主营业务收入为 20,355.66万元，净利润为 9,336.04万元，总资产为 33,447.45万元，净资产
为 26,614.61万元。 
（3） 苏州长城开发科技有限公司【简称“开发苏州”】 
“开发苏州”注册资本为 6,000万美元，本公司和全资子公司“开发香港”分别持有其 75%
和 25%的股权。该公司主要从事开发、设计、生产大容量磁盘驱动器磁头、电脑硬盘用线路板
等相关电子部件，销售自产产品并提供相关售后服务；税控收款机、金融 POS机的技术咨询和
上门维修服务。2010年度该公司的主营业务收入为 77,837.34万元，净利润为 2,877.46万元，总
资产为 97,316.03万元，净资产为 47,404.48万元。 
（4） 深圳开发光磁科技有限公司【简称“开发光磁”】 
“开发光磁”注册资本为人民币 1,600万元，本公司和全资子公司“开发香港”分别持有其
75%和 25%的股权，该公司主要从事生产经营新型电子元器件、数字摄录机及相关产品的开发。
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
32 
2010年度该公司的主营业务收入为 15,748.69万元，净利润为 189.12万元，总资产为 4,616.40万
元，净资产为 2,406.56万元。 
（5） 深圳开发磁记录股份有限公司【简称“开发磁记录”】 
“开发磁记录”注册资本为 2.51亿元人民币，本公司持有其 57%股权，该公司主要从事硬
盘盘基片的开发、研制、生产和销售等。2010年度该公司的主营业务收入为 96,309.65万元，净
利润为-6,111.54万元，总资产为 115,225.71万元，净资产为 68,444.79万元。开发磁记录本年度亏
损的主要原因为：年度内硬盘盘基片市场竞争更加激烈而致业务规模有所下滑，毛利率有较大
幅度降低；同时鉴于市场前景及技术更新等因素考虑，对其 2008 年投资的一条价值 2,577 万元
电镀生产线进行报废处理；对参股公司深圳东红开发磁盘有限公司（简称“东红公司”）的委托
贷款计提减值准备 2,869万元，东红公司股东已于 2010年 12月 30日决定对其进行清算处理。 
（6） 深圳开发技研汽车电子有限公司【简称“开发技研”】 
“开发技研”注册资本为人民币 650万元，本公司持有其 55%股权，该公司主要从事研发、
生产和销售汽车电子相关产品及技术，并提供相应的售后服务和技术支持。2010年度该公司的
主营业务收入为 89.24万元，净利润为-363.65万元，总资产为 426.81万元，净资产为 219.24万元。 
（7） 昂纳光通信（集团）有限公司【简称“昂纳光通信”】 
2010年 4月 29日“昂纳光通信”于香港联合交易所上市，目前注册资本为 390.000港元，
本公司全资子公司“开发香港”持有其 27.32%股权，该公司主要从事高速通信及数据通讯网络
中无源光网络子元器件，模块和子系统产品等。2010年度该公司的主营业务收入为 57,186.15万
元，净利润为 15,721.89万元，总资产为 120,641.37万元，净资产为 106,314.17万元。 
（8） EXCELSTOR GROUP LIMITED   
EXCELSTOR GROUP LIMITED，注册资本为 1,500万美元，本公司的全资子公司“开发香港”
直接持有其 33.33%股权，该公司主要从事硬盘驱动器的开发、研制、生产及销售。2010年度该
公司的主营业务收入为 67.78 万元，净利润为 961.36 万元，总资产为 13,612.39 万元，净资产为
9,375.32万元。 
4. 投资收益对公司净利润影响达到 10%以上的参股公司经营情况及业绩   单位：人民币万元 
公司名称 业务性质 主要产品 注册资本 主营业务收入 主营业务利润 净利润 
昂纳光通信（集
团）有限公司 
开发、制造光通
信产品零部件 
光通信元器
件和模块 
股本 833.95 
万港元     57,186.15     29,244.73 15,721.89 
深圳开发磁记录
股份有限公司 研制、生产、销售硬盘盘片 硬盘盘片 25,136.26 96,309.65 3,190.44 -6,111.54 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
33 

三、 报告期内公司投资情况  
截止 2010年 12月 31日，公司长期股权投资总额为 537,905,882.34元，比上年同期增长 60.92%。 
1. 报告期内，本公司无募集资金或报告期之前募集资金的使用延续到报告期内的情况。 
2. 非募集资金投资情况 
（1） 设立海南全资子公司及购置研发大楼事宜 
2010年 3月 21日，经公司第五届董事会审议，同意本公司在海南生态软件园设立全资子公
司，该公司注册资本为 700 万元人民币，主要从事智能电表及嵌入式软件、系统软件、支付终
端软件和其它相关研发业务等。同时，为满足公司拟设立的海南全资子公司办公及业务开展需
要，同意其与中国电子信息产业集团有限公司的全资子公司海南生态软件园投资发展有限公司
签署《海南生态软件园研发楼定制合同》，以每平方米 3,299元的价格购置一栋建筑面积 2000平
方米的研发大楼，总投资额为 659.80万元人民币。 
（2） 参股捷荣模具工业（东莞）有限公司 
根据公司 IEMS 发展战略，为进一步完善公司产业链布局，加快进入模具制造领域，2010
年 3月 20日，经公司第五届董事会批准，本公司以价值 9,354,382元人民币的自有设备投资捷荣
科技集团旗下的全资子公司捷荣模具工业（东莞）有限公司。根据合作合同约定，本公司以捷
荣模具经评估（龙源智博评报字[2009]第 B-134 号）的净资产为依据投资入股，双方按照中外合
作经营企业方式共同开发、生产和销售模具及手机外壳等产品。目前该公司正在进行股份制改
造，公司将根据项目进展情况及时履行后续相关信息披露义务。 
（3） 深圳长城科美技术有限公司增资事宜 
2010年 10月 13日，公司第六届董事会审议通过了《关于向深圳长城科美技术有限公司增
资的议案》，同意本公司、北京沃美科贸有限公司、沃美国际有限公司按原持股比例向长城科美
增资 1000万元人民币，其中本公司出资额为 350万元，增资后其注册资本为 2000万元人民币，
本公司、北京沃美、沃美国际分别持有 35%、35%和 30%股权。2011年 2月 1日已完成工商变更
登记手续。 
（4） 合资设立开发晶照明（厦门）有限公司 
2010年 9月 29日，经公司第六届董事会第七次会议审议，同意本公司与 Epistar JV Holding (BVI) 
Co., Ltd.、亿冠晶（福建）光电有限公司和 Country Lighting (BVI) Co., Ltd.合资设立开发晶照明（厦
门）有限公司，以共同投资建设 LED产业化项目，从事高亮度 LED外延片、芯片、LED光源模
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
34 
块、灯源及灯具的研发、生产和销售。该项目首期投资总额 1.6亿美元，注册资本 1.2亿美元，
本公司、Epistar、亿冠晶、Country Lighting分别持有 44%、40%、9%、7%的股权，Country Lighting
为本公司一致行动人。 
2010年 12月 27日，经公司第六届董事会第九次会议审议，公司与合资各方签署合资合同，
同时，鉴于 LED产业广阔的市场发展前景，同意 LED产业化项目投资总额增至 4.9亿美元，注
册资本增至 2.4亿美元，于首期 30台 MOCVD产能建置完成后，再增加剩余之注册资本。公司整
个 LED产业化项目将根据市场情况来决定追加投资的时机，并届时具体履行相应的审批程序。 
以上事宜相关公告详见 2010年 10月 8日、2010年 12月 28日、2011年 1月 18日的《中国
证券报》、《证券时报》和巨潮资讯网。 
四、 信永中和会计师事务所为本公司出具了标准无保留意见的审计报告。 
五、 本集团本年度不存在重大会计政策、会计估计变更和前期差错更正事项。 
六、 董事会日常工作情况 
1. 公司董事会主要会议情况及决议内容 
（1）第五届董事会第二十五次会议 
2010年2月1日，公司第五届董事会第二十五次会议以通讯方式召开，相关决议公告刊登于
2010年2月2日的《中国证券报》、《证券时报》上。 
（2）第五届董事会第二十六次会议 
2010年4月22日，公司第五届董事会第二十六次会议在本公司二楼五号会议室召开，相关决
议公告刊登于2010年4月24日的《中国证券报》、《证券时报》上。 
（3）第五届董事会第二十七次会议 
2010年4月29日，公司第五届董事会第二十七次会议以通讯方式召开，相关决议公告刊登于
2010年4月30日的《中国证券报》、《证券时报》上。 
（4）第六届董事会第一次会议 
2010年5月14日，公司第六届董事会第一次会议以现场和通讯方式召开，相关决议公告刊登
于2010年5月15日的《中国证券报》、《证券时报》上。 
（5）第六届董事会第二次会议 
2010年6月24日，公司第六届董事会第二次会议以通讯方式召开，相关决议公告刊登于2010
年6月25日的《中国证券报》、《证券时报》上。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
35 

（6）第六届董事会第三次会议 
2010年8月2日，公司第六届董事会第三次会议以通讯方式召开，相关决议公告刊登于2010
年8月4日的《中国证券报》、《证券时报》上。 
（7）第六届董事会第四次会议 
2010年8月11日，公司第六届董事会第四次会议以通讯方式召开，相关决议公告刊登于2010
年8月12日的《中国证券报》、《证券时报》上。 
（8）第六届董事会第五次会议 
2010年8月27日，公司第六届董事会第五次会议以通讯方式召开，相关决议公告刊登于2010
年8月31日的《中国证券报》、《证券时报》上。 
（9）第六届董事会第六次会议 
2010年9月16日，公司第六届董事会第六次会议以通讯方式召开，相关决议公告刊登于2010
年9月18日的《中国证券报》、《证券时报》上。 
（9）第六届董事会第七次会议 
2010年9月29日，公司第六届董事会第七次会议以现场和通讯方式召开，相关决议公告刊登
于2010年10月8日的《中国证券报》、《证券时报》上。 
（9）第六届董事会第八次会议 
2010年10月27日，公司第六届董事会第八次会议以通讯方式召开，相关决议公告刊登于2010
年10月29日的《中国证券报》、《证券时报》上。 
（9）第六届董事会第九次会议 
2010年12月27日，公司第六届董事会第九次会议以通讯方式召开，相关决议公告刊登于2010
年12月28日的《中国证券报》、《证券时报》上。 
2. 董事会对股东大会决议的执行情况 
报告期内，公司董事会根据《公司法》、《证券法》等有关法律、法规及《公司章程》的要
求，严格按照股东大会的决议和授权，认真执行股东大会通过的各项决议事项。 
2010年5月14日，公司召开第十八次（2009年度）股东大会，审议通过了公司2009年度利润
分配方案：以2009年度年末总股本（879,518,521）为基数, 向全体股东每10股送红股2股，派2元
人民币现金（含税，扣税后，个人、证券投资基金、合格境外投资者实际每10股派1.6元）；同
时，以资本公积金向全体股东每10股转增3股。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
36 

2010年6月3日，公司在《中国证券报》、《证券时报》上刊登了《2009年度权益分派实施公告》，
确定股权登记日为2010年6月9日，除权除息日为2010年6月10日，并于2010年6月10日完成了全体
股东的权益分派工作。 
3. 董事会审计委员会的履职情况 
（1） 审计委员会工作情况 
公司董事会审计委员会由3名董事组成，其中2名为独立董事，主任委员由会计专业人士担
任。公司审计委员会的成员为周俊祥先生（主任委员）、张鹏先生和陈建十先生。 
报告期内，公司审计委员会严格按照《董事会审计委员会工作条例》和《审计委员会年报
审计工作程序》的有关规定，认真履行职责并开展工作，于报告期内召开3次审计委员会会议和
沟通会，进行通讯表决7次，对审计工作安排、定期财务报告、会计师事务所选聘、内部控制建
设、规范财务会计基础工作、选举主任委员、建立财务会计相关负责人管理制度等事项进行了
审议，多次与年审注册会计师沟通，并重点关注了财务会计基础工作专项活动自查以及整改情
况，进一步推动公司提升和规范了财务会计基础工作。 
报告期内，审计委员会在公司年度财务报告编制过程中，主要完成以下工作： 
① 认真审阅公司 2009年度审计工作计划及相关资料，与年审注册会计师确定公司 2009年
度财务报告审计工作的时间安排。 
② 认真审阅公司 2009年度未经审计财务报表，并出具了书面意见。 
③ 不断加强与年审注册会计师的沟通，曾两次发函督促其在约定时限内提交审计报告。 
④ 听取公司 2009年度经营情况、财务工作情况、内部审计工作情况以及年审注册会计师
对公司审计情况的汇报。 
⑤ 年审注册会计师出具初步审计意见后，公司董事会审计委员会、独立董事、公司管理
层与年审注册会计师进行了沟通，再次审阅了公司 2009年度财务报表，并形成了书面
意见。 
⑥ 在信永中和会计师事务所出具 2009年度审计报告后，董事会审计委员会召开会议，对
信永中和会计师事务所从事公司本年度审计工作进行了总结，并就公司年度财务会计
报表进行表决并形成决议。 
⑦ 关于续聘信永中和会计师事务所的决议。 
⑧ 对公司定期报告进行审阅并发表书面意见。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
37 
⑨ 与信永中和协商沟通确定 2010年度审计工作计划安排。 
（2） 审计委员会对公司 2010年度财务报告的审阅意见、年度审计工作总结报告及相关决议 
① 关于未经审计财务报表的书面审阅意见 
董事会审计委员会对未经审计的公司2010年财务报表进行审阅并发表书面意见如下：公司
2010年度未经审计财务报表已按照新企业会计准则及公司有关财务规定编制，同意将未经审计
的2010年度财务报表送年审注册会计师审计。 
② 关于年审注册会计师出具初步审计意见后的书面审阅意见 
董事会审计委员会按照有关规定，认真履行监督和核查职能，通过前期与年审注册会计师
的充分沟通，并根据公司实际情况，在年审注册会计师出具初步审计意见后，再次审阅了公司
2010年度财务会计报表，认为： 
公司 2010年度财务会计报表已按照新会计准则的规定编制，在所有重大方面公允地反映了
公司截止 2010年 12月 31日的财务状况以及 2010年度的经营成果和现金流量，公司财务会计报
表真实、准确、完整地反映了公司的整体情况。我们对信永中和会计师事务所年审注册会计师
初步审定的公司 2010年度财务报表没有异议。 
③ 关于年审注册会计师审计的 2010年财务报告的书面审阅意见 
董事会审计委员会成员根据其专业知识与经验，按照中国证监会有关的规定和要求，对公
司财务部 2011 年 3 月 16 日提交的、经信永中和年审注册会计师审计的财务会计报告进行了审
阅，对会计资料的真实性、完整性以及财务会计报告是否严格按照新会计准则和公司有关财务
制度规定编制以及资产负债表日期后事项予以了重点关注。 
通过与信永中和年审注册会计师沟通审计意见以及审阅相关报告后，发表书面意见如下： 
公司 2010年度财务会计报告已经按照新企业会计准则及公司有关财务规定编制，在所有重
大方面公允地反映了公司截至 2010年 12月 31日的财务状况以及 2010年度的经营成果和现金流
量，同意将经年审注册会计师审计的 2010年度财务报告报请公司董事会审议。 
④ 审计委员会对公司 2010年度审计工作总结报告及相关决议 
2011年3月28日，公司审计委员会召开会议，对信永中和会计师事务所从事公司2010年度财
务审计工作进行了总结，认为：信永中和已按照中国注册会计师独立审计准则的要求，在审计
过程中能够恪尽职守，遵守独立、客观、公正的职业准则，较好地完成了公司及下属子公司2010
年财务报告审计工作，出具的审计报告能够公允地反映公司2010年度的财务状况以及2010年度
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
38 
的经营成果和现金流量，出具的审计结论符合公司的实际情况。 
董事会审计委员会经审议，提议续聘信永中和会计师事务所有限责任公司为公司2011年度财
务报告审计单位，年度审计费用约为86.88万元人民币（含境外控股子公司），公司不承担事务所
派员到公司审计所发生的差旅费等费用。 
4. 董事会薪酬与考核委员会履职情况 
公司董事会薪酬与考核委员会成员由3名董事组成，其中2名为独立董事，主任委员由独立
董事担任。公司薪酬与考核委员会的成员为李致洁先生（主任委员）、周俊祥先生和郑国荣先生。 
报告期内，薪酬与考核委员会根据《董事会薪酬与考核委员会工作条例》，本着勤勉尽责的
原则，认真履职并开展了以下工作： 
① 认真核查年度报告所披露的公司董事、高管人员的薪酬情况，认为薪酬支付合理，符
合公司的薪酬政策和考核标准。 
② 本着责权利相统一的原则，根据公司的实际情况，向董事会提出调整公司第六届董事
会董事津贴的建议。 
③ 根据《长城开发经营业绩考核暂行办法》，结合公司 2009年度的实际情况，审慎提出了
2009年度经营班子的奖励建议。 
④ 2010年 5月在公司董事会换届选举后及时召开会议选举薪酬与考核委员会主任委员。 
七、 内幕信息知情人管理制度执行情况 
为进一步完善公司治理结构，强化公司信息披露管理，根据中国证监会的有关规定，公司
制定了《信息披露管理制度》、《非公开信息知情人保密制度》、《内幕信息知情人报备制度》，对
内幕信息的认定标准、保密责任、流转审批、登记备案、责任追究等予以明确规定，并在信息
披露工作中得以严格执行。 
报告期内，公司不存在内幕信息知情人在影响公司股价的重大敏感信息披露前，利用内幕
信息买卖公司股份的情况，也不存在受到监管部门的查处和整改等情况。 
八、 董事会对于内部控制责任的声明 
内部控制是由公司董事会、监事会、经理层和全体员工实施的、旨在实现控制目标的过程。 
董事会应按照国家法律法规和证券监管部门的要求，不断完善公司内部控制的规章制度，
推进公司内部控制的建立健全和有效运行，对公司各项内部控制制度建设的完整性、合理性承
担重要责任，公司经营班子对内控制度的执行性承担主要责任。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
39 

九、 利润分配预案及资本公积金转增股本预案 
1. 公司前三年现金分红情况                                       单位：人民币元   
 分红年度 现金分红金额 （含税） 
分红年度合并报表中
归属于上市公司 
股东的净利润 
占合并报表中归属于
上市公司股东的 
净利润的比率 
公司合并年度 
可分配利润 
2009年 175,903,704.20 258,619,909.73 68.02% 1,289,075,572.42 
2008年 131,927,778.15    322,738,594.81  40.88% 1,052,966,318.58 
2007年 351,807,408.40 709,204,268.29 49.61% 1,088,294,100.91 
最近三年累计现金分红金额占最近年均净利润的比例（%） 153.34% 
2. 2010年度利润分配预案 
公司利润分配及分红派息基于母公司可供分配利润，2010年度本公司按照《企业会计准则》
之合并及母公司可供分配利润情况如下：                             单位：人民币元 

项目 公司合并 母公司 
可供分配利润   1,321,526,042.88    546,856,568.37 
其中： 
2010年度净利润 384,257,878.66 119,180,249.96
结转年初可分配利润 1,289,075,572.42 779,483,726.61
分配2009年度股利 351,807,408.20 351,807,408.20
根据《公司法》、《企业会计准则》、《公司章程》之有关规定及本公司经营情况，本公司 2010
年度利润分配预案为：  
（1）以 2010年年末总股本 1,319,277,781股为基数，向全体股东每 10股派现 1.50元人民币 
（含税），合计派发现金股利 197,891,667.15 元。 
（2）由于公司盈余公积金已达注册资本 50%以上，根据《公司章程》的有关规定，公司 2010
年度不计提盈余公积金。 
此分配预案需经第十九次（2010年度）股东大会审议通过后方能实施。 
十、 其他报告事项 
报告期内，公司选定《中国证券报》、《证券时报》为信息披露指定报纸。 




                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
40 



第八章   监事会报告 


2010年度，公司监事会根据《公司法》、《公司章程》、《监事会议事规则》及有关法律、
法规规定，认真履行监督职责，对公司依法运作、财务管理和关联交易等事项行使了监督检查
职能，公司监事会在维护公司整体利益、股东合法权益、建立健全法人治理结构等方面发挥了
应有的作用。 
一、 监事会会议情况 
1. 2010 年 4 月 22 日，公司第六届监事会第四次会议在本公司六楼会议室召开，参加会议的监
事应到实到 5 人，会议由监事会主席宋建华先生主持，公司财务总监列席了会议。本次会议符
合《公司法》和《公司章程》的有关规定。会议审议并通过了如下事项：  
 《2009年度监事会工作报告》； 
 《关于 2009年年度报告全文及摘要》： 
 《关于 2009年度计提固定资产减值准备议案》； 
 《关于公司财务报表合并范围变化及相关数据追溯调整的议案》； 
 《公司监事会对公司董事会有关决议的意见》： 
 《公司监事会对公司 2009年度内部控制自我评价报告的意见》； 
 《关于监事津贴标准调整的议案》。 
本次会议决议公告刊登于 2010年 4月 24日的《中国证券报》、《证券时报》。 
2. 2010 年 4 月 29 日，公司第六届监事会第五次会议以通讯方式召开，应参加表决监事 5 人，
实际参加表决监事 5 人，本次会议的召开符合《公司法》和《公司章程》的有关规定。会议审
议并通过了《关于 2010年第一季度报告全文及正文》。 
3. 2010 年 8 月 30 日，公司第六届监事会第六次会议以通讯方式召开，应参加表决监事 5 人，
实际参加表决监事 5 人，本次会议符合《公司法》和《公司章程》的有关规定。会议审议并通
过了《关于 2010年半年度报告全文及摘要》。 
4. 2010年 10月 27日，公司第六届监事会第七次会议以通讯方式召开，应参加表决监事 5人，
实际参加表决监事 5 人，本次会议符合《公司法》和《公司章程》的有关规定。会议审议并通
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
41 
过了如下事项： 
 《关于 2010年第三季度报告全文及正文》； 
 《关于防止资金占用长效机制建立和落实情况的自查报告》。 
本次会议决议公告刊登于 2010年 10月 29日的《中国证券报》、《证券时报》。 
二、 监事会对公司有关事项的独立意见 
1.  公司依法运作情况 
报告期内，公司监事会监事列席了历次董事会会议，并根据国家有关法律、法规，通过审
阅报告、现场检查等多种方式对公司股东大会、董事会的召开程序、决策程序、董事会对股东
大会决议执行情况，公司董事、高级管理人员执行职务的情况及公司管理制度执行情况等进行
了监督。 
监事会认为，公司董事会能够严格按照《公司法》、《证券法》、《公司章程》及其他法律法
规的规定规范运作，严格执行股东大会的各项决议，决策程序合法有效，公司各项管理制度较
为健全并得到了执行。公司董事、高级管理人员能够勤勉尽职，执行公司职务时没有发现违反
国家法律、法规、公司章程或损害公司利益、股东权益的行为。监事会已经审阅了公司内部控
制自我评价报告，对评价报告不存在异议。 
2.  检查公司财务情况 
报告期内，公司监事会及时了解公司经营和财务状况，认真核查了公司季度、半年度、年
度财务报告及有关文件，并对各定期报告出具了审核意见。 
公司本年度财务报告已经信永中和会计师事务所审计并出具了标准无保留意见的审计报
告，监事会认为该审计报告客观、真实地反映了公司的财务状况和经营成果。 
3.  对公司募集资金使用情况的意见 
报告期内，公司无募集资金情况，也无以前年度募集资金延续到本报告期的情况。 
4.  对公司重大收购、出售资产行为的意见 
报告期内，公司没有重大资产收购的情况。关于出售资产情况主要有以公开挂牌方式出售
长城宽带网络服务有限公司 5%股权和拟以公开挂牌方式出售深圳海量存储设备有限公司 10%股
权。 
监事会认为，公司董事会就以上事项履行了相应的审议程序和信息披露义务，并符合相关
法律法规的规定，未发现内幕交易和损害公司股东利益或造成公司资产流失的情况。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
42 

5.  对公司关联交易的意见 
报告期内，公司关联交易决策程序合法、规范，关联交易价格公平、合理，未发现有损害
公司利益的情况。 


第九章   重要事项 



一、 报告期内，本公司无重大诉讼、仲裁等事项，也无涉及盗版软件的诉讼事项。 
二、 报告期内，本公司无破产重整事项。 
三、 报告期内，持有其他上市公司股权、金融企业股权情况 
1. 证券投资情况                                                   单位：人民币元 
序号 证券品种 证券代码 证券简称 
初始投资
金额 
（元） 
期末持有
数量 
（股） 
期末账面值
(元) 
占期末证
券总投资
比例(%) 
报告期损益(元)
（扣 22%企业所
得税） 
期末持有的其他证券投资 0.00 - 0.00 0.00% 0.00 
报告期已出售证券投资损益 - - - - 115,755.46 
合计 0.00 - 0.00 100% 115,755.46 
注：证券投资指公司报告期内进行的新股申购。公司新股申购事项已经公司第五届董事会
第七次会议审议通过。公司已严格按照《长城开发新股申购业务内部控制制度》的规定规范运
作。报告期内公司申购的新股已全部出售，累计损益（扣除 22%所得税后）为 115,755.46元。 
2. 持有其他上市公司股权情况                                         单位：人民币元 
证券代码 证券简称 初始投资金额（元） 
占该公司
股权比例
期末 
账面值 报告期损益
报告期所有
者权益变动 
会计核
算科目
股份 
来源 
00877 
(H股) 昂纳光通信 129,367,309.82 27.32% 290,450,309.63 196,270,888.40 371,434,429.54 
长期股
权投资 
发起人 
股份 
000066 长城电脑 159,999,996.80  2.70% 159,999,996.80 0.00 0.00 长期股权投资 
非公开 
发行认 
购股份 
601818 光大银行 21,450,000.00  0.15% 21,450,000.00 0.00 0.00 长期股权投资 
发起人 
股份 
合计 310,817,306.62 - 471,900,306.43 196,270,888.40 371,434,429.54 - - 


                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
43 
3. 持有非上市金融企业股权情况                                        单位：人民币元 
所持对象名称 初始    投资金额 
持有数量 
（股） 
占该公司 
股权比例 
期末 
账面值 
报告期 
损益 
报告期所有
者权益变动 
会计核算
科目 
股份来
源 
东方证券股份 
有限公司 71,550,000 10,000,000 0.30% 71,550,000 0.00 0.00 
长期股权
投资 
公开竞
价购买 
合计 71,550,000 10,000,000 - 71,550,000 0.00 0.00 - - 
4. 买卖其他上市公司股份的情况                                        单位：人民币元 
股份名称 期初股份数量 （股） 
报告期买入
股份数量
（股） 
报告期卖出 
股份数量 
（股） 
期末股份数量
（股） 
使用的 
资金数量 
产生的 
投资收益 
长城电脑         0 35,714,285       0  35,714,285 159,999,996.80 0.00 
昂纳光通信 266,688,420        0 13,759,183 252,929,237         0.00 29,011,744.74 
昂纳光通信 252,929,237        0 25,293,000 227,636,237         0.00 108,604,939.72 
合计 -       - 39,052,183 - 159,999,996.80 137,616,684.46 

四、 报告期内，公司收购、出售资产及吸收合并情况 
1. 报告期内，公司没有发生或以前期间发生并持续到报告期的企业吸收合并事项。 
2. 收购资产事项 
（1） 认购中国长城计算机深圳股份有限公司（简称“长城电脑”）非公开发行股份 
2009年 7月 16日，公司第五届董事会第十八次会议审议通过了《关于认购中国长城计算机
深圳股份有限公司非公开发行股票的议案》，同意以每股 9.03元认购长城电脑非公开发行股票不
超过 1771.87万股，认购金额不超过 1.6亿元人民币，该事项获得 2009年 11月 9日召开的 2009
年度（第一次）临时股东大会审计通过。 
2010年 4月 22日，长城电脑第四届董事会第十八次会议决定向全体股东派息、送股，并以
资本公积金转增股本，长城电脑董事会根据股东大会授权对发行价格进行了相应调整，发行价
格由每股 9.03 元调整为每股 4.48 元。本公司认购的股份数相应调整为不超过 3,571.43万股，认
购金额仍为不超过 1.6亿元人民币。 
2010年 11月 16日，本公司认购的长城电脑非公开发行股份 35,714,285股在深圳证券交易所
上市，股票限售期为 36个月，预计可上市流通时间为 2013年 11月 16日。 
以上事项对公司报告期财务状况及经营成果没有重大影响。相关公告参见 2009 年 7 月 17
日、2010年 3月 20日的《中国证券报》、《证券时报》和巨潮资讯网。 

                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
44 

3. 出售资产事项 
（1） 处置长城宽带网络服务有限公司（简称“长城宽带”）5%股权 
2010年 4月 14日，经公司第五届董事会审议，本公司与长城科技股份有限公司（简称“长
城科技”）、中国长城计算机深圳股份有限公司（简称“长城电脑”）一同公开挂牌出售所持有的
长城宽带共计 50%股权，其中本公司出售所持全部 5%股权，长城科技出售所持全部 40%股权，
长城电脑出售所持全部 5%股权。挂牌期内征集产生的意向受让方为成都鹏博士电信传媒集团股
份有限公司（简称“鹏博士”），摘牌价格与挂牌价格一致，其中本公司股权转让价格为人民币
4,226,000元。 
2010年 6月 24日，公司第六届董事会第二次会议以通讯表决方式审议通过了《关于与鹏博
士签署出售长城宽带 5%股权协议事项》，同意按照摘牌价格，和长城科技、长城电脑一同与鹏
博士签署《产权交易合同》。 
2010年 7月 26日，长城宽带另一股东中信网络有限公司（简称“中信网络”）发出《关于
行使优先购买权的函》，决定按照本公司所发出的《征询函》及本公司与鹏博士签署的《产权交
易合同》约定的交易条件行使对本公司转让的长城宽带股权的优先购买权。 
2010年 8月 11日，公司第六届董事会第四次会议审议通过了《关于变更出售长城宽带 5%
股权受让方的议案》，同意将出售长城宽带股权的受让方变更为中信网络，同日，本公司与中信
网络签署《产权交易合同》，其中本公司的股权转让价格为 4,226,000 元，其他主要交易条件不
变。 
2010年 9月 2日，公司已收到上述股权转让款项。以上事项对公司报告期财务状况及经营
成果没有重大影响。 
相关公告详见 2010年 4月 16日、2010年 6月 25日、2010年 7月 28日、2010年 8月 12日
的《中国证券报》、《证券时报》和巨潮资讯网。 
（2） 处置深圳海量存储设备有限公司（简称“海量存储”）10%股权 
由于海量存储大股东的战略调整，海量存储公司未来业务模式将发生变化，公司投资收益
存在不确定性，2010年 12月 8日，经公司第六届董事会审议，同意公司通过公开挂牌的方式出
售所持有的海量存储 10%股权。截止目前，该项目仍在进行中。 
相关公告详见 2010年 12月 10日的《中国证券报》、《证券时报》和巨潮资讯网。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
45 
五、 参股公司上市事宜 
1.  昂纳光通信在香港联交所上市 
2010年 4月 29日，本公司全资子公司开发科技（香港）有限公司（简称“开发香港”）持
股 46%的联营公司 O-Net Communications (Group) Ltd.（昂纳光通信（集团）有限公司，简称“昂纳
光通信”）在香港联合交易所主板上市，本公司通过开发香港间接持有昂纳光通信 266,688,420
股，持股比例由 46%降至 34.5%。 
2010 年 5 月，昂纳光通信行使超额配股权，开发香港售出超额配发股份 13,759,183 股，持
股数降至 252,929,237股，持股比例降至 32.72%。 
2010年 11月，昂纳光通信因战略发展需要定向增发 6,000万股，同时由大股东向特定对象
以每股 5.50港元的价格减持股份，其中第一大股东 O-Net Holdings减持 90,000,000股，开发香港
减持 25,293,000 股，减持后开发香港持有昂纳光通信股份为 227,636,237 股，占昂纳光通信增发
后总股本 833,095,240的 27.32%。 
相关公告详见 2010年 4月 14日、2010年 4月 29日、2010年 5月 13日、2010年 11月 2日
的《中国证券报》、《证券时报》和巨潮资讯网。 
2.  中国光大银行在上海交易所上市 
2010年 8月 18日，公司参股公司中国光大银行股份有限公司（简称“光大银行”）在上海
证券交易所发行上市，发行价为每股 3.10元，本公司持有 1210万股。根据有关规定，本公司所
持股份限售期为自光大银行股票在上交所上市交易之日起 12个月，预计可上市流通时间为 2011
年 8月 18日。 
该事项对公司报告期财务状况及经营成果没有影响。 
六、 报告期内，公司股权激励情况 
报告期内，公司未实施股权激励计划。 
七、 报告期内，公司重大关联交易事项 
1. 与日常经营相关的关联交易 
（1） 交易及审议情况：根据公司 2010年度生产经营情况，公司第五届董事会第二十六次会议审
议通过了公司与关联方长城易拓信息产品（深圳）有限公司、深圳长城科美技术有限公司
的日常关联交易框架协议。由于市场原因，公司向关联方实际销售金额与框架协议中的预
计金额略有差异。2010年度日常关联交易情况具体如下：             单位：人民币元 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
46 


向关联方销售产品和提供劳务 向关联方采购产品和接受劳务
关联方 交易金额 占同类交易 金额的比例 交易金额 
占同类交易 
金额的比例 
长城易拓信息产品(深圳)有限公司 23,719,964.63 0.11%  
深圳易拓科技有限公司 792,724.66 0.00% 1,443,240.45 0.01% 
Excelstor GreatWall International Limited. 274,507.81 0.00%   
深圳长城科美技术有限公司 52,318,749.36 0.25%  
深圳东红开发磁盘有限公司 2,646,219.86 0.01%  
合计 79,752,166.32 0.37% 1,443,240.45 0.01% 
其中：报告期内上市公司向控股股东及其子公司销售产品或提供劳务的关联交易金额
24,787,197.10元。 
以上关联交易为公司日常经营中的持续性业务，采用市场定价原则，没有损害公司利益，
预计此类关联交易仍将持续。以上关联交易不会影响公司的独立性，公司主营业务也不会因以
上关联交易而对关联方形成依赖。 
2. 资产收购、股权转让发生的关联交易  
详见本章之四（2）和四（3）。 
3. 公司与关联方共同对外投资发生的关联交易 
报告期内，公司未发生此类关联交易。 
4. 公司与关联方存在的债权、债务往来事项                           单位：人民币元 

 向关联方提供资金   关联方向上市公司提供资金 项目  发生额   余 额   发生额   余 额  
深圳易拓科技有限
公司*1 
受同一母公司及最终控
制方控制的其他企业 1,879,944.00 57,838.40 1,571,381.79 - 
中国长城计算机深
圳股份有限公司*2 
受同一母公司及最终控
制方控制的其他企业 133,275.96 2,320,762.48 -         - 
昂纳信息技术（深
圳）有限公司*3 联营公司之子公司 215,460.00 - 29,893,771.72 - 
深圳东红开发磁盘
有限公司*4 控股子公司之参股公司 708,134.48 1,208,442.00 - 788,830.00 
深圳东红开发磁盘
有限公司*5 控股子公司之参股公司 - 76,326,244.50 2,303,951.58 - 
韩国通用技术有限
公司*6 控股子公司之参股公司 - - 1,193,752.20          - 
合计 2,936,814.44 79,913,287.38 34,962,857.29 788,830.00 
其中：报告期内上市公司向控股股东及其子公司提供资金的发生额 2,013,219.96 元，余额
2,378,600.88元。 


                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
47 

注 1：主要是由于该公司租赁本公司办公场地而发生，截至目前，该公司能够按照协议如
期付款。 
注 2：主要是公司报告期内租赁长城电脑部分厂房所付租方押金。 
注 3：主要是由于昂纳光通信以前年度租赁本公司办公场地所形成，所欠款项已于报告期
内归还。 
注 4：主要是该公司租赁本公司控股子公司开发磁记录办公场地及厂房同时向其提供检测
服务所形成。 
注 5：主要是“开发磁记录”2005年-2006年委托中信银行深圳分行向“东红开发磁盘”提
供贷款所形成，公司于 2009年度将其纳入合并范围，截止 2010年 12月 31日，该项委托贷款已
全额计提减值准备，详见审计报告之附注八合并财务报表主要项目注释“11、持有至到期投资”。 
注 6：主要是本公司控股子公司开发磁记录为为韩国通用科技公司代购材料及垫付运杂费
1,193,752.20元予以核销。 
公司与关联方存在的上述债权债务性质关联交易，对公司的生产经营没有重大的实质性影
响。 

5. 与集团财务公司开展全面金融合作事宜 
（1） 协议签署情况 
2010年 9月 16日，公司第六届董事会第六次会议审议通过了《关于与关联方中国电子财务
有限责任公司（简称“中电财务”）签署全面金融合作协议议案》，同意由中电财务为本公司及
控股子公司提供资金结算、授信融资、银行承兑汇票贴现等金融服务，其中以信用方式获得中
电财务综合授信余额不超过 6亿元人民币，办理资金结算日存款余额最高不超过 6亿元人民币，
协议期限为三年。该事项已获 2010年 12月 7日召开的公司 2010年度（第二次）临时股东大会
审议批准。相关公告详见 2010年 9月 17日、2010年 12月 8日的《中国证券报》、《证券时报》
和巨潮资讯网（http://www.cninfo.com.cn）。 
（2） 存款情况 
信永中和会计师事务所为本公司在中电财务存款情况出具了《关于深圳长城开发科技股份
有限公司涉及财务公司关联交易的存款、贷款等金融业务的专项说明》，截止 2010 年 12 月 31
日，公司在中电财务办理存款余额为 190,013,050.00元人民币，详见下表： 


                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
48 

长城开发 2010 年度通过中国电子财务有限责任公司存款、贷款等金融业务汇总表 
 单位：人民币元 
项目名称 行次 
年初
余额 本年增加 
本年
减少 年末余额 
收取或支付利
息、手续费 
一、存放于中国电子财务
有限责任公司存款 1   - 190,013,050.00 - 190,013,050.00 13,050.00 
二、向中国电子财务有限
责任公司贷款 2   - - - - - 
合计    - 190,013,050.00 - 190,013,050.00 13,050.00 

（3） 利安达信隆会计师事务所关于在中国电子财务有限责任公司存款的风险评估报告 
利安达信隆会计师事务所对中国电子财务有限责任公司截止 2010年 12月 31日与财务报表
相关资金、信贷、投资、稽核、信息管理风险控制体系制定及实施情况进行了审核，并出具了
利安达专字〔2011〕第 A1066号《关于中国电子财务有限责任公司风险评估报告》，认为：中国
电子财务有限责任公司严格按银监会《企业集团财务管理办法》（中国银监会令〔2004〕第 5号）
规定经营，经营业绩良好，根据我们对风险管理的了解和评价，我们未发现中国电子财务有限
责任公司截止 2010年 12月 31日与财务报表相关资金、信贷、投资、稽核、信息管理风险控制
体系存在重大缺陷。报告全文详见巨潮资讯网 http://www.cninfo.com.cn。 
八、 重大合同及履行情况 
1.  托管、承包、租赁其他公司资产或其他公司托管、承包、租赁上市公司资产的事项 
报告期内，公司没有托管、承包其他公司资产或其他公司托管、承包上市公司资产的事项。 
（1）有关其他公司租赁上市公司资产情况如下： 
A) 根据本公司与关联公司深圳易拓科技有限公司签订的《房屋租赁合同》，“易拓科技”向本
公司租赁部分办公楼及厂房，面积共 1,123 平方米，月租金 49,412 元，租赁期 1 年；向本
公司租赁部分宿舍，月租金 7,200元，租赁期 1年。 
B) 根据本公司与沛顿科技（深圳）有限公司签订的《房租租赁合同》，沛顿科技向本公司租
赁部分办公楼及厂房，面积共 12,556 平方米，月租金 549,836 元，租赁期 1 年；向本公司
租赁部分宿舍，月租金 174,800元，租赁期 1年。 
（2）公司租赁其他公司资产情况如下： 
A)  根据本公司控股子公司深圳开发光磁科技有限公司与深圳市宝通达园林绿化养护工程有
限公司签订的《房屋租赁合同》，“开发光磁”向其租赁位于华富工业园区的厂房 8,677.5
平方米，月租金 123,206.32元，租赁期 4-5年；租赁部分宿舍，月租金 19,091.2元，租赁期
4-5年。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
49 
B) 根据本公司与深圳市曼哈商业有限公司签订的《房屋租赁合同》，本公司向其租赁位于深
圳市福田区彩田工业区 402 栋厂房第一层作为公司仓库使用，租赁面积 1,061.95 平方米，
月租金 58,407.25元，租赁期 1.5-2年。 
C) 根据本公司与深圳市曼哈商业有限公司签订的《房屋租赁合同》，本公司向其租赁位于深
圳市福田区彩田工业区 403 栋厂房第一层作为公司仓库使用，租赁面积 1,778 平方米，月
租金 62,230元，租赁期 1年。 
D) 根据本公司与深圳市洲地投资有限公司签订的《房屋租赁合同》，本公司向其租赁皇岗北
路平板荫罩厂 601栋一楼 A区作为公司仓库使用，租赁面积 1,691平米，月租金 23,674元，
租赁期 3年。 
E)  根据本公司与深圳市凯安储运有限公司签订的《房屋租赁合同》，本公司向其租赁宝安区
民治街道民兴工业区 8 栋仓储楼作为仓库使用，租赁面积 3,200 平米，月租金 80,000 元，
租赁期 1年。 
F)  根据本公司与深圳市金再昌企业咨询有限公司签订的《房屋租赁合同》，本公司向其租赁
部分员工宿舍，月租金 435,880元，租赁期 2-3年。 
G) 根据本公司与长城科技股份有限公司、中国长城计算机深圳股份有限公司签定《房屋租赁
合同》，本公司向其租赁位于南山区科发路 3 号长城科技大厦 2 号科研楼 10-12 层 4,055.97
平方米，月租金 255,526.11元，租赁期 2年；向其租赁 3号长城大厦 1号楼 2层 B段房产
3,379.32平方米，月租金 124,190.01元，租赁期 2年；向其租赁 3号长城大厦 1号楼 2层 B
段房产 1,726.82平方米，月租金 66,637.98元，租赁期 2 年；向其租赁 3号长城大厦 1号楼
2层 9,280平方米，月租金 341,040元，租赁期 2年；向其租赁 3号长城大厦 2号科研楼 13
层 1,267.15平方米，月租金 79,830.45元，租赁期 1年。 
H) 深圳长城开发铝基片有限公司为本公司持股 57%的深圳开发磁记录股份有限公司的全资子
公司，在本公司收购开发磁记录前其已与中国长城计算机深圳股份有限公司签署租赁合
同，租赁长城电脑石岩生产基地 19,353.60 平方米，月租金 391,420.10 元，租赁期 3-5 年；
租赁部分员工宿舍，月租金 91,790.00元，租赁期 3年。 
2. 重大业务合同情况 
国家电网公司于 2010年 11月 25日在其招投标网公告了“国家电网公司集中规模招标采购
2010年电能表第四批项目中标公告”，深圳长城开发科技股份有限公司（以下简称“本公司”）
为该项目第一分标“2级单相远程费控智能电能表”中标人，共中 5个包，共计 554,900只，合
同总价为 9,571万元人民币，目前合同已在履行中。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
50 
3. 委托理财事项                                                      单位：人民币元 
委托期限 受托人 委托金额 起始日期 终止日期** 
报酬确定 
方式 实际收益 
实际 
收回金额 
南京证券有限责任公司 10,000,000 2009.11.5 2010.8.3 开放日赎回 128,822.75 10,128,822.75 
合计 10,000,000 - - - 128,822.75 10,128,822.75 
注：2010 年 8月 3日，公司在开放日赎回了南京证券—神州 2号稳健增值集合资产管理计
划产品，实际回收金额为 10,128,822.75元。 
截止报告日，没有逾期未收回的委托理财本金和收益情况。 
4. 关于短期贷款美元事项 
根据公司第十八次（2009 年度）股东大会批准的《关于贷款不超过 9000 万美元的议案》，
截止 2010年 12月 31日，公司短期贷款美元余额为 6,664.10万美元，平均年利率约为 1.7976%。 
5. 其他重大合同 
（1） 2010年 3月 10日，公司以信用方式获得交通银行深圳振华支行等值 2亿元人民币综合授
信额度，期限 2年。 
（2） 2010年 6月 17日，公司以信用方式获得中国建设银行股份有限公司深圳分行等值 2.5亿
人民币综合授信额度，期限 1年。 
（3） 2010年 7月 15日，公司以信用方式获得深圳发展银行深圳新洲支行等值 5000万美元综
合授信额度，期限 1年。 
（4） 2010 年 11 月 17 日，公司全资子公司苏州长城开发科技有限公司以信用方式获得中国农
业银行苏州工业园区支行 6亿元人民币综合授信额度，期限 1年。 
（5） 2010 年 11 月 19 日，公司全资子公司苏州长城开发科技有限公司以信用方式获得上海浦
东发展银行苏州分行 1亿元人民币综合授信额度，期限 1年。 
（6） 2011年 1月 10日，公司全资子公司苏州长城开发科技有限公司以信用方式获得中信银行
苏州分行 4亿元人民币综合授信额度，期限 1年。 
（7） 2011年 3月 1日，公司全资子公司苏州长城开发科技有限公司以信用方式获得中国建设
银行苏州工业园区支行等值 8000万美元的人民币综合授信额度，期限 1年。 
（8） 2010年 3月 23日，公司控股子公司开发磁记录以信用方式获得交行振华支行 1.7亿元综
合授信额度，期限 1年。 
（9） 2010年 5月 10日，控股子公司开发磁记录以信用方式获得建行深圳分行 2亿元综合授信
额度，期限 1年。 
（10） 2010年 7月 28日，控股子公司开发磁记录以信用方式获得中信深圳分行 1.5亿元综合授
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
51 
信额度，期限 1年。 
（11） 2011年 3月 3日，本公司为全资子公司开发科技（香港）有限公司美元贷款提供信用担
保而获得法国巴黎银行 4000万美元的综合授信额度，期限 1年。 

九、 对外担保情况                                                   单位：人民币万元  
公司对外担保情况（不包括对子公司的担保） 
担保对
象名称 
担保额度相关公告
披露日和编号 
担保 
额度 
实际发生日
期（协议签署
日） 
实际 
担保金额 担保类型 担保期 
是否
履行
完毕
是否为
关联方
担保
2008-02-21 3,077.37 履约保函担保 从最后一批产品发货后起 18个月 否 否 
2008-02-21    677.20 履约保函担保 从最后一批产品发货后起 18个月 是 否 
2008-10-30 1,673.30 履约保函担保 从最后一批产品发货后起 18个月 否 否 
中国机
械设备
进出口
总公司 
2010年 4月 24日 
公告编码 2010-013； 
2010年 5月 15日 
公告编码 2010-022。 
10,000 
2010-11-03 654.45 履约保函担保 从最后一批产品发货后起 18个月 否 否 
报告期内审批的对外担保额度
合计（A1） 10,000 
报告期内对外担保实际发生额
合计（A2）   654.45 
报告期末已审批的对外担保 
额度合计（A3） 10,000 
报告期末实际对外担保余额 
合计（A4） 5,405.12 
公司对子公司的担保情况 
担保对
象名称 
担保额度相关公告
披露日和编号 
担保 
额度 
实际发生日
期（协议签署
日） 
实际 
担保金额 担保类型 担保期 
是否
履行
完毕
是否为
关联方
担保
2009-11-11 10,000.00 连带责任担保 2009.11.11-2010.06.10 是 否 苏州长城开发
科技有
限公司 
2009年 8月 28日；
公告编码 2009-027。 15,000 2009-10-20 5,000.00 连带责任担保 2009.10.20-2010.10.15 是 否 
报告期内审批对子公司 
担保额度合计（B1） 0 
报告期内对子公司 
担保实际发生额合计（B2） 0 
报告期末已审批的对子公司 
担保额度合计（B3） 15,000 
报告期末对子公司 
实际担保余额合计（B4） 0 
公司担保总额（即前两大项的合计） 
报告期内审批担保额度合计
（A1+B1） 10,000 
报告期内担保实际发生额合计
（A2+B2）  654.45 
报告期末已审批的担保额度 
合计（A3+B3） 25,000 
报告期末实际担保余额 
合计（A4+B4） 5,405.12 
实际担保总额（即 A4+B4）占公司净资产的比例 1.29% 
其中： 
为股东、实际控制人及其关联方提供担保的金额（C） 0 
直接或间接为资产负债率超过 70%的被担保对象提供的
债务担保金额（D） 5,405.12 
担保总额超过净资产 50%部分的金额（E） 0 
上述三项担保金额合计（C+D+E） 5,405.12 
未到期担保可能承担连带清偿责任说明 无 

                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
52 
【注】 
（1） 报告期内，公司继续与中国机械设备进出口公司（以下简称“CMEC”）合作出口意大利公
司智能电表。中国银行为该项目开立履约保函，保函申请人是CMEC。由于本公司负责该
项目资金、技术、质量和生产，并向意大利ENEL公司直接发货，所以，合约的实际履行
人是本公司，保函担保风险实质由本公司控制。截止报告日，该项目履约情况良好。  
（2） 2010年5月14日，公司第十八次（2009年度）股东大会同意2010年度为中国银行向“CMEC”
开立的履约保函合同提供担保，担保额度不超过1亿元人民币。相关公告参见2010年4月
24日、2010年5月15日的《中国证券报》、《证券时报》。 
十、 独立董事对公司累计和当期对外担保情况的专项说明及独立意见 
根据《关于规范上市公司与关联方资金往来及上市公司对外担保若干问题的通知》(证监发
〔2003〕56 号)、《关于加强上市公司资金占用和违规担保信息披露工作的通知》（深圳局发字
〔2004〕338号）和《关于规范上市公司对外担保行为的通知》（证监发〔2005〕120号）的精神，
公司独立董事对公司累计和当期对外担保的情况作了专项说明，并发表了独立意见，内容如下： 
1. 截止 2010年 12月 31日，公司累计对外担保余额为 5,405.13万元，为控股子公司担保余额
为 0，占 2010年经审计会计报表净资产的 1. 29%。 
2. 报告期内，公司及控股子公司没有为控股股东及其他关联方、任何非法人单位或个人提供
担保的情况。 
3. 报告期内，公司继续与中国机械设备进出口总公司（以下简称“CMEC”）合作出口意大利公
司智能电表，并为中国银行向 CMEC开具的履约保函提供担保，本年内新增担保 654.45万
元，截止报告期末，该项担保余额为 5,405.13 万元。目前该项目履约情况良好。有关本公
司对外担保的详细情况，请见本报告“重大事项八、3之对外担保情况”。 
4. 公司为全资子公司苏州长城开发科技有限公司向中信银行苏州分行申请 5,000 万元综合授
信提供的连带责任担保已于 2010年 6月 10日到期并解除。 
5. 公司为全资子公司苏州长城开发科技有限公司向中国农业银行股份有限公司苏州工业园
区支行申请 10,000万元综合授信提供的连带责任担保已于 2010年 10月 15日到期并解除。 
6. 公司严格按照法律法规、《公司章程》和其他制度规定对子公司担保、对履约保函担保履
行了董事会、股东大会审议程序。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
53 
7. 公司制定有《长城开发科技股份有限公司对外担保管理制度》，明确规定公司及控股子公
司对外担保业务审批流程，以规范公司对外担保行为，有效控制对外担保风险。 
8. 截止报告期末，没有明显迹象表明公司可能因被担保方债务违约而承担担保责任。 
9. 我们认为，公司能够严格按照有关规定，规范公司对外担保行为，控制公司对外担保风险，
没有违反《关于规范上市公司对外担保行为的通知》的事项发生。 

独立董事：李致洁  周俊祥  张鹏 
二○一一年三月二十九日 

十一、 公司或持股 5%以上股东承诺事项履行情况 
1. 报告期内，公司控股股东严格遵守不与公司发生同业竞争的承诺。 
2. 其他承诺及履行情况 
承诺事项 承诺人 承诺内容 履行情况 
长城科技股份有限公司 承诺所持长城开发股份自获得上市流通权之日起，36个月内不上市交易。 
博旭（香港）有限公司 承诺所持长城开发股份自获得上市流通权之日起，36个月内不上市交易。 
股改承诺 
秉宏有限公司 
承诺所持长城开发股份自获得上市流通权
之日起，在 12个月内不上市交易或者转让；
在前项承诺期期满后，通过证券交易所挂牌
出售的股份在 12个月内不超过公司股份总
数的 5％，在 24月内不超过 10％。 
于 
本报告期
前已履行
完毕 
收购报告书或权益变动报告
书中所作承诺 无 无 无 
重大资产重组时所作承诺 无 无 无 
发行时所作承诺 无 无 无 
其他承诺（含追加承诺） 长城科技股份有限公司 
承诺在 2009年 5月 25日所持股份解除限售
后 12个月内将不会出售所持长城开发股
份，同时承诺在实施减持计划时将严格遵守
《证券法》、《上市公司收购管理办法》、《上
市公司解除限售存量股份转让指导意见》等
相关规定，并及时履行信息披露义务。 
于 
本报告期
内履行 
完毕 


                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
54 

十二、 报告期内，公司不存在控股股东及其关联方非经营性占用公司资金的情况。 
十三、 公司聘任、解聘会计师事务所情况 
1. 报告期内，公司继续聘请信永中和会计师事务所为公司 2010年度财务报告审计单位，该事
务所已为公司服务 3年。 
2. 聘请会计师事务所支付的报酬情况： 
报告期内，公司向会计师事务所支付年度审计费用 51万元人民币，另开发香港支付年度审
计费用 34.50万港元，开发磁记录香港支付年度审计费用 6.55万元人民币。  
十四、 报告期内，公司及其董事、监事、高级管理人员、公司股东、实际控制人、收购人没
有发生受到有权机关调查、司法纪检部门采取强制措施、被移交司法机关或追究刑事责任、
中国证监会稽查、中国证监会行政处罚、证券市场禁入、通报批评、认定为不适当人选、
被其他行政管理部门处罚及证券交易所公开谴责的情况。 

十五、 报告期内，公司没有发生《证券法》第六十七条、《公开发行股票公司信息披露实施细
则（试行）》第十七条所列重大事件以及董事会判断为重大事项应披露而未予披露的其他
事项。 
十六、 报告期内，公司子公司没有应披露而未披露的重大事项。 
十七、 公司接待调研及访问等相关情况 
公司高度重视投资者关系，除了及时、充分而详尽的信息披露外，公司还努力通过不同的
方式加强与投资者的沟通与交流，并严格按照《深圳证券交易所上市公司公平信息披露指引》
的要求，遵循公平信息披露原则，保证了信息披露的公平性。 
报告期内，公司接待境内外基金公司、证券公司、QFII等研究员、分析师及个人投资者的
调研来访共 40余次近 170多人，此外，还通过公司网站、投资者关系热线电话、电子信箱、传
真、投资者关系互动平台、走访投资者、参加不同投资机构组织的大型交流会等多种渠道加强
与各类投资者的沟通与交流，聆听他们的意见，传递公司的信息，努力提高公司透明度，公司
与投资者之间形成了良好的互动关系。 
公司投资者关系管理工作获得了资本市场的认可，先后被评为首届“深报指数最佳投资者
关系上市公司”、新财富“金牌董秘”、深圳证券交易所“信息披露优秀企业”、深圳证监局优秀
董秘、中国证券报“上市公司金牛百强-信息设备行业榜”等奖项。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
55 

报告期内，公司接待调研、沟通、访问等活动情况表 
接待时间 接待地点 接待方式 接待对象 谈论的主要内容及 提供的资料 
2010年01月 公司所在地 实地调研 嘉实基金、英大证券 公司经营情况、行业前景、发展战略 
2010年02月 公司所在地 实地调研 泰康资产管理公司 公司经营情况、行业前景、发展战略 
2010年03月 公司所在地 实地调研 
广发基金、招商证券、易方达基金、上投摩
根基金、国联安基金、泰康资产管理、日信
证券、长城基金、SMC中国基金、申万巴黎
基金、云南国际信托、北京高华证券、博时
基金、嘉实基金、中邮基金、天弘基金、中
国民族证券、国信证券、新时代证券、景顺
长城基金、大成基金、海通证券、广发证券、
瑞银证券、信达证券、东方证券、光大证券、
中海基金、南方基金、国泰君安证券等 
公司经营情况、行业
前景、发展战略 
2010年04月 公司所在地 实地调研 申银万国、信达澳银基金、国泰基金、兴业全球基金、银河证券、中油基金等 
公司经营情况、行业
前景、发展战略 
2010年05月 公司所在地 实地调研 博时基金、国海证券、世纪证券等 公司经营情况、行业前景、发展战略 
2010年06月 公司所在地 实地调研 
招商证券、国信证券、东方证券、大成基金、
宝盈基金、第一创业、光大证券、银河证券、
瑞银投资、东方基金、南京证券、广发基金、
长城证券、景顺长城基金、信诚基金、交银
施罗德、南方基金、中信证券、安信证券等 
公司经营情况、行业
前景、发展战略 
2010年07月 公司所在地 实地调研 粤海证券、国信证券、中山证券等 公司经营情况、行业前景、发展战略 
2010年09月 公司所在地 实地调研 光大证券、银河基金等 公司经营情况、行业前景、发展战略 
2010年10月 公司所在地 实地调研 
中信证券、长城基金、嘉实基金、广州证券、
华夏基金、长江证券、信诚基金、国泰基金、
国海富兰克林基金、高盛（亚洲）、深圳合赢
投资等 
公司经营情况、行业
前景、发展战略 
2010年11月 公司所在地 实地调研 
渤海证券、长城人寿、中国建银、华创证券、
国金证券、诺安基金、益民基金、中国民主
证券、天马资产、国信证券、景顺长城基金、
北京环球银证投资等 
公司经营情况、行业
前景、发展战略 
2010年12月 公司所在地 实地调研 海通证券、太平洋资产、光大证券、融通基金、中信证券、中信金通证券等 
公司经营情况、行业
前景、发展战略 




                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
56 
十八、 主要期后事项 
1. 全资子公司苏州开发收购苏州市金冠科技有限公司 100%股权事宜 
为进一步完善本公司全资子公司苏州长城开发科技有限公司（简称“苏州开发”）生产经营
的配套设施，稳定员工队伍，为苏州开发可持续健康发展提供强有力的人员保障和配套支持，
2011年 2月 22日，经公司第六届董事会审议，同意苏州开发以 3,743万元人民币收购苏州市金
冠科技有限公司（简称“金冠科技”）100%股权，从而获得其地块及其地面房产物业。金冠科技
现占地 19,413.01平方米，建有 4栋厂房，建筑面积 26,662平方米，目前金冠科技经营项目为房
屋及设备出租。 
2. 增持深圳长城科美技术有限公司 3%股权事宜 
随着国内智能电网建设的推进、用电端设备改造的提速，国内电表市场面临较大的增长机
遇，为进一步支持深圳长城科美技术有限公司（简称“长城科美”）做大做强国内电表业务，2011
年 2月 22日，经公司第六届董事会审议，同意将本公司拥有的国内电能表相关知识产权转入长
城科美，同时由本公司全资子公司开发科技（香港）有限公司以 1元人民币收购沃美国际有限
公司（简称“沃美国际”）所持长城科美 3%股权。收购完成后，本公司、北京沃美科贸有限公
司、沃美国际、开发香港分别持有长城科美 35%、35%、27%和 3%的股权，即本公司直接和间
接持有长城科美 38%股权。 
3. 独资设立东莞长城开发科技有限公司事宜 
根据公司战略发展需要，为实现公司产业转移和升级，全面提升公司竞争力，2011年 3月
2 日，经公司第六届董事会审议，同意在中国电子东莞产业基地独资设立东莞长城开发科技有
限公司，该公司投资总额 9亿元人民币，注册资本 3亿元人民币，主营业务为 ODM研发制造中
心、消费类电子、医疗电子、汽车电子、LED电子产品等。 
以上事宜相关公告详见 2011年 3月 3日的《中国证券报》、《证券时报》和巨潮资讯网。 
4. 关于合资建设 LED产业化项目即开发晶照明（厦门）有限公司增加投资总额事宜 
鉴于合资公司开发晶照明（厦门）有限公司的业务规模及未来发展的需要，2011年 3月 23
日，经公司第六届董事会审议，同意开发晶照明（厦门）有限公司首期投资总额由原来的 16,000
万美元增至 29,000万美元，首期注册资本保持不变，仍为 12,000万美元，同时对合资合同进行
修改，并在此基础上同意开发晶照明（厦门）有限公司章程的制定。目前该项目正处于环评阶
段。 
以上事宜相关公告详见 2011年 3月 25日的《中国证券报》、《证券时报》和巨潮资讯网。 
                                                                                          证券简称: 长城开发            
                                          2010 年年度报告                                证券代码：000021              
57 


第十章   财务报告 

一、 审计意见：公司 2010 年度财务报告经信永中和会计师事务所审计，出具了标准无保留审
计意见的审计报告。（XYZH/2010A2020） 
二、 已审计财务报表（附后） 
三、 合并财务报表附注（附后） 


第十一章 备查文件目录 

包括下列文件： 
（一）载有法定代表人、主管会计工作负责人、会计机构负责人签名并盖章的会计报表。 
（二）载有会计师事务所盖章、注册会计师签名并盖章的审计报告。 
（三）报告期内，在中国证监会指定报刊《中国证券报》、《证券时报》上公开披露过的所有公
司文件的正本及公告原稿。 
（四）载有董事长亲笔签名的年度报告文本。 
（五）公司章程。 
文件存放地点：公司董事会办公室  

                                董事长：谭文鋕 
深圳长城开发科技股份有限公司董事会 
                                                 二零一一年三月三十一日





深圳长城开发科技股份有限公司 
2010 年度 
审计报告 








索引 页码 
审计报告  
财务报表及附注  
- 合并资产负债表 1-2 
- 合并利润表 3 
- 合并现金流量表 4 
- 合并股东权益变动表 5-6 
- 母公司资产负债表 7-8 
- 母公司利润表 9 
- 母公司现金流量表 10 
- 母公司股东权益变动表 11-12 
- 财务报表附注 13-85 





审计报告  
XYZH/2010A2020 

深圳长城开发科技股份有限公司全体股东：  
我们审计了后附的深圳长城开发科技股份有限公司（以下简称长城开发公司）合并及
母公司财务报表，包括 2010 年 12 月 31 日的资产负债表，2010 年度的利润表、现金流量
表、股东权益变动表及财务报表附注。 
一、 管理层对财务报表的责任  
按照企业会计准则的规定编制财务报表是长城开发公司管理层的责任。这种责任包
括：（1）设计、实施和维护与财务报表编制相关的内部控制，以使财务报表不存在由于舞
弊或错误而导致的重大错报；（2）选择和运用恰当的会计政策；（3）作出合理的会计估计。  
二、 注册会计师的责任 
我们的责任是在实施审计工作的基础上对财务报表发表审计意见。我们按照中国注册
会计师审计准则的规定执行了审计工作。中国注册会计师审计准则要求我们遵守职业道德
规范，计划和实施审计工作以对财务报表是否不存在重大错报获取合理保证。  
审计工作涉及实施审计程序，以获取有关财务报表金额和披露的审计证据。选择的审
计程序取决于注册会计师的判断，包括对由于舞弊或错误导致的财务报表重大错报风险的
评估。在进行风险评估时，我们考虑与财务报表编制相关的内部控制，以设计恰当的审计
程序，但目的并非对内部控制的有效性发表意见。审计工作还包括评价管理层选用会计政
策的恰当性和作出会计估计的合理性，以及评价财务报表的总体列报。  
我们相信，我们获取的审计证据是充分、适当的，为发表审计意见提供了基础。  






三、 审计意见  
我们认为，长城开发公司财务报表已经按照企业会计准则的规定编制，在所有重大方
面公允反映了长城开发公司2010年 12月 31日的财务状况以及2010年度的经营成果和现
金流量。  





信永中和会计师事务所有限责任公司  中国注册会计师：谭小青 

  中国注册会计师：刘彦山 

中国 北京  二○一一年三月二十九日 



合并资产负债表 
2010 年 12 月 31 日 
编制单位：深圳长城开发科技股份有限公司                                   单位：人民币元
项            目 附注 年末金额 年初金额 
流动资产：    
    货币资金 八、1 1,779,646,183.21  1,866,328,409.69 
    交易性金融资产 八、2  -  10,307,177.46 
    应收票据 八、3 48,041,789.22  7,287,350.23 
    应收账款 八、4 1,474,416,408.63  997,951,939.81 
    预付款项 八、5 34,441,686.37  56,651,530.75 
    应收利息 八、6 25,659,470.54  21,517,770.00 
    应收股利    -  -
    其他应收款 八、7 23,633,546.99  42,696,038.52 
    买入返售金融资产    
    存货 八、8 648,226,692.17  430,504,213.94 
    一年内到期的非流动资产    
    其他流动资产 八、9 23,707,811.55  9,948,068.25 
流动资产合计   4,057,773,588.68  3,443,192,498.65 
非流动资产：    
    可供出售金融资产 八、10 392,558,850.25  -
    持有至到期投资 八、11  -  30,992,986.24 
    长期应收款    -  -
    长期股权投资 八、12 537,905,882.34  334,260,675.93 
    投资性房地产 八、13 135,084,077.74  155,587,178.99 
    固定资产 八、14 1,337,156,668.91  1,307,041,201.44 
    在建工程 八、15 128,001,856.57  61,051,643.69 
    工程物资    -  -
  固定资产清理    -  -
    生产性生物资产    
    油气资产    
    无形资产 八、16 12,212,181.48  12,466,887.72 
    开发支出    -  -
    商誉    
    长期待摊费用 八、17 17,788,699.20  33,169,597.73 
    递延所得税资产 八、18 48,056,334.65  50,531,928.74 
    其他非流动资产    
非流动资产合计   2,608,764,551.14  1,985,102,100.48 
资产总计   6,666,538,139.82  5,428,294,599.13 

法定代表人：                  主管会计工作负责人：               会计机构负责人： 


合并资产负债表 (续) 
2010 年 12 月 31 日 
编制单位：深圳长城开发科技股份有限公司                             单位：人民币元 
项            目 附注 年末金额 年初金额 
流动负债：       
    短期借款 八、20 751,151,336.73  439,925,596.48 
    交易性金融负债   
    应付票据   
    应付账款 八、21 1,104,968,652.25  770,014,247.45 
    预收款项 八、22 15,925,918.70  1,991,750.99 
    应付职工薪酬 八、23 75,284,407.87  52,770,290.82 
    应交税费 八、24 98,184,378.40  74,999,739.66 
    应付利息 八、25 4,867,924.33  105,338.88 
    应付股利   
    其他应付款 八、26 85,243,530.85  116,636,740.79 
    一年内到期的非流动负债   
    其他流动负债   
流动负债合计   2,135,626,149.13  1,456,443,705.07 
非流动负债：   
    长期借款    -  -
    应付债券   
    长期应付款   
    专项应付款   
    预计负债 八、27 18,158,712.78  17,555,946.38 
    递延所得税负债 八、18 34,417,844.02  1,491,047.58 
    其他非流动负债   
非流动负债合计   52,576,556.80  19,046,993.96 
负 债 合 计    2,188,202,705.93  1,475,490,699.03 
股东权益：   
    股本 八、28 1,319,277,781.00  879,518,521.00 
    资本公积 八、29 573,507,858.54  465,928,985.00 
    减：库存股   
    专项储备   
    盈余公积 八、30 985,128,311.39  985,128,311.39 
    一般风险准备   
    未分配利润 八、31  1,321,526,042.88  1,289,075,572.42 
    外币报表折算差额    -16,403,710.26  11,246,535.33 
    归属于母公司股东权益合计   4,183,036,283.55  3,630,897,925.14 
    少数股东权益 八、32 295,299,150.34  321,905,974.96 
股东权益合计   4,478,335,433.89  3,952,803,900.10 
负债和股东权益总计    6,666,538,139.82  5,428,294,599.13 

法定代表人：               主管会计工作负责人：           会计机构负责人： 



合并利润表 
2010 年度 
编制单位：深圳长城开发科技股份有限公司                                                 单位：人民币元
项目 附注 本年金额 上年金额 
一、营业总收入     20,771,541,038.17    13,405,312,857.43 
    其中:营业收入 八、33   20,771,541,038.17    13,405,312,857.43 
二、营业总成本     20,566,259,015.64    13,114,963,001.73 
   其中：营业成本 八、33   20,265,439,425.99    12,915,023,249.21 
         营业税金及附加 八、34        7,106,461.78         5,505,782.60 
         销售费用 八、35       51,009,662.89        57,844,670.83 
         管理费用 八、36      239,719,823.62       196,527,900.63 
         财务费用 八、37       -19,685,881.33       -31,348,161.66 
         资产减值损失 八、38       22,669,522.69       -28,590,439.88 
     加：公允价值变动收益（损失以“－”号填列） 八、39           -98,817.46            98,817.46 
         投资收益（损失以“－”号填列） 八、40      212,339,550.91        15,093,251.41 
           其中：对联营企业和合营企业的投资收益        200,648,252.38         3,720,554.73 
         汇兑收益（损失以“-”号填列）    
三、营业利润（亏损以“－”号填列）        417,522,755.98       305,541,924.57 
    加：营业外收入 八、41       10,035,138.98         6,070,269.33 
    减：营业外支出 八、42       27,836,521.18         1,221,681.64 
        其中：非流动资产处置损失           848,714.73         946,533.81 
四、利润总额（亏损总额以“－”号填列）        399,721,373.78       310,390,512.26 
    减：所得税费用 八、43       43,379,553.75        44,453,992.93 
五、净利润（净亏损以“－”号填列）        356,341,820.03       265,936,519.33 
    归属于母公司股东的净利润        384,257,878.66       258,619,909.73 
    少数股东损益         -27,916,058.63         7,316,609.60 
六、每股收益：    
    （一）基本每股收益 八、44                0.29                 0.20 
    （二）稀释每股收益 八、44                0.29                 0.20 
七、其他综合收益  八、45      343,068,417.96        -4,861,886.08 
八、综合收益总额        699,410,237.99       261,074,633.25 
    归属于母公司股东的综合收益总额        728,042,062.61       253,848,920.71 
    归属于少数股东的综合收益总额         -28,631,824.62         7,225,712.54 


法定代表人：                           主管会计工作负责人：                          会计机构负责人：











合并现金流量表 
2010 年度 
编制单位：深圳长城开发科技股份有限公司                                                      单位：人民币元
项            目 附注 本年金额 上年金额 
一、经营活动产生的现金流量：       
      销售商品、提供劳务收到的现金     20,625,233,767.51  12,961,454,521.08 
      收到的税费返还         24,497,635.02      23,388,042.19 
      收到其他与经营活动有关的现金 八、46       96,379,678.18     112,749,192.59 
经营活动现金流入小计     20,746,111,080.71  13,097,591,755.86 
      购买商品、接受劳务支付的现金    19,616,733,081.11  11,872,230,246.30 
      支付给职工以及为职工支付的现金        725,105,406.61     491,853,499.59 
      支付的各项税费         84,313,596.78      92,635,408.22 
      支付其他与经营活动有关的现金 八、46      205,525,025.07     147,181,153.44 
经营活动现金流出小计     20,631,677,109.57  12,603,900,307.55 
经营活动产生的现金流量净额        114,433,971.14     493,691,448.31 
二、投资活动产生的现金流量：    
      收回投资收到的现金         15,264,014.09         140,750.00 
      取得投资收益收到的现金        159,551,267.80      60,745,128.97 
      处置固定资产、无形资产和其他长期资产收回的现金净额          1,275,138.36       6,203,642.66 
      处置子公司及其他营业单位收到的现金净额                     -
      收到其他与投资活动有关的现金                     -
投资活动现金流入小计        176,090,420.25      67,089,521.63 
      购建固定资产、无形资产和其他长期资产支付的现金        400,737,647.24     194,197,607.23 
      投资支付的现金       160,588,027.75     110,033,124.37 
      取得子公司及其他营业单位支付的现金净额                    -                  -
      支付其他与投资活动有关的现金                    -                  -
投资活动现金流出小计        561,325,674.99     304,230,731.60 
投资活动产生的现金流量净额   -385,235,254.74    -237,141,209.97
三、筹资活动产生的现金流量：    
      吸收投资收到的现金          2,025,000.00         900,000.00 
        其中：子公司吸收少数股东投资收到的现金                    -                  -
      取得借款所收到的现金   1,986,500,258.17 633,575,596.48
      发行债券收到的现金    -
      收到其他与筹资活动有关的现金 八、46 5,070,922.73 -
筹资活动现金流入小计   1,993,596,180.90 634,475,596.48
      偿还债务所支付的现金   1,653,814,151.62 364,630,000.00
      分配股利、利润或偿付利息所支付的现金   174,258,935.68 133,760,128.09
        其中：子公司支付给少数股东的股利、利润   - -
      支付其他与筹资活动有关的现金 八、46 95,314,267.54 218,782,611.33
筹资活动现金流出小计   1,923,387,354.84 717,172,739.42
筹资活动产生的现金流量净额   70,208,826.06 -82,697,142.94
四、汇率变动对现金及现金等价物的影响   -3,772,327.96 -2,428,656.31
五、现金及现金等价物净增加额   -204,364,785.50 171,424,439.09
    加：期初现金及现金等价物余额   1,644,346,846.30 1,472,922,407.21
六、期末现金及现金等价物余额   1,439,982,060.80 1,644,346,846.30
法定代表人：                          主管会计工作负责人：                          会计机构负责人： 

合并股东权益变动表 
2010年度 
编制单位：深圳长城开发科技股份有限公司                                                                                                                         单位：人民币元 
本年金额 
归属于母公司股东权益 少数股东权益项            目 
股本 资本公积 减：库存股
专项
储备 盈余公积 
一般风
险准备 未分配利润 其他 
股东权益合计 
一、上年年末余额 879,518,521.00 465,928,985.00 - - 985,128,311.39 - 1,289,075,572.42 11,246,535.33 321,905,974.96 3,952,803,900.10 
    加：会计政策变更           
        前期差错更正           
        其他           
二、本年年初余额 879,518,521.00 465,928,985.00 - - 985,128,311.39 - 1,289,075,572.42 11,246,535.33 321,905,974.96 3,952,803,900.10 
三、本年增减变动金额（减少以“－”号填列） 439,759,260.00 107,578,873.54 - - - - 32,450,470.46 -27,650,245.59 -26,606,824.62 525,531,533.79 
  （一）净利润       384,257,878.66  -27,916,058.63 356,341,820.03 
  （二）其他综合收益  371,434,429.54      -27,650,245.59 -715,765.99 343,068,417.96 
   上述（一）和（二）小计 - 371,434,429.54 - - - - 384,257,878.66 -27,650,245.59 -28,631,824.62 699,410,237.99 
  （三）股东投入和减少资本 - - - - - - - - 2,025,000.00 2,025,000.00 
    1.股东投入资本         2,025,000.00 2,025,000.00 
    2.股份支付计入股东权益的金额           
    3.其他           
  （四）利润分配 175,903,704.00 - - - - - -351,807,408.20 - - -175,903,704.20 
    1.提取盈余公积           
    2.提取一般风险准备           
    3.对股东的分配 175,903,704.00      -351,807,408.20   -175,903,704.20 
    4.其他           
  （五）股东权益内部结转 263,855,556.00 -263,855,556.00 - - - - - - - - 
    1.资本公积转增股本 263,855,556.00 -263,855,556.00        - 
    2.盈余公积转增股本           
    3.盈余公积弥补亏损           
    4.其他           
  （六）专项储备 - - - - - - - - - - 
    1.本年提取           
    2.本年使用           
四、本年年末余额 1,319,277,781.00 573,507,858.54 - - 985,128,311.39 - 1,321,526,042.88 -16,403,710.26 295,299,150.34 4,478,335,433.89 

法定代表人：                                                         主管会计工作负责人：                                                  会计机构负责人： 


合并股东权益变动表（续） 
2010 年度 
编制单位：深圳长城开发科技股份有限公司                                                                                                                      单位：人民币元 
上年金额 
归属于母公司股东权益 项            目 
股本 资本公积 减：库存股
专项
储备 盈余公积 
一般风
险准备 未分配利润 其他 
少数股东权益 股东权益合计 
一、上年年末余额 879,518,521.00 465,928,985.00 - - 985,128,311.39 - 1,162,383,440.84 16,017,524.35 313,780,262.42 3,822,757,045.00 
    加：会计政策变更           
        前期差错更正           
        其他           
二、本年年初余额 879,518,521.00 465,928,985.00 - - 985,128,311.39 - 1,162,383,440.84 16,017,524.35 313,780,262.42 3,822,757,045.00 
三、本年增减变动金额（减少以“－”号填列） - - - - - - 126,692,131.58 -4,770,989.02 8,125,712.54 130,046,855.10 
  （一）净利润       258,619,909.73  7,316,609.60 265,936,519.33 
  （二）其他综合收益        -4,770,989.02 -90,897.06 -4,861,886.08 
   上述（一）和（二）小计 - - - - - - 258,619,909.73 -4,770,989.02 7,225,712.54 261,074,633.25 
  （三）股东投入和减少资本 - - - - - - - - 900,000.00 900,000.00 
    1.股东投入资本         900,000.00 900,000.00 
    2.股份支付计入股东权益的金额           
    3.其他           
  （四）利润分配 - - - - - - -131,927,778.15 - - -131,927,778.15 
    1.提取盈余公积           
    2.提取一般风险准备           
    3.对股东的分配       -131,927,778.15   -131,927,778.15 
    4.其他           
  （五）股东权益内部结转 - - - - - - - - - - 
    1.资本公积转增股本           
    2.盈余公积转增股本           
    3.盈余公积弥补亏损           
    4.其他           
  （六）专项储备 - - - - - - - - - - 
    1.本年提取           
    2.本年使用           
四、本年年末余额 879,518,521.00 465,928,985.00 - - 985,128,311.39 - 1,289,075,572.42 11,246,535.33 321,905,974.96 3,952,803,900.10 

法定代表人：                                                      主管会计工作负责人：                                               会计机构负责人： 


母公司资产负债表 
2010 年 12 月 31 日 
编制单位：深圳长城开发科技股份有限公司                                单位：人民币元
项            目 附注 年末金额 年初金额 
流动资产：       
    货币资金   1,032,458,169.06  1,157,065,036.19 
    交易性金融资产    -  10,195,922.46 
    应收票据   47,395,611.31  7,287,350.23 
    应收账款 十四、1 904,813,020.07  829,226,193.18 
    预付款项   23,131,576.26  15,253,611.12 
    应收利息   18,226,097.22  20,091,900.00 
    应收股利    
    其他应收款 十四、2 20,617,077.10  52,219,994.25 
    存货   223,085,977.36  106,288,908.88 
    一年内到期的非流动资产    
    其他流动资产   12,325,214.73  3,597,324.78 
流动资产合计   2,282,052,743.11  2,201,226,241.09 
非流动资产：    
    可供出售金融资产 十四、3 392,558,850.25 
    持有至到期投资    
    长期应收款    
    长期股权投资 十四、4 1,028,418,908.27  919,865,171.75 
    投资性房地产   163,807,915.77  189,067,574.22 
    固定资产   628,541,066.47  524,617,144.18 
    在建工程    
    工程物资    
  固定资产清理    
    生产性生物资产    
    油气资产    
    无形资产    
    开发支出    
    商誉    
    长期待摊费用    
    递延所得税资产   21,928,217.48  36,980,259.73 
    其他非流动资产    
非流动资产合计   2,235,254,958.24  1,670,530,149.88 
资  产  总  计   4,517,307,701.35  3,871,756,390.97 
法定代表人：             主管会计工作负责人：               会计机构负责人： 




母公司资产负债表 (续) 
2010 年 12 月 31 日 
编制单位：深圳长城开发科技股份有限公司                                    单位：人民币元 
项            目 附注 年末金额 年初金额 
流动负债：       
    短期借款   441,343,104.73  146,725,596.48 
    交易性金融负债   
    应付票据   
    应付账款   594,104,018.59  365,075,982.49 
    预收款项   15,925,918.70  1,991,750.99 
    应付职工薪酬   39,628,462.28  23,389,027.34 
    应交税费   36,598,458.51  19,572,268.84 
    应付利息   835,348.72  105,338.88 
    应付股利   
    其他应付款   50,535,007.27  131,525,469.17 
    一年内到期的非流动负债   
    其他流动负债   
流动负债合计   1,178,970,318.80  688,385,434.19 
非流动负债：   
    长期借款   
    应付债券   
    长期应付款   
    专项应付款   
    预计负债   18,158,712.78  17,555,946.38 
    递延所得税负债   31,666,328.02 21,739.84 
    其他非流动负债   
非流动负债合计   49,825,040.80  17,577,686.22 
负 债 合 计   1,228,795,359.60  705,963,120.41 
股东权益   
    股本   1,319,277,781.00  879,518,521.00 
    资本公积   445,857,339.25  530,270,369.82 
    减：库存股   
    专项储备   
    盈余公积   978,306,258.09  978,306,258.09 
    一般风险准备   
    未分配利润   546,856,568.37  779,483,726.61 
    外币报表折算差额    -1,785,604.96  -1,785,604.96 
股东权益合计   3,288,512,341.75  3,165,793,270.56 
负债和股东权益总计   4,517,307,701.35  3,871,756,390.97 

法定代表人：                主管会计工作负责人：              会计机构负责人： 




母公司利润表 
2010 年度 
编制单位：深圳长城开发科技股份有限公司                                         单位：人民币元 
项目 附注 本年金额 上年金额 
一、营业收入 十四、5 3,329,828,395.75 2,040,994,293.87
    减：营业成本 十四、5 3,105,070,817.90 1,845,184,387.68
        营业税金及附加   6,812,802.47 5,137,520.94
        销售费用   17,969,455.44 11,824,820.31
        管理费用   149,589,911.65 102,049,646.72
        财务费用   -9,098,520.47 -28,770,648.06
        资产减值损失   -15,889,385.04 -16,463,303.49
    加：公允价值变动收益（损失以“－”号填列）   -98,817.46 98,817.46
        投资收益（损失以“－”号填列） 十四、6 61,084,425.61 61,205,978.42
           其中：对联营企业和合营企业的投资收益   2,409,154.52 -3,942,055.46
二、营业利润（亏损以“－”号填列）   136,358,921.95 183,336,665.65
    加：营业外收入   8,917,399.60 5,965,990.29
    减：营业外支出   930,091.96 269,902.39
          其中：非流动资产处置损失   - -
三、利润总额（亏损总额以“－”号填列）   144,346,229.59 189,032,753.55
    减：所得税费用   25,165,979.63 21,391,283.77
四、净利润（净亏损以“－”号填列）   119,180,249.96 167,641,469.78
五、每股收益：    
    （一）基本每股收益   0.09 0.13
    （二）稀释每股收益   0.09 0.13
六、其他综合收益   179,442,525.43 -1,101,157.36
七、综合收益总额   298,622,775.39 166,540,312.42

法定代表人：                  主管会计工作负责人：                    会计机构负责人： 










母公司现金流量表 
2010 年度 
编制单位：深圳长城开发科技股份有限公司                                                 单位：人民币元 
项            目 附注 本年金额 上年金额 
一、经营活动产生的现金流量：      
      销售商品、提供劳务收到的现金  2,700,218,169.99 1,979,753,837.92
      收到的税费返还  4,849,002.88 9,607,842.50
      收到其他与经营活动有关的现金  83,028,850.15 86,459,986.66
经营活动现金流入小计  2,788,096,023.02 2,075,821,667.08
      购买商品、接受劳务支付的现金  2,096,408,146.17 1,529,841,798.02
      支付给职工以及为职工支付的现金  329,629,904.87 200,963,496.46
      支付的各项税费  63,382,016.29 76,407,165.46
      支付其他与经营活动有关的现金  129,493,085.99 53,214,329.93
经营活动现金流出小计  2,618,913,153.32 1,860,426,789.87
        经营活动产生的现金流量净额  169,182,869.70 215,394,877.21
二、投资活动产生的现金流量：   
      收回投资收到的现金  14,819,376.97 78,625.00
      取得投资收益收到的现金  54,265,331.12 115,449,919.86
      处置固定资产、无形资产和其他长期资产收回的现金净额  1,207,295.60 6,201,360.61
      处置子公司及其他营业单位收到的现金净额  - -
      收到其他与投资活动有关的现金  - -
投资活动现金流入小计  70,292,003.69 121,729,905.47
      购建固定资产、无形资产和其他长期资产所支付的现金  146,937,329.44 113,250,906.57
      投资支付的现金  378,568,267.75 138,161,730.00
      取得子公司及其他营业单位支付的现金净额  - -
      支付其他与投资活动有关的现金  - -
投资活动现金流出小计  525,505,597.19 251,412,636.57
        投资活动产生的现金流量净额  -455,213,593.50 -129,682,731.10
三、筹资活动产生的现金流量：   
      吸收投资收到的现金   -
      取得借款收到的现金  1,531,164,646.17 146,725,596.48
      收到其他与筹资活动有关的现金   -
筹资活动现金流入小计  1,531,164,646.17 146,725,596.48
      偿还债务支付的现金  1,223,880,148.49 -
      分配股利、利润或偿付利息支付的现金  166,946,736.16 131,927,778.15
      支付其他与筹资活动有关的现金   -
筹资活动现金流出小计  1,390,826,884.65 131,927,778.15
       筹资活动产生的现金流量净额  140,337,761.52 14,797,818.33
四、汇率变动对现金及现金等价物的影响  -1,282,196.33 -618,429.15
五、现金及现金等价物净增加额  -146,975,158.61 99,891,535.29
    加：期初现金及现金等价物余额  1,153,966,084.13 1,054,074,548.84
六、期末现金及现金等价物余额  1,006,990,925.52 1,153,966,084.13

法定代表人：                    主管会计工作负责人：                      会计机构负责人： 

母公司股东权益变动表 
2010 年度 
编制单位：深圳长城开发科技股份有限公司                                                                                                            单位：人民币元 
本年金额 
项            目 股本 资本公积 减：库存股
专项
储备 盈余公积 
一般风
险准备 未分配利润 其他 股东权益合计 
一、上年年末余额 879,518,521.00 530,270,369.82 - - 978,306,258.09 - 779,483,726.61 -1,785,604.96 3,165,793,270.56 
    加：会计政策变更          
        前期差错更正          
        其他          
二、本年年初余额 879,518,521.00 530,270,369.82 - - 978,306,258.09 - 779,483,726.61 -1,785,604.96 3,165,793,270.56 
三、本年增减变动金额（减少以“－”号填列） 439,759,260.00 -84,413,030.57 - - - - -232,627,158.24 - 122,719,071.19 
  （一）净利润       119,180,249.96  119,180,249.96 
  （二）其他综合收益  179,442,525.43      -  
   上述（一）和（二）小计 - 179,442,525.43 - - - - 119,180,249.96 - 179,442,525.43 
  （三）股东投入和减少资本          
    1.股东投入资本          
    2.股份支付计入股东权益的金额          
    3.其他          
  （四）利润分配 175,903,704.00 - - - - - -351,807,408.20 - -175,903,704.20 
    1.提取盈余公积          
    2.提取一般风险准备          
    3.对股东的分配 175,903,704.00      -351,807,408.20  -175,903,704.20 
    4.其他          
  （五）股东权益内部结转 263,855,556.00 -263,855,556.00       - 
    1.资本公积转增股本 263,855,556.00 -263,855,556.00       - 
    2.盈余公积转增股本          
    3.盈余公积弥补亏损          
    4.其他          
  （六）专项储备          
    1.本年提取          
    2.本年使用          
四、本年年末余额 1,319,277,781.00 445,857,339.25 - - 978,306,258.09 - 546,856,568.37 -1,785,604.96 3,288,512,341.75 

法定代表人：                                                主管会计工作负责人：                                             会计机构负责人： 



母公司股东权益变动表（续） 
2010 年度 
编制单位：深圳长城开发科技股份有限公司                                                                                                        单位：人民币元 
上年金额 
项            目 股本 资本公积 减：库存股
专项
储备 盈余公积 
一般风
险准备 未分配利润 其他 股东权益合计 
一、上年年末余额 879,518,521.00 530,270,369.82 - - 978,306,258.09 - 743,770,034.98 -684,447.60 3,131,180,736.29 
    加：会计政策变更         - 
        前期差错更正         - 
        其他         - 
二、本年年初余额 879,518,521.00 530,270,369.82 - - 978,306,258.09 - 743,770,034.98 -684,447.60 3,131,180,736.29 
三、本年增减变动金额（减少以“－”号填列） - - - - - - 35,713,691.63 -1,101,157.36 34,612,534.27 
  （一）净利润       167,641,469.78  167,641,469.78 
  （二）其他综合收益        -1,101,157.36 -1,101,157.36 
   上述（一）和（二）小计 - - - - - - 167,641,469.78 -1,101,157.36 166,540,312.42 
  （三）股东投入和减少资本 - - - - - - - - - 
    1.股东投入资本          
    2.股份支付计入股东权益的金额          
    3.其他          
  （四）利润分配 - - - - - - -131,927,778.15 - -131,927,778.15 
    1.提取盈余公积          
    2.提取一般风险准备          
    3.对股东的分配       -131,927,778.15  -131,927,778.15 
    4.其他          
  （五）股东权益内部结转 - - - - - - - - - 
    1.资本公积转增股本          
    2.盈余公积转增股本          
    3.盈余公积弥补亏损          
    4.其他          
  （六）专项储备 - - - - - - - - - 
    1.本年提取          
    2.本年使用          
四、本年年末余额 879,518,521.00 530,270,369.82 - - 978,306,258.09 - 779,483,726.61 -1,785,604.96 3,165,793,270.56 

法定代表人：                                                主管会计工作负责人：                                             会计机构负责人： 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

13 

一、 公司的基本情况 
深圳长城开发科技股份有限公司（以下简称本公司，在包含子公司时简称本集团）系
经深圳市人民政府深府办复(1993)887号文件批准，由原“开发科技(蛇口)有限公司”改
组设立，于一九九三年十月八日注册成为股份有限公司，并经深圳市证券管理办公室深证
办复(1993)142号文件批准，向社会公开发行普通股股票(A股)，在深圳证券交易所上市。
本公司企业法人营业执照注册号440301501126473号，法定代表人为谭文鋕，注册及办公
地址为深圳市福田区彩田路7006号。 
本公司原名“深圳开发科技股份有限公司”，2005年度（第一次）临时股东大会审议
通过了《关于变更公司名称的议案》，并经广东省深圳市工商行政管理局核准，本公司名
称变更为“深圳长城开发科技股份有限公司”。 
截至2010年12月31日，本公司总股本为131,927万股，其中有限售条件股份138万股，
占总股本的0.10%；无限售条件股份131,789万股，占总股本的99.90%。 
本公司所处行业为计算机及相关设备制造业。  
本公司经营范围包括：开发、生产、经营计算机软、硬件系统及其外部设备、通讯设
备、电子仪器仪表及其零部件、原器件、接插件和原材料，生产、经营家用商品电脑及电
子玩具（以上生产项目均不含限制项目）；金融计算机软件模型的制作和设计、精密模具
CAD/CAM 技术、节能型自动化机电产品和智能自动化控制系统、办公自动化设备、激光仪
器、光电产品及金卡系统、光通讯系统和信息网络系统的技术开发和安装工程；商用机器
（含税控设备、税控系统）；机顶盒、表计类产品（水表、气表等）、网络多媒体产品的
开发、设计、生产、销售及服务；金融终端设备的开发、设计、生产、销售、技术服务、
售后服务及系统集成。经营进出口业务（法律、行政法规、国务院决定禁止的项目除外，
限制的项目须取得许可后方可经营）。 
股东大会是本公司的权力机构，依法行使公司经营方针、筹资、投资、利润分配等重
大事项决议权。董事会对股东大会负责，依法行使公司的经营决策权；经理层负责组织实
施股东会、董事会决议事项，主持企业的生产经营管理工作。 
本集团的控股股东为长城科技股份有限公司(以下简称长城科技)。 
本集团的实际控制人为中国电子信息产业集团有限公司 (以下简称 CEC)。 

深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

14 

二、 财务报表的编制基础 
本集团财务报表以持续经营为基础，根据实际发生的交易和事项，按照财政部颁布的《企
业会计准则》及相关规定，并基于本附注四“重要会计政策、会计估计和合并财务报表的编制
方法”所述会计政策和估计编制。 
三、 遵循企业会计准则的声明 
本集团编制的财务报表符合企业会计准则的要求，真实、完整地反映了本集团的财务
状况、经营成果和现金流量等有关信息。 
四、 重要会计政策、会计估计和合并财务报表的编制方法 
1. 会计期间 
本集团的会计期间为公历 1 月 1 日至 12 月 31 日。 
2. 记账本位币  
本公司及境内子公司以人民币为记账本位币。境外子公司以港币或其他当地货币为记
账本位币，折算成人民币时的折算方法参见四、5.(2)。 
3. 记账基础和计价原则 
本集团会计核算以权责发生制为记账基础。 
除附注中特别说明外，一般以历史成本为计价原则。 
4. 现金及现金等价物 
本集团现金流量表之现金指库存现金以及可以随时用于支付的存款。现金流量表之现
金等价物指持有期限不超过 3 个月、流动性强、易于转换为已知金额现金且价值变动风险
很小的投资。 
5. 外币业务和外币财务报表折算 
（1）外币交易 
本集团外币交易按交易发生日的即期汇率将外币金额折算为人民币金额。于资产负债
表日，外币货币性项目采用资产负债表日的即期汇率折算为人民币，所产生的折算差额除
了为购建或生产符合资本化条件的资产而借入的外币专门借款产生的汇兑差额按资本化
的原则处理外，直接计入当期损益。以公允价值计量的外币非货币性项目，采用公允价值
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

15 

确定日的即期汇率折算为人民币，所产生的折算差额，作为公允价值变动直接计入当期损
益。以历史成本计量的外币非货币性项目，仍采用交易发生日的即期汇率折算，不改变其
人民币金额。 
（2）外币财务报表的折算 
外币资产负债表中资产、负债类项目采用资产负债表日的即期汇率折算；所有者权
益类项目除“未分配利润”外，均按业务发生时的即期汇率折算；利润表中的收入与费用
项目，采用当期的平均汇率折算。上述折算产生的外币报表折算差额，在所有者权益项目
下单独列示。外币现金流量采用当期的平均汇率折算。汇率变动对现金的影响额，在现金
流量表中单独列示。 
6. 金融资产和金融负债 
（1） 金融资产 
本集团按投资目的和经济实质对拥有的金融资产分为以公允价值计量且其变动计入
当期损益的金融资产、持有至到期投资、贷款和应收款项及可供出售金融资产四大类。 
1） 以公允价值计量且其变动计入当期损益的金融资产是指持有的主要目的为短期
内出售的金融资产，在资产负债表中以交易性金融资产列示。 
2） 持有至到期投资是指到期日固定、回收金额固定或可确定，且管理层有明确意图
和能力持有至到期的非衍生金融资产。 
3） 贷款和应收款项是指在活跃市场中没有报价，回收金额固定或可确定的非衍生金
融资产。 
4） 可供出售金融资产包括初始确认时即被指定为可供出售的非衍生金融资产及未
被划分为其他类的金融资产。 
金融资产以公允价值进行初始确认。以公允价值计量且其变动计入当期损益的金融资
产，取得时发生的相关交易费用直接计入当期损益，其他金融资产的相关交易费用计入初
始确认金额。当某项金融资产收取现金流量的合同权利已终止或与该金融资产所有权上几
乎所有的风险和报酬已转移至转入方的，终止确认该金融资产。 
以公允价值计量且其变动计入当期损益的金融资产和可供出售金融资产按照公允价
值进行后续计量；贷款和应收款项以及持有至到期投资采用实际利率法，以摊余成本列示。 
以公允价值计量且其变动计入当期损益的金融资产的公允价值变动计入公允价值变
动损益；在资产持有期间所取得的利息或现金股利，确认为投资收益；处置时，其公允价
值与初始入账金额之间的差额确认为投资损益，同时调整公允价值变动损益。 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

16 

可供出售金融资产的公允价值变动计入股东权益；持有期间按实际利率法计算的利
息，计入投资收益；可供出售权益工具投资的现金股利，于被投资单位宣告发放股利时计
入投资收益；处置时，取得的价款与账面价值扣除原直接计入股东权益的公允价值变动累
计额之后的差额，计入投资损益。 
除以公允价值计量且其变动计入当期损益的金融资产外，本集团于资产负债表日对其
他金融资产的账面价值进行检查，如果有客观证据表明某项金融资产发生减值的，计提减
值准备。如果可供出售金融资产的公允价值发生较大幅度或非暂时性下降，原直接计入股
东权益的因公允价值下降形成的累计损失计入减值损失。对已确认减值损失的可供出售债
务工具投资，在期后公允价值上升且客观上与确认原减值损失确认后发生的事项有关的，
原确认的减值损失予以转回，计入当期损益；对已确认减值损失的可供出售权益工具投资，
在期后公允价值上升且客观上与确认原减值损失确认后发生的事项有关的，原确认的减值
损失予以转回，计入股东权益。在活跃市场中没有报价且其公允价值不能可靠计量的权益
工具投资发生的减值损失，不予转回。 
（2） 金融负债 
本集团的金融负债于初始确认时分类为以公允价值计量且其变动计入当期损益的金
融负债和其他金融负债。 
以公允价值计量且其变动计入当期损益的金融负债，包括交易性金融负债和初始确认
时指定为以公允价值计量且其变动计入当期损益的金融负债，按照公允价值进行后续计
量，公允价值变动形成的利得或损失以及与该金融负债相关的股利和利息支出计入当期损
益。 
其他金融负债采用实际利率法，按照摊余成本进行后续计量。 
（3） 金融资产和金融负债的公允价值确定方法 
1） 金融工具存在活跃市场的，活跃市场中的市场报价用于确定其公允价值。在活跃
市场上，本集团已持有的金融资产或拟承担的金融负债以现行出价作为相应资产或负债的
公允价值；本集团拟购入的金融资产或已承担的金融负债以现行要价作为相应资产或负债
的公允价值。金融资产或金融负债没有现行出价和要价，但最近交易日后经济环境没有发
生重大变化的，则采用最近交易的市场报价确定该金融资产或金融负债的公允价值。 
2） 金融工具不存在活跃市场的，采用估值技术确定其公允价值。估值技术包括参考
熟悉情况并自愿交易的各方最近进行的市场交易中使用的价格、参照实质上相同的其他金
融资产的当前公允价值、现金流量折现法和期权定价模型等。 

深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

17 

7. 应收款项坏账准备 
本集团将下列情形作为应收款项坏账损失确认标准：债务单位撤销、破产、资不抵债、
现金流量严重不足、发生严重自然灾害等导致停产而在可预见的时间内无法偿付债务等；
债务单位逾期未履行偿债义务，并且具有明显特征表明确实不能收回的；其他确凿证据表
明确实无法收回或收回的可能性不大。 
对可能发生的坏账损失采用备抵法核算，期末单独或按组合进行减值测试，计提坏账
准备，计入当期损益。 
对于符合上述坏账损失确认标准的应收款项，经本集团按规定程序批准后作为坏账损
失，冲销提取的坏账准备。 
（1）单项金额重大并单项计提坏账准备的应收款项 
单项金额重大的判断依据或金额标准 单项金额超过期末应收款项余额 10%以上的应收款项视为重大应收款项 
单项金额重大并单项计提坏账准备的计提方法 根据其未来现金流量现值低于其账面价值的差额，计提坏账准备 
（2） 按组合计提坏账准备应收款项 
确定组合的依据 
账龄组合 以应收款项的账龄为信用风险特征划分组合  
按组合计提坏账准备的计提方法 
账龄组合 按账龄分析法计提坏账准备 
1）采用账龄分析法的应收款项坏账准备计提比例如下： 
账龄 应收账款计提比例（%） 其他应收款计提比例（%） 
1 年以内 1% 1% 
1-2 年 10% 10% 
2-3 年 30% 30% 
3 年以上 100% 100% 



深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

18 

（3）单项金额虽不重大但单项计提坏账准备的应收款项 
单项计提坏账准备的理由 单项金额不重大且按照组合计提坏账准备不能反映其风险特征的应收款项 
坏账准备的计提方法 根据其未来现金流量现值低于其账面价值的差额，计提坏账准备 
8. 存货 
本集团存货主要包括原材料、在产品、产成品、发出商品、包装物、低值易耗品、自
制半成品等。 
存货实行永续盘存制，存货在取得时按实际成本计价；领用或发出存货，采用移动加
权平均法确定其实际成本。低值易耗品和包装物采用一次转销法进行摊销。 
期末存货按成本与可变现净值孰低原则计价，对于存货因遭受毁损、全部或部分陈旧
过时或销售价格低于成本等原因，预计其成本不可收回的部分，提取存货跌价准备。库存
商品及大宗原材料的存货跌价准备按单个存货项目的成本高于其可变现净值的差额提取；
其他数量繁多、单价较低的原辅材料按类别提取存货跌价准备。 
产成品、在产品、自制半成品和用于出售的材料等直接用于出售的商品存货，其可变
现净值按该存货的估计售价减去估计的销售费用和相关税费后的金额确定；用于生产而持
有的材料存货，其可变现净值按所生产的产成品的估计售价减去至完工时估计将要发生的
成本、估计的销售费用和相关税费后的金额确定。为执行销售合同或者劳务合同而持有的
存货，其可变现净值以合同价格为基础计算；企业持有存货的数量多于销售合同订购数量
的，超出部分的存货可变现净值以一般销售价格为基础计算。 
9. 长期股权投资 
长期股权投资主要包括本集团持有的能够对被投资单位实施控制、共同控制或重大影
响的权益性投资，以及对被投资单位不具有控制、共同控制或重大影响，并且在活跃市场
中没有报价、公允价值不能可靠计量的权益性投资。 
共同控制是指按合同约定对某项经济活动所共有的控制。共同控制的确定依据主要为
任何一个合营方均不能单独控制合营企业的生产经营活动；涉及合营企业基本经营活动的
决策需要各合营方一致同意等。 
重大影响是指对被投资单位的财务和经营政策有参与决策的权力，但并不能控制或与
其他方一起共同控制这些政策的制定。重大影响的确定依据主要为本集团直接或通过子公
司间接拥有被投资单位 20%（含）以上但低于 50%的表决权股份，如果有明确证据表明该
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

19 

种情况下不能参与被投资单位的生产经营决策，则不能形成重大影响。 
通过同一控制下的企业合并取得的长期股权投资，在合并日按照取得被合并方所有者
权益账面价值的份额作为长期股权投资的投资成本。通过非同一控制下的企业合并取得的
长期股权投资，以在合并（购买）日为取得对被合并（购买）方的控制权而付出的资产、
发生或承担的负债以及发行的权益性证券的公允价值作为合并成本。在合并（购买）日按
照合并成本作为长期股权投资的初始投资成本。 
除上述通过企业合并取得的长期股权投资外，以支付现金取得的长期股权投资，按照
实际支付的购买价款作为投资成本，初始投资成本包括与取得长期股权投资直接相关的费
用、税金及其他必要支出；以发行权益性证券取得的长期股权投资，按照发行权益性证券
的公允价值作为投资成本；投资者投入的长期股权投资，按照投资合同或协议约定的价值
作为投资成本；以债务重组、非货币性资产交换等方式取得的长期股权投资，按相关会计
准则的规定确定投资成本。 
本集团对子公司投资采用成本法核算，编制合并财务报表时按权益法进行调整；对合
营企业及联营企业投资采用权益法核算；对不具有控制、共同控制或重大影响并且在活跃
市场中没有报价、公允价值不能可靠计量的长期股权投资，采用成本法核算；对不具有控
制、共同控制或重大影响，但在活跃市场中有报价、公允价值能够可靠计量的长期股权投
资，作为可供出售金融资产核算。 
采用成本法核算时，长期股权投资按初始投资成本计价，追加或收回投资时调整长期
股权投资的成本。采用权益法核算时，当期投资损益为应享有或应分担的被投资单位当年
实现的净损益的份额。在确认应享有被投资单位净损益的份额时，以取得投资时被投资单
位各项可辨认资产等的公允价值为基础，按照本集团的会计政策及会计期间，并抵销与联
营企业及合营企业之间发生的内部交易损益按照持股比例计算归属于投资企业的部分，对
被投资单位的净利润进行调整后确认。对于首次执行日之前已经持有的对联营企业及合营
企业的长期股权投资，如存在与该投资相关的股权投资借方差额，还应扣除按原剩余期限
直线摊销的股权投资借方差额，确认投资损益。 
本集团对因减少投资等原因对被投资单位不再具有共同控制或重大影响，并且在活跃
市场中没有报价、公允价值不能可靠计量的长期股权投资，改按成本法核算；对因追加投
资等原因能够对被投资单位实施控制的长期股权投资，也改按成本法核算；对因追加投资
等原因能够对被投资单位实施共同控制或重大影响但不构成控制的，或因处置投资等原因
对被投资单位不再具有控制但能够对被投资单位实施共同控制或重大影响的长期股权投
资，改按权益法核算。 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

20 

处置长期股权投资，其账面价值与实际取得价款的差额，计入当期投资收益。采用权
益法核算的长期股权投资，因被投资单位除净损益以外所有者权益的其他变动而计入所有
者权益的，处置该项投资时将原计入所有者权益的部分按相应比例转入当期投资收益。 
在确认应分担被投资单位发生的净亏损时，以长期股权投资的账面价值和其他实质上
构成对被投资单位净投资的长期权益减记至零为限。此外，如本集团对被投资单位负有承
担额外损失的义务，则按预计承担的义务确认预计负债，计入当期损益。被投资单位以后
期间实现净利润的，本集团在收益分享额弥补未确认的亏损分担额后，恢复确认收益分享
额。 
10. 投资性房地产 
本集团投资性房地产包括已出租的土地使用权、持有并准备增值后转让的土地使用权
和已出租的房屋建筑物。 
本集团投资性房地产按其成本作为入账价值，外购投资性房地产的成本包括购买价
款、相关税费和可直接归属于该资产的其他支出；自行建造投资性房地产的成本，由建造
该项资产达到预定可使用状态前所发生的必要支出构成。 
本集团对投资性房地产采用成本模式进行后续计量，按其预计使用寿命及净残值率采
用平均年限法计提折旧或摊销。投资性房地产的预计使用寿命、净残值率及年折旧(摊销)
率如下： 
类   别 折旧年限（年） 预计残值率（%） 年折旧率（%）
土地使用权 土地使用权证规定的使用年限 0 以相应年限计量 
房屋建筑物 20-35年 10.00% 2.57%-4.5% 
当投资性房地产的用途改变为自用时，则自改变之日起，将该投资性房地产转换为固
定资产或无形资产。自用房地产的用途改变为赚取租金或资本增值时，则自改变之日起，
将固定资产或无形资产转换为投资性房地产。发生转换时，以转换前的账面价值作为转换
后的入账价值。 
当投资性房地产被处置，或者永久退出使用且预计不能从其处置中取得经济利益时，
终止确认该项投资性房地产。投资性房地产出售、转让、报废或毁损的处置收入扣除其账
面价值和相关税费后的金额计入当期损益。 
11. 固定资产 
本集团固定资产是指同时具有以下特征，即为生产商品、提供劳务、出租或经营管理
而持有的，使用年限超过一年的有形资产。 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

21 

固定资产包括房屋及建筑物、机器设备、电子设备及仪器仪表、运输设备和其他设
备，按其取得时的成本作为入账的价值，其中，外购的固定资产成本包括买价、增值税（不
予抵扣部分）和进口关税等相关税费，以及为使固定资产达到预定可使用状态前所发生的
可直接归属于该资产的其他支出；自行建造固定资产的成本，由建造该项资产达到预定可
使用状态前所发生的必要支出构成；投资者投入的固定资产，按投资合同或协议约定的价
值作为入账价值，但合同或协议约定价值不公允的按公允价值入账；融资租赁租入的固定
资产，按租赁开始日租赁资产公允价值与最低租赁付款额现值两者中较低者作为入账价
值。 
与固定资产有关的后续支出，包括修理支出、更新改造支出等，符合固定资产确认
条件的，计入固定资产成本，对于被替换的部分，终止确认其账面价值；不符合固定资产
确认条件的，于发生时计入当期损益。 
除已提足折旧仍继续使用的固定资产和单独计价入账的土地外，本集团对所有固定
资产计提折旧。计提折旧时采用平均年限法，并根据用途分别计入相关资产的成本或当期
费用。本集团固定资产的分类折旧年限、预计净残值率、折旧率如下： 
序号 类别 折旧年限(年) 预计残值率(%) 年折旧率(%) 
1 房屋及建筑物  20-35年 10.00% 2.57-4.5%
2 机器设备  10年 0-10.00% 9.00-10.00%
3 电子设备及仪器仪表  3-10年 0-10.00% 9.00-33.33% 
4 运输设备  5-7年 0-10.00% 12.86-20.00%
5 其他设备  5年 0-10.00% 18.00-20.00%
本集团于每年年度终了，对固定资产的预计使用寿命、预计净残值和折旧方法进行
复核，如发生改变，则作为会计估计变更处理。 
当固定资产被处置、或者预期通过使用或处置不能产生经济利益时，终止确认该固定
资产。固定资产出售、转让、报废或毁损的处置收入扣除其账面价值和相关税费后的金额
计入当期损益。 
12. 在建工程 
在建工程按实际发生的成本计量。自营建筑工程按直接材料、直接工资、直接施工费
等计量；出包建筑工程按应支付的工程价款等计量；设备安装工程按所安装设备的价值、
安装费用、工程试运转等所发生的支出等确定工程成本。在建工程成本还包括应当资本化
的借款费用和汇兑损益。 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

22 

在建工程在达到预定可使用状态之日起，根据工程预算、造价或工程实际成本等，按
估计的价值结转固定资产，次月起开始计提折旧，待办理了竣工决算手续后再对固定资产
原值差异进行调整。 
13. 借款费用 
借款费用包括借款利息、折价或溢价的摊销、辅助费用以及因外币借款而发生的汇兑
差额等。可直接归属于符合资本化条件的资产的购建或者生产的借款费用，在资产支出已
经发生、借款费用已经发生、为使资产达到预定可使用或可销售状态所必要的购建或生产
活动已经开始时，开始资本化；当购建或生产符合资本化条件的资产达到预定可使用或可
销售状态时，停止资本化。其余借款费用在发生当期确认为费用。 
专门借款当期实际发生的利息费用，扣除尚未动用的借款资金存入银行取得的利息收
入或进行暂时性投资取得的投资收益后的金额予以资本化；一般借款根据累计资产支出超
过专门借款部分的资产支出加权平均数乘以所占用一般借款的资本化率，确定资本化金
额。资本化率根据一般借款加权平均利率计算确定。 
符合资本化条件的资产，是指需要经过相当长时间（通常指 1 年以上）的购建或者生
产活动才能达到预定可使用或者可销售状态的固定资产、投资性房地产和存货等资产。 
如果符合资本化条件的资产在购建或者生产过程中发生非正常中断、且中断时间连续超
过 3 个月，暂停借款费用的资本化，直至资产的购建或生产活动重新开始。 
14. 无形资产 
本集团无形资产包括土地使用权、专利权及专有技术、商标权等，按取得时的实际
成本计量，其中，购入的无形资产，按实际支付的价款和相关的其他支出作为实际成本；
投资者投入的无形资产，按投资合同或协议约定的价值确定实际成本，但合同或协议约定
价值不公允的，按公允价值确定实际成本。 
土地使用权从出让起始日起，按其出让年限平均摊销；专利技术、非专利技术和其
他无形资产按预计使用年限、合同规定的受益年限和法律规定的有效年限三者中最短者分
期平均摊销。摊销金额按其受益对象计入相关资产成本和当期损益。 
对使用寿命有限的无形资产的预计使用寿命及摊销方法于每年年度终了进行复核，如
发生改变，则作为会计估计变更处理。在每个会计期间对使用寿命不确定的无形资产的预
计使用寿命进行复核，如有证据表明无形资产的使用寿命是有限的，则估计其使用寿命并
在预计使用寿命内摊销。 

深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

23 

15. 研究与开发 
本集团的研究开发支出根据其性质以及研发活动最终形成无形资产是否具有较大不
确定性，分为研究阶段支出和开发阶段支出。研究阶段的支出，于发生时计入当期损益；
开发阶段的支出，同时满足下列条件的，确认为无形资产： 
（1）完成该无形资产以使其能够使用或出售在技术上具有可行性； 
（2）具有完成该无形资产并使用或出售的意图； 
（3）运用该无形资产生产的产品存在市场或无形资产自身存在市场； 
（4）有足够的技术、财务资源和其他资源支持，以完成该无形资产的开发，并有能
力使用或出售该无形资产； 
（5）归属于该无形资产开发阶段的支出能够可靠地计量。 
不满足上述条件的开发阶段的支出，于发生时计入当期损益。前期已计入损益的开发
支出在以后期间不再确认为资产。已资本化的开发阶段的支出在资产负债表上列示为开发
支出，自该项目达到预定可使用状态之日起转为无形资产列报。 
16. 非金融长期资产减值 
本集团于每一资产负债表日对长期股权投资、固定资产、在建工程、使用寿命有限的
无形资产等项目进行检查，当存在下列迹象时，表明资产可能发生了减值，本集团将进行
减值测试。对商誉和使用寿命不确定的无形资产，无论是否存在减值迹象，每年末均进行
减值测试。难以对单项资产的可收回金额进行测试的，以该资产所属的资产组或资产组组
合为基础测试。 
减值测试后，若该资产的账面价值超过其可收回金额，其差额确认为减值损失，上述
资产的减值损失一经确认，在以后会计期间不予转回。资产的可收回金额是指资产的公允
价值减去处置费用后的净额与资产预计未来现金流量的现值两者之间的较高者。 
出现减值的迹象如下： 
（1）资产的市价当期大幅度下跌，其跌幅明显高于因时间的推移或者正常使用而预
计的下跌； 
（2）企业经营所处的经济、技术或者法律等环境以及资产所处的市场在当期或者将
在近期发生重大变化，从而对企业产生不利影响； 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

24 

（3）市场利率或者其他市场投资报酬率在当期已经提高，从而影响企业计算资产预
计未来现金流量现值的折现率，导致资产可收回金额大幅度降低； 
（4）有证据表明资产已经陈旧过时或者其实体已经损坏； 
（5）资产已经或者将被闲置、终止使用或者计划提前处置； 
（6）企业内部报告的证据表明资产的经济绩效已经低于或者将低于预期，如资产所
创造的净现金流量或者实现的营业利润（或者亏损）远远低于（或者高于）预计金额等； 
（7）其他表明资产可能已经发生减值的迹象。 
17. 长期待摊费用 
本集团的长期待摊费用是指已经支出，但应由当期及以后各期承担的摊销期限在 1年
以上(不含 1 年)的各项费用，该等费用在受益期内平均摊销。如果长期待摊费用项目不能
使以后会计期间受益，则将尚未摊销的该项目的摊余价值全部转入当期损益。 
18. 职工薪酬 
本集团在职工提供服务的会计期间，将应付的职工薪酬确认为负债，并根据职工提供
服务的受益对象计入相关资产成本和费用。因解除与职工的劳动关系而给予的补偿，计入
当期损益。 
职工薪酬主要包括工资、奖金、津贴和补贴、职工福利费、社会保险费及住房公积金、
工会经费和职工教育经费等与获得职工提供的服务相关的支出。 
如在职工劳动合同到期之前决定解除与职工的劳动关系，或为鼓励职工自愿接受裁减
而提出给予补偿的建议，如果本集团已经制定正式的解除劳动关系计划或提出自愿裁减建
议，并即将实施，同时本集团不能单方面撤回解除劳动关系计划或裁减建议的，确认因解
除与职工劳动关系给予补偿产生的预计负债，计入当期损益。 
19. 预计负债 
当与对外担保、商业承兑汇票贴现、未决诉讼或仲裁、产品质量保证等或有事项相
关的业务同时符合以下条件时，本集团将其确认为负债：该义务是本集团承担的现时义务；
该义务的履行很可能导致经济利益流出企业；该义务的金额能够可靠地计量。 
预计负债按照履行相关现时义务所需支出的最佳估计数进行初始计量，并综合考虑与
或有事项有关的风险、不确定性和货币时间价值等因素。货币时间价值影响重大的，通过
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

25 

对相关未来现金流出进行折现后确定最佳估计数。每个资产负债表日对预计负债的账面价
值进行复核，如有改变则对账面价值进行调整以反映当前最佳估计数。 
20. 收入确认原则 
本集团的营业收入主要包括销售商品收入、提供劳务收入、让渡资产使用权收入，
收入确认原则如下： 
（1） 本集团在已将商品所有权上的主要风险和报酬转移给购货方；本集团既没有保
留通常与所有权相联系的继续管理权、也没有对已售出的商品实施有效控制；收入的金额
能够可靠地计量；相关的经济利益很可能流入企业；相关的已发生或将发生的成本能够可
靠地计量时，确认销售商品收入的实现。 
（2） 本集团在劳务总收入和总成本能够可靠地计量、与劳务相关的经济利益很可能
流入本集团、劳务的完成进度能够可靠地确定时，确认劳务收入的实现。 
（3） 与交易相关的经济利益很可能流入本集团、收入的金额能够可靠地计量时，确
认让渡资产使用权收入的实现。 
21. 政府补助 
政府补助在本集团能够满足其所附的条件以及能够收到时予以确认。政府补助为货
币性资产的，按照实际收到的金额计量，对于按照固定的定额标准拨付的补助，按照应收
的金额计量；政府补助为非货币性资产的，按照公允价值计量，公允价值不能可靠取得的，
按照名义金额(1 元)计量。 
与资产相关的政府补助确认为递延收益，并在相关资产使用寿命内平均分配计入当期
损益。与收益相关的政府补助，用于补偿以后期间的相关费用或损失的，确认为递延收益，
并在确认相关费用的期间计入当期损益；用于补偿已发生的相关费用或损失的，直接计入
当期损益。 
22. 递延所得税资产和递延所得税负债 
本集团递延所得税资产和递延所得税负债根据资产和负债的计税基础与其账面价值
的差额(暂时性差异)计算确认。对于按照税法规定能够于以后年度抵减应纳税所得额的可
抵扣亏损和税款抵减，视同暂时性差异确认相应的递延所得税资产。于资产负债表日，递
延所得税资产和递延所得税负债，按照预期收回该资产或清偿该负债期间的适用税率计
量。 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

26 

本集团以很可能取得用来抵扣可抵扣暂时性差异的应纳税所得额为限，确认由可抵扣
暂时性差异产生的递延所得税资产。对已确认的递延所得税资产，当预计到未来期间很可
能无法获得足够的应纳税所得额用以抵扣递延所得税资产时，应当减记递延所得税资产的
账面价值。在很可能获得足够的应纳税所得额时，减记的金额予以转回。 
23. 租赁 
本集团在租赁开始日将租赁分为融资租赁和经营租赁。 
融资租赁是指实质上转移了与资产所有权有关的全部风险和报酬的租赁。本集团作
为承租方时，在租赁开始日，按租赁开始日租赁资产的公允价值与最低租赁付款额的现值
两者中较低者，作为融资租入固定资产的入账价值，将最低租赁付款额作为长期应付款的
入账价值，将两者的差额记录为未确认融资费用。 
经营租赁是指除融资租赁以外的其他租赁。本集团作为承租方的租金在租赁期内的各
个期间按直线法计入相关资产成本或当期损益，本集团作为出租方的租金在租赁期内的各
个期间按直线法确认为收入。 
24. 所得税的会计核算 
所得税的会计核算采用资产负债表债务法。所得税费用包括当年所得税和递延所得
税。除将与直接计入股东权益的交易和事项相关的当年所得税和递延所得税计入股东权
益，以及企业合并产生的递延所得税调整商誉的账面价值外，其余的当期所得税和递延所
得税费用或收益计入当期损益。 
当年所得税是指企业按照税务规定计算确定的针对当期发生的交易和事项，应纳给税
务部门的金额，即应交所得税；递延所得税是指按照资产负债表债务法应予确认的递延所
得税资产和递延所得税负债在期末应有的金额相对于原已确认金额之间的差额。 
25. 企业合并 
企业合并是指将两个或两个以上单独的企业合并形成一个报告主体的交易或事项。本
集团在合并日或购买日确认因企业合并取得的资产、负债，合并日或购买日为实际取得被
合并方或被购买方控制权的日期。 
对于同一控制下的企业合并，作为合并方在企业合并中取得的资产和负债，按照合
并日在被合并方的账面价值计量，取得的净资产账面价值与支付的合并对价账面价值的差
额，调整资本公积；资本公积不足冲减的，调整留存收益。 
对于非同一控制下企业合并，合并成本为本集团在购买日为取得对被购买方的控制权
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

27 

而付出的资产、发生或承担的负债以及发行的权益性证券的公允价值。合并成本大于合
并中取得的被购买方可辨认净资产公允价值份额的差额，确认为商誉；合并成本小于合
并中取得的被购买方可辨认净资产公允价值份额的，经复核确认后，计入当期损益。 
26. 合并财务报表的编制方法 
（1） 合并范围的确定原则 
本集团将拥有实际控制权的子公司纳入合并财务报表范围。 
（2）  合并财务报表所采用的会计方法 
本集团合并财务报表是按照《企业会计准则第 33 号－合并财务报表》及相关规定的
要求编制，合并时合并范围内的所有重大内部交易和往来业已抵销。子公司的股东权益中
不属于母公司所拥有的部分，作为少数股东权益在合并财务报表中股东权益项下单独列
示。 
子公司与本公司采用的会计政策或会计期间不一致的，在编制合并财务报表时，按照
本公司的会计政策或会计期间对子公司财务报表进行必要的调整。 
对于非同一控制下企业合并取得的子公司，在编制合并财务报表时，以购买日可辨认
净资产公允价值为基础对其个别财务报表进行调整；对于同一控制下企业合并取得的子公
司，视同该企业于合并当期的年初已经存在，从合并当期的年初起将其资产、负债、经营
成果和现金流量，按原账面价值纳入合并财务报表。 
五、 会计政策、会计估计变更和前期差错更正 
本集团本期无重大会计政策、会计估计变更和前期差错更正事项。 
六、 税项 
1. 企业所得税 
本公司原适用所得税税率为 15%，根据 2008 年 1 月 1 日起施行的《中华人民共和国
企业所得税法》及国务院 2007 年 12 月 26 日《国务院关于实施企业所得税过渡优惠政策
的通知》【国发[2007]39 号】，本年度适用企业所得税税率为 22%。 
本公司之子公司深圳开发光磁科技有限公司(以下简称开发光磁) 原适用所得税税率
为 15%。根据《企业所得税法》和《国务院关于实施企业所得税过渡优惠政策的通知》【国
发（2007）39 号】，本年度适用企业所得税税率为 22%。 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

28 

本公司之子公司深圳开发微电子有限公司(以下简称开发微电子)原适用所得税税率
为 15%。根据《企业所得税法》和《国务院关于实施企业所得税过渡优惠政策的通知》【国
发（2007）39 号】，本年度适用企业所得税税率为 22%。经深圳市国家税务局【深国税福
减免（2004）0211 号】文件批准，从开始获利年度起，第一年和第二年免征企业所得税，
第三年至第五年减半征收企业所得税。本年度为开发微电子的第五个获利年度，企业所得
税实际征收率为 11%。 
本公司之子公司苏州长城开发科技有限公司(以下简称开发苏州)为苏州工业园区外
商投资企业，原适用所得税税率为 15%。根据《企业所得税法》和《国务院关于实施企业
所得税过渡优惠政策的通知》【国发（2007）39 号】，本年度适用企业所得税税率为 22%。
经【苏园国税二分局外优（2008）2 号】文件批准，享受“两免三减半”税收优惠。开发
苏州的获准享受获利年度和优惠开始年度为 2007 年，本年度为第四个获利年度，企业所
得税实际征收率为 11%。 
本公司之子公司深圳开发磁记录股份有限公司（以下简称开发磁）原适用所得税税率
为 15%。，根据《企业所得税法》和《国务院关于实施企业所得税过渡优惠政策的通知》【国
发（2007）39 号】，本年度适用企业所得税税率为 22%。 
本公司之子公司深圳开发技研汽车电子有限公司（以下简称开发技研），所得税率为
25%。 
本公司之子公司开发科技(香港)有限公司(以下简称开发香港)及本公司之孙公司开
发磁记录<香港>有限公司（以下简称磁记录香港）为香港注册的公司，企业所得税税率为
16.5%。 
本公司之孙公司深圳长城开发铝基片有限公司（以下简称铝基片）原适用所得税税率
为 15%。根据《企业所得税法》和《国务院关于实施企业所得税过渡优惠政策的通知》【国
发（2007）39 号】，本年度适用企业所得税税率为 22%。经深圳市国家税务局【深国税宝
龙减免（2006）0097 号】文件批准，从开始获利年度起，第一年和第二年免征企业所得
税，第三年至第五年减半征收企业所得税。本年度为铝基片的第五个获利年度，企业所得
税实际征收率为 11%。 
本公司之子公司海南长城开发科技有限公司（以下简称开发海南），所得税率为 25%。 
2. 增值税 
本公司以内销产品、原材料销售收入为增值税计税依据，执行 17%的税率（计征时抵
扣进项税额）；出口产品实行免抵退税。 

深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

29 

3. 营业税 
本集团各项营业税应税收入的适用税率为 5%。 
4. 城建税 
本公司按应缴营业税额和增值税额的 1%计缴城市维护建设税。 
5. 其他税项 
按国家和地方有关规定计算缴纳。 
七、 企业合并及合并财务报表 
（一） 子公司 
注册资本 年末投资金额 公司名称 公司类型 注册地 
业务
性质 币种 金额 
经营
范围 币种 金额 
同一控制下企业合并取得的子公司：              
开发磁 股份有限 深圳 生产 人民币 251,362,600.00 1* 人民币  396,477,751.63
其他方式取得的子公司：         
开发香港 有限公司 香港 销售 港币 3,900,000.00 2* 港币 1.00
开发光磁 有限公司 深圳 生产 人民币 16,000,000.00 3* 人民币 16,000,000.00
开发微电子 有限公司 深圳 生产 美元 20,000,000.00 4* 美元 20,000,000.00
开发苏州 有限公司 深圳 生产 美元 60,000,000.00 5* 美元 60,000,000.00
开发技研 有限公司 深圳 生产 人民币 6,500,000.00 6* 人民币 3,575,000.00
开发海南 有限公司 海南 生产 人民币 7,000,000.00 7* 人民币 7,000,000.00
（续） 
持股比例（%） 
公司名称 
实质
上构
成对
子公
司净
投资
的其
他项
目余
额 
直接 间接 
表决权
比例（%）
是否
合并
报表
少数股东权益 
少数股东权
益中用于冲
减少数股东
损益的金额 
从母公司所有者
权益冲减子公司
少数股东分担的
本期亏损超过少
数股东在该子公
司期初所有者权
益中所享有份额
后的余额 
同一控制下企业合并取得的子公司：          
开发磁 - 57.00% - 57.00% 是 294,312,583.38 - - 
其他方式取得的子公司：         
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

30 

开发香港 - 100.00% - 100.00% 是 - - - 
开发光磁 - 75.00% 25.00% 100.00% 是 - - - 
开发微电子 - 70.00% 30.00% 100.00% 是 - - - 
开发苏州 - 75.00% 25.00% 100.00% 是 - - - 
开发技研 - 55.00% - 55.00% 是 986,566.96 - - 
开发海南 - 100.00% 100.00% 100.00% 是 - - - 
1*经营范围：开发生产销售盘基片（不含限制项目）；自营进出口业务；从事非配额
许可证管理，非专营商品的收购出口业务及进出口业务。 
2*经营范围：商业贸易。 
3*经营范围：生产经营新型电子元器件、通信设备、计算机及其周边设备、仪器仪表、
金融POS机、网络多媒体设备以及各类设备零部件、电气机械及电子产品零部件（以上生
产项目均不含限制项目），半导体生产设备的安装与维护。  
4*经营范围：开发、生产、经营计算机软件、硬件系统及其外部设备、新型仪表及新
型电子元器件、零部件、接插件和原材料，精密仪器及在线测量仪器，家用商品电脑及电
子玩具，节能型自动化机电产品和智能控制系统(以上生产项目均不含限制项目)。 
5*经营范围：开发、设计、生产大容量磁盘驱动器磁头、电脑硬盘用线路板等相关电
子部件，销售本公司生产的产品并提供相关售后服务（凡涉及国家专项规定的，取得专项
许可手续后经营）。 
6*经营范围：生产经营汽车空调风门控制器、汽车电子零部件的研发并提供相关的售
后服务和技术支持。 
    7*经营范围：商用机器（含税控设备、税控系统）、机顶盒、表计类产品（水表、气
表等）、网络多媒体产品、金融终端设备、计算机软硬件系统及其外部设备、电子仪器仪
表及其零部件的研发并提供相关的售后服务和技术支持、贸易（以上项目凡涉及许可证经
营的凭许可证经营）。 
（二） 本年合并财务报表合并范围的变动 
1. 本年度新纳入合并范围的公司情况 
公司名称 新纳入合并 范围的原因 
持股比 
例（%） 年末净资产 本年净利润 
开发海南 新设成立 100% 6,999,141.16 -858.84
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

31 

（三） 本年发生的企业合并 
无 
（四） 外币报表折算 
本集团合并报表中之子公司开发香港外币报表折算方法请参阅本附注之四、5。 
八、 合并财务报表主要项目注释 
下列所披露的财务报表数据，除特别注明之外，“年初”系指 2010 年 1 月 1 日，“年
末”系指 2010 年 12 月 31 日，“本年”系指 2010 年 1 月 1 日至 12 月 31 日，“上年” 系
指 2009 年 1 月 1 日至 12 月 31 日，货币单位为人民币元。 
1. 货币资金 
年末金额 年初金额 
项目 
原币 折算 汇率 折合人民币 原币 
折算 
汇率 折合人民币 
库存现金  1,206,322.18  1,702,120.00
人民币 —— —— 774,330.51 —— —— 1,299,058.98
美元 20,448.38 6.6227 135,423.49 17,328.38 6.8282 118,321.64
港元 176,582.00 0.8509 150,253.62 236,133.37 0.8805 207,915.43
日元 629,364.00 0.0813 51,167.29 322,439.00 0.0738 23,796.00
新加坡币 5,560.98 5.1191 28,467.21 3,631.58 4.8605 17,651.29
韩币 1,783,054.00 0.0059 10,520.02 1,059,534.00 0.0057 6,039.34
马拉西亚元 2,124.50 2.1172 4,497.99 2,124.50 2.0184 4,288.09
新台币 9,364.00 0.2176 2,037.61 20,190.00 0.2117 4,274.22
泰铢 16,565.00 0.2193 3,632.70 16,565.00 0.2046 3,389.20
欧元 4,391.94 8.8065 38,677.62 841.94 9.7971 8,248.57
澳元 389.80 6.7139 2,617.08 414.00 6.1294 2,537.57
印度元 1,830.00 0.1452 265.72 14,070.00 0.1476 2,076.73
英镑 412.00 10.2182 4,209.90 412.00 10.9780 4,522.94
巴西雷亚尔 58.00 3.8176 221.42 -  -
银行存款  1,438,775,738.62  1,620,903,535.20
人民币 —— —— 1,295,379,435.24 —— —— 1,345,135,966.01
美元 13,915,253.36 6.6227 92,156,548.43 32,448,214.53 6.8282 221,562,898.45
港元 56,790,967.92 0.8509 48,323,434.60 6,917,795.94 0.8805 6,091,119.33
新加坡币 158,983.92 5.1191 813,854.58 123,482.90 4.8605 600,188.64
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

32 

年末金额 年初金额 
项目 
原币 折算 汇率 折合人民币 原币 
折算 
汇率 折合人民币 
日元 5,091,273.00 0.0813 413,920.49 499,551,624.01 0.0738 36,866,909.85
欧元 191,738.52 8.8065 1,688,545.28 1,086,694.32 9.7971 10,646,452.92
其他货币资金  339,664,122.41  243,722,754.49
人民币 —— —— 339,555,135.22 —— —— 242,823,802.43
美元 16,456.61 6.6227 108,987.19 131,652.86 6.8282 898,952.06
合计  1,779,646,183.21  1,866,328,409.69
本集团期末其他货币资金为本公司之子公司开发磁海外代付借款保证金
314,196,878.87 元，本公司履约保函保证金 22,187,243.54 元、远期结汇保证金
2,280,000.00 元以及税控服务保证金 1,000,000.00 元。 
2. 交易性金融资产 
（1） 交易性金融资产的种类 
项目 年末公允价值 年初公允价值 
交易性权益工具投资 - 208,360.00
指定为以公允价值计量且其变动计入
本期损益的金融资产 - 10,098,817.46
合计 - 10,307,177.46
年末交易性金融资产较年初减少 10,307,177.46 元，为本年将上年购买的基金赎回及
申购的新股出售所致。 
3. 应收票据  
票据种类 年末金额 年初金额 
银行承兑汇票 48,041,789.22 7,287,350.23
商业承兑汇票 - -
合计 48,041,789.22 7,287,350.23
应收票据年末较年初增加 40,754,438.99 元，增长 559.25%，主要原因为本年度中兴
手机、数据卡加工业务客户大量采取票据结算方式导致。 


深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

33 


4. 应收账款 
（1） 应收账款分类 
年末金额 年初金额 
账面余额 坏账准备 账面余额 坏账准备 项目 
金额 比例（%） 金额 
比例
（%） 金额 
比例
（%） 金额 
比例
（%）
单项金额重大并
单项计提坏账准
备的应收账款 
- - - - - - - -
按组合计提坏账
准备的应收账款 - - - - - - - -
其中：账龄组合 1,539,340,117.38 100.00% 64,923,708.75 100.00% 1,058,016,370.50 100.00% 60,064,430.69 100.00%
组合小计 1,539,340,117.38 100.00% 64,923,708.75 100.00% 1,058,016,370.50 100.00% 60,064,430.69 100.00%
单项金额虽不重
大但单项计提坏
账准备的应收账
款 
- - - - - - - -
合计 1,539,340,117.38 100.00% 64,923,708.75 100.00% 1,058,016,370.50 100.00% 60,064,430.69 100.00%
1） 组合中，按账龄分析法计提坏账准备的应收账款 
年末金额 年初金额 
账面余额 账面余额 项目 
金额 比例（%）
坏账准备 
金额 比例（%） 
坏账准备 
1年以内 1,487,086,423.05 96.61% 14,869,889.02 1,007,779,574.91 95.25% 10,243,758.79
1-2年 2,162,744.61 0.14% 216,274.45 417,324.03 0.04% 41,732.41
2-3年 362,006.35 0.02% 108,601.91 57,902.96 0.01% 17,370.89
3年以上 49,728,943.37 3.23% 49,728,943.37 49,761,568.60 4.70% 49,761,568.60
合计 1,539,340,117.38 100.00% 64,923,708.75 1,058,016,370.50 100.00% 60,064,430.69
（2） 年末应收账款中不含持有本集团 5%（含 5%）以上表决权股份股东单位的欠款  
（3） 应收账款金额前五名单位情况 
单位名称 与本公司关系 金额 账龄 
占应收账款总额
的比例(%) 
Seagate ingapore IHQ P.L. 客户 865,180,844.01 1年以内 56.20%
WD Media Malaysia 客户 117,725,685.35 1年以内 7.65%
Hitachi Global Storage Technologies 客户 86,307,677.89 1年以内 5.61%
Seagate Technology INT'L (RMO) 客户 74,234,162.75 1年以内 4.82%
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

34 

单位名称 与本公司关系 金额 账龄 
占应收账款总额
的比例(%) 
43,333,464.27 1年以内 2.82%中国机械设备进出口总公司 客户 
8,896,272.43 4-5年 0.58%
合计 1,195,678,106.70  77.68%
（4） 应收关联方账款情况 
单位名称 与本公司关系 金额 占应收账款总额的比例(%) 
深圳长城科美技术有限公司 联营企业 37,547,284.61 2.44%
长城易拓信息产品(深圳)有限公司 同一控股股东 10,884,836.23 0.71%
合计 48,432,120.84 3.15%
（5） 应收账款中外币余额 
年末金额 年初金额 外币名称 
原币 折算汇率 折合人民币 原币 折算汇率 折合人民币 
美元 190,877,794.62 6.6227 1,264,126,370.43 35,781,091.62 6.8282 244,320,449.80
欧元 4,195,968.80 8.8065 36,951,799.24 770,136.89 9.7971 7,545,108.13
新加坡币 94,884.14 5.1191 485,721.40 53,419.00 4.8605 259,643.05
港币 - - - 767,234,777.54 0.8805 675,550,221.62
合计 - - 1,301,563,891.07 - - 927,675,422.60
5. 预付款项  
（1） 预付款项账龄 
年末金额 年初金额 项目 
金额 比例（%） 金额 比例（%） 
1年以内 31,841,713.30 92.45% 42,298,868.86 74.67%
1－2年 2,142,348.87 6.22% 12,842,605.85 22.67%
2－3年 457,624.20 1.33% 1,510,056.04 2.66%
3年以上 - - - -
合计 34,441,686.37 100.00% 56,651,530.75 100.00%


深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

35 

（2） 预付款项主要单位 
单位名称 与本公司关系 金额 账龄 未结算原因 
宁波龙康智能仪表有限公司 供应商 7,199,999.82 1年以内 货未到 
深圳市瑞建建筑装饰工程有限公司 供应商 3,447,500.00 1年以内 工程未开始 
CELESTIAL SEMICONDUCTOR LTD. 供应商 1,991,106.00 1-2年 服务尚未开始 
深圳怀鸿电子电器有限公司 供应商 1,883,170.40 1年以内 货未到 
创元科技股份有限公司 供应商 1,779,361.29 1年以内 货未到 
合计  16,301,137.51
（3） 年末预付款项中不含持本集团 5%（含 5%）以上表决权股份的股东单位欠款。 
（4） 预付款项中外币余额 
年末金额 年初金额 
外币名称 原币 折算 
汇率 折合人民币 
原币 折算 
汇率 折合人民币 
美元 1,266,355.91 6.6227 8,386,695.29 2,354,535.42 6.8282 16,077,238.75
港币 6,214,246.58 0.8509 5,287,702.41 34,477,385.46 0.8805 30,357,337.90
欧元 5,545.50 8.8065 48,836.45 - - -
新加坡元 10,657.00 5.1191 54,554.25 - - -
合计 - - 13,777,788.40 - - 46,434,576.65
6. 应收利息 
项目 年初金额 本年增加 本年减少 年末金额 
定期存单利息 21,517,770.00 28,847,830.69 29,397,603.47 20,967,997.22
海外代付保证金利息 - 6,781,330.03 2,089,856.71 4,691,473.32
合计 21,517,770.00 35,629,160.72 31,487,460.18 25,659,470.54
7. 其他应收款 
（1） 其他应收款分类 
年末金额 年初金额 
账面余额 坏账准备 账面余额 坏账准备 项目 
金额 比例（%） 金额 
比例
（%） 金额 
比例
（%） 金额 
比例
（%）
单项金额重大并单
项计提坏账准备的
其他应收款 
- - - - - - - -
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

36 

年末金额 年初金额 
账面余额 坏账准备 账面余额 坏账准备 项目 
金额 比例（%） 金额 
比例
（%） 金额 
比例
（%） 金额 
比例
（%）
按组合计提坏账准
备的其他应收款 - - - - - - - -
其中：账龄组合 89,586,945.61 100.00% 65,953,398.62 100.00% 129,229,701.40 100.00% 86,533,662.88 100.00%
组合小计 89,586,945.61 100.00% 65,953,398.62 100.00% 129,229,701.40 100.00% 86,533,662.88 100.00%
单项金额虽不重大
但单项计提坏账准
备的其他应收款 
- - - - - - - -
合计 89,586,945.61 100.00% 65,953,398.62 100.00% 129,229,701.40 100.00% 86,533,662.88 100.00%
1） 组合中，按账龄分析法计提坏账准备的其他应收款 
年末金额 年初金额 
账面余额 账面余额 项目 
金额 比例（%）
坏账准备 
金额 比例（%） 
坏账准备 
1年以内 21,444,784.47 23.94% 214,447.83 16,363,262.44 12.66% 162,323.04
1-2年 2,488,199.95 2.78% 248,820.00 661,322.59 0.51% 66,132.26
2-3年 234,043.43 0.26% 70,213.03 36,999,869.70 28.63% 11,099,960.91
3年以上 65,419,917.76 73.02% 65,419,917.76 75,205,246.67 58.20% 75,205,246.67
合计 89,586,945.61 100.00% 65,953,398.62 129,229,701.40 100.00% 86,533,662.88
（2） 本年度坏账准备收回情况 
单位名称 其他应收款账面余额 
收回前累计已
计提坏账准备
金额 
本年收回 
金额 
确定原坏账
准备的依据 
本年收回 
原因 
昂纳信息技术(深圳)有限公司 29,893,771.72 29,893,771.72 29,893,771.72 账龄 注 
合计 29,893,771.72 29,893,771.72 29,893,771.72  
注：昂纳信息技术(深圳)有限公司（以下简称昂纳信息）为本公司之联营企业 O-Net 
Communications (Group) Limited 的子公司。本公司应收昂纳信息的款项为房租水电费，
账龄为 3 年以上，本公司已全额计提坏账准备。本年 O-Net Communications (Group) 
Limited 在香港联合证券交易所上市，募集资金部分用于昂纳信息偿还本公司欠款。 



深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

37 

（3） 本年度实际核销的其他应收款 
单位名称 其他应收款性质 核销金额 核销原因 
是否因关联 
交易产生 
韩国通用科技公司 代垫款 1,193,752.20 无法收回 是 
合计 1,193,752.20
根据本公司之子公司开发磁【2010】7 号董事会决议，同意对为韩国通用科技公司代
购材料及垫付运杂费 1,193,752.20 元予以核销。 
（4） 年末其他应收款中不持有本集团 5%（含 5%）以上表决权股份的股东单位欠款  
（5） 其他应收款金额前五名单位情况 
单位名称 与本公司关系 金额 账龄 
占其他
应收款
总额的
比例（%） 
性质或内容 
中国机械设备进出口总公司 客户 55,895,420.51 3-5年     62.39% 加工费 
成武有线电视公司 第三方 6,900,000.00 5年以上  7.70% 保证金抵押款 
沛顿科技（深圳）有限公司 客户 4,116,150.11 1年以内  4.59% 中央关务费及水电空调费 
中国长城计算机深圳股份有限公司 同一控股股东 2,320,762.48 1-2年     2.59% 房租押金 
水电气退税款  1,245,286.92 1年以内  1.39% 水电费 
合计 70,477,620.02 78.66% 
（6） 应收关联方款项 
单位名称 与本公司关系 金额 占其他应收款总额的比例（%） 
中国长城计算机深圳股份有限公司 同一控股股东 2,320,762.48 2.59%
深圳东红开发磁盘有限公司 联营企业 1,208,442.00 1.35%
深圳易拓科技有限公司 同一控股股东 57,838.40 0.06%
合计 3,587,042.88 4.00%
（7） 其他应收款中外币余额 
年末金额 年初金额 
外币名称 
原币 折算 汇率 折合人民币 原币 
折算 
汇率 折合人民币 
美元 81,445.70 6.6227 539,390.44 67,691.72 6.8282 462,212.60
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

38 

年末金额 年初金额 
外币名称 
原币 折算 汇率 折合人民币 原币 
折算 
汇率 折合人民币 
港币 332,987.64 0.8509 283,339.18 377,153.64 0.8805 332,083.78
新加坡币 - - - 8,752.00 4.8605 42,539.10
合计 - - 822,729.62 - - 836,835.48
（8） 终止确认的其他应收款 
单位名称 终止确认金额 与终止确认相关的利得和损失 
韩国通用科技公司 1,193,752.20 -
合计 1,193,752.20 -
8. 存货 
（1） 存货分类 
年末金额 年初金额 项目 
账面余额 跌价准备 账面价值 账面余额 跌价准备 账面价值 
在途物资 5,554,580.97 - 5,554,580.97 5,319,202.61 - 5,319,202.61
原材料 306,967,416.41 1,181,640.13 305,785,776.28 202,230,368.09 1,260,429.19 200,969,938.90
在产品 5,965,116.55 - 5,965,116.55 5,581,446.94 - 5,581,446.94
产成品 316,602,642.11 6,864,314.96 309,738,327.15 206,536,278.51 1,169,672.00 205,366,606.51
低值易耗品 19,100,668.01 7,092,888.20 12,007,779.81 13,312,868.03 6,165,741.28 7,147,126.75
包装物 660,658.19 - 660,658.19 546,350.54 - 546,350.54
自制半成品 8,514,453.22 - 8,514,453.22 2,090,339.01 - 2,090,339.01
发出商品 - - - 6,826,528.20 3,343,325.52 3,483,202.68
合计 663,365,535.46 15,138,843.29 648,226,692.17 442,443,381.93 11,939,167.99 430,504,213.94
（2） 存货跌价准备 
本年减少 项目 年初金额 本年增加 
转回 其他转出 
年末金额 
原材料 1,260,429.19 104,494.10 183,283.16 - 1,181,640.13
产成品 4,512,997.52 3,688,317.44 1,337,000.00 - 6,864,314.96
低值易耗品 6,165,741.28 927,146.92 - - 7,092,888.20
合计 11,939,167.99 4,719,958.46 1,520,283.16 - 15,138,843.29

深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

39 

（3） 存货跌价准备计提 
项目 计提依据 本年转回原因 本年转回金额占该项存货期末余额的比例 
原材料 库龄两年以上 使用 0.06%
产成品 售价低于成本 出售 0.43%
低值易耗品 库龄两年以上  
合计 0.49%
年末不存在已被抵押、冻结的存货。 
9. 其他流动资产 
项目 年末金额 年初金额 性质 
应收出口退税 21,648,672.88 9,948,068.25
预缴所得税 2,059,138.67 -
合计 23,707,811.55 9,948,068.25
10. 可供出售金融资产 
项目 年末金额 年初金额 
可供出售权益工具 392,558,850.25 -
合计 392,558,850.25 -
本公司本年购入的上市公司中国长城计算机深圳股份有限公司非公开发行股份公允
价值为 344,642,850.25 元， 股权限售期为 3 年。 
本公司以前年度持有中国光大银行股份有限公司股权，该公司本年上市，股权限售期
为 1 年。 
11. 持有至到期投资 
项目 年末金额 年初金额 
委托贷款 - 30,992,986.24
合计 - 30,992,986.24
持有至到期投资为本公司之子公司开发磁 2005-2006 年分四次通过中信银行深圳分
行向其联营企业深圳东红开发磁盘有限公司提供的委托贷款，该项贷款本金为 1,097 万美
元，截至 2007 年 12 月 31 日，开发磁累计就上述委托贷款确认利息 3,696,913.74 元。 

深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

40 

2008 年、2009 年开发磁聘请香港中和邦盟评估有限公司对该项委托贷款截止 2008 年
12 月 31 日以及 2009 年 12 月 31 日的公允价值进行评估。根据评估结果，2008 年末和 2009
年末公允价值分别为 1,767,631.53 美元和 4,537,772.51 美元，开发磁根据评估结果对各
期末减值准备进行了调整。截止 2009 年 12 月 31 日，该项委托贷款的账面净值为人民币
30,992,986.24 元。 
2010 年 12 月，该公司董事会决议对该公司进行清算。2010 年 12 月 30 日，该公司在
深圳商报公告进行清算。开发磁聘请香港中和邦盟评估有限公司对该项委托贷款截止2010
年 12 月 31 日的公允价值进行评估，香港中和邦盟评估有限公司经评估该项贷款公允价值
为 0 美元，开发磁据此计提 28,689,034.66 元的减值准备，截止 2010 年 12 月 31 日，该
项委托贷款已全额计提减值准备。 
12. 长期股权投资 
（1） 长期股权投资分类 
项目 年末金额 年初金额 
按成本法核算的长期股权投资 165,588,438.45 223,284,344.45
按权益法核算的长期股权投资 381,133,756.34 162,368,031.48
长期股权投资合计 546,722,194.79 385,652,375.93
减：长期股权投资减值准备 8,816,312.45 51,391,700.00
长期股权投资价值 537,905,882.34 334,260,675.93
（2） 按成本法、权益法核算的长期股权投资 
被投资单位名称 
持股 
比例 
（%） 
表决权比 
例（%） 投资成本 
年初 
金额 
本年 
增加 
本年 
减少 
年末 
金额 
本年 
现金 
红利 
成本法核算         
深圳粤银投资有限公司 15.00% 15.00% 4,500,000.00 4,192,300.00 - - 4,192,300.00 -
长城宽带网络服务有限公司 5.00% 5.00% 45,000,000.00 45,000,000.00 - 45,000,000.00 - -
深圳海量存储设备有限公司 10.00% 10.00% 49,524,356.80 49,524,356.80 - - 49,524,356.80 4,713,949.72
中国光大银行 0.15% 0.15% 21,450,000.00 21,450,000.00 - 21,450,000.00 - 493,986.72
山东云龙科技电子股份有限公司 13.16% 13.16% 5,000,000.00 5,000,000.00 - - 5,000,000.00 
湖南银洲股份有限公司 1.41% 1.41% 2,391,700.00 2,391,700.00 - - 2,391,700.00 
华旭金卡股份有限公司 18.11% 18.11% 12,507,063.85 6,319,447.65 - - 6,319,447.65 
鸿发中科技有限公司 10.00% 10.00% 13,824,720.00 12,362,220.00 - 415,584.00 11,946,636.00 
联萌科技股份有限公司 10.00% 10.00% 2,304,120.00 2,060,370.00 - 69,264.00 1,991,106.00 
ArchersInc. 2.64% 2.64% 3,439,371.00 3,433,950.00 - 115,440.00 3,318,510.00 
东方证券股份有限公司 0.30% 0.30% 71,550,000.00 71,550,000.00 - - 71,550,000.00 2,000,000.00
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

41 

捷荣模具工业（东莞）有限公司 19.82% 19.82% 9,354,382.00 9,354,382.00 - 9,354,382.00 
小计   240,845,713.65 223,284,344.45 9,354,382.00 67,050,288.00 165,588,438.45 7,207,936.44
权益法核算      
深圳长城科美技术有限公司 35.00% 35.00% 3,500,000.00 12,163,058.61 2,416,561.47 - 14,579,620.08 -
深圳市长城科美科技有限公司 35.00% 35.00% 35,000,000.00 34,985,231.00 - 7,406.95 34,977,824.05 -
O-Net Communications Ltd. 46.00% 46.00% 113,146,833.96 77,993,405.31 53,798,516.96 129,367,309.82 2,424,612.45 -
O-Net Communications (Group) 
Limited 27.32% 27.32% 129,367,309.82 - 336,036,277.97 45,585,968.34 290,450,309.63 -
Excelstor Group Ltc. 33.33% 33.33% 105,054,944.09 28,749,010.06 2,499,063.66 - 31,248,073.72 -
深圳东红开发磁盘有限公司 49.00% 49.00% 59,815,683.84 - - - - -
韩国通用科技公司 27.82% 27.82% 3,445,928.67 8,477,326.50 211,967.18 1,235,977.27 7,453,316.41 --
小计 —— —— 449,330,700.38 162,368,031.48 394,962,387.24 176,196,662.38 381,133,756.34 -
合计 —— —— 690,176,414.03 385,652,375.93 404,316,769.24 243,246,950.38 546,722,194.79 7,207,936.44
注 1、O-Net Communications (Group) Limited （昂纳光通信<集团>有限公司，以下简称
O-Net Group）为 O-Net Communications Ltd. （开发香港的联营企业，以下简称 O-Net Cayman）
于 2009 年 11 月设立的全资子公司。2010 年 1 月至 3 月经过一系列重组与置换，O-Net Cayman
将与光网络业务有关资产及业务转入 O-Net Group，与光网络业务无关的资产及业务由 O-Net 
Cayman 保留。之后 O-Net Cayman 董事会决定对 O-Net Group 的股权按原 O-Net Cayman 股东持
股比例进行实物分配，分配后原O-Net Cayman股东分别持有O-Net Group及分拆后O-Net Cayman
的股权。2010 年 4 月 O-Net Group 股份在全球发售，并于 2010 年 4 月 29 日在香港联合证券交
易所上市交易。本集团对原 O-Net Cayman 的长期股权投资进行了分拆。 
注 2、O-Net Cayman 本期减少数为因 O-Net Group 分拆上市而拆分的长期股权投资成本。 
注 3、O-Net Group 本期增加数为 O-Net Group 应分的投资成本及持有 O-Net Group 股份所
享有的净损益份额及其他所有者权益变动的份额；本期减少数为开发香港出售部分股份所转出
的投资成本。 
注 4、成本法核算的长期股权投资（鸿发中科技有限公司、联萌科技股份有限公司以及
ArchersInc.）的本年减少 600,288.00 元，为开发香港持有的长期股权投资进行外币报表折算
时因年初年末汇率变动所致。 
注 5、长城宽带网络服务有限公司（以下简称长城宽带）本年减少为将持有的股权转让所
致。 


深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

42 

（3） 对合营企业、联营企业投资 
被投资单位名称 持股 比例（%） 
表决权
比例（%） 
年末资 
产总额 
年末负 
债总额 
年末净资 
产总额 
本年营业 
收入总额 
本年 
净利润 
联营企业    
深圳长城科美技术有限公
司 35.00% 35.00% 93,131,373.86 51,488,113.66 41,643,260.20 90,697,886.18 6,904,461.34
深圳市长城科美科技有限
公司 35.00% 35.00% 99,910,672.79 24,000.00 99,886,672.79 - -21,162.71
O-Net Communications 
(Group) Limited 27.32% 27.32% 1,206,413,678.10 143,271,989.30 1,063,141,688.80 571,861,508.90 157,218,911.30
Excelstor Group Ltc. 33.33% 33.33% 135,131,332.50 41,378,088.19 93,753,244.31 677,842.57 9,613,521.55
深圳东红开发磁盘有限公
司 49.00% 49.00% 151,669,083.62 219,946,550.83 -68,277,467.21 110,236,368.93 -40,559,717.16
韩国通用科技公司 27.82% 27.82% 20,048,762.82 10,950,391.17 9,114,089.18 545,569.39 271,135.34
合计   1,706,304,903.69 467,059,133.15 1,239,261,488.07 774,019,175.97 133,427,149.66
（4） 长期股权投资减值准备 
被投资单位名称 年初金额 本年增加 本年减少 年末金额 计提原因 
湖南银洲股份有限公司 2,391,700.00 - - 2,391,700.00 
深圳粤银投资有限公司 4,000,000.00 - - 4,000,000.00 
长城宽带网络服务有限公司 45,000,000.00 - 45,000,000.00 - 
O-Net Communications Ltd. - 2,424,612.45 2,424,612.45 被投资单位注销 
合计 51,391,700.00 2,424,612.45 45,000,000.00 8,816,312.45 
（5） 本公司长期股权投资处置未受到重大限制。 
13. 投资性房地产 
项目 年初金额 本年增加 本年减少 年末金额 
原价 195,624,327.28 - 21,776,296.35 173,848,030.93
房屋、建筑物 195,624,327.28 - 21,776,296.35 173,848,030.93
累计折旧和累计摊销 40,037,148.29 9,437,243.49 10,710,438.59 38,763,953.19
房屋、建筑物 40,037,148.29 9,437,243.49 10,710,438.59 38,763,953.19
账面净值 155,587,178.99 - - 135,084,077.74
房屋、建筑物 155,587,178.99 - - 135,084,077.74
减值准备 - - - -
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

43 

项目 年初金额 本年增加 本年减少 年末金额 
房屋、建筑物 - - - -
账面价值 155,587,178.99 - - 135,084,077.74
房屋、建筑物 155,587,178.99 - - 135,084,077.74
本集团的投资性房地产以成本模式计量。 
本年减少为将出租房地产转为自用所致。 
14. 固定资产 
（1） 固定资产明细表 
项目 年初金额 本年增加 本年减少 年末金额 
原价 2,716,724,249.65 322,047,361.42 73,158,146.17 2,965,613,464.90
房屋建筑物 639,222,037.22 27,083,973.08 5,525,170.13 660,780,840.17
机器设备 694,264,715.82 18,046,569.82 35,962,889.89 676,348,395.75
电子设备及仪
器仪表 1,048,529,926.34 228,468,150.31 18,334,234.08 1,258,663,842.57
运输设备 15,810,080.92 1,919,227.07 710,242.45 17,019,065.54
其他设备 318,897,489.35 46,529,441.14 12,625,609.62 352,801,320.87
累计折旧 1,311,762,206.02 本年新增 本年计提 47,347,392.63 1,539,157,547.45
房屋建筑物 189,938,162.81 10,710,438.59 13,048,077.43 143,608.79 213,553,070.04
机器设备 410,327,208.42 - 55,843,127.27 24,300,682.86 441,869,652.83
电子设备及仪
器仪表 539,348,208.61 - 143,154,270.68 15,270,708.74 667,231,770.55
运输设备 10,054,855.04 - 2,013,483.37 633,619.57 11,434,718.84
其他设备 162,093,771.14 - 49,973,336.72 6,998,772.67 205,068,335.19
账面净值 1,404,962,043.63 - - 1,426,455,917.45
房屋建筑物 449,283,874.41 - - 447,227,770.13
机器设备 283,937,507.40 - - 234,478,742.92
电子设备及仪
器仪表 509,181,717.73 - - 591,432,072.02
运输设备 5,755,225.88 - - 5,584,346.70
其他设备 156,803,718.21 - - 147,732,985.68
减值准备 97,920,842.19 2,528,710.35 11,150,304.00 89,299,248.54
房屋建筑物 - - - -
机器设备 32,863,300.15 1,668,703.18 8,618,819.51 25,913,183.82
电子设备及仪
器仪表 60,281,715.12 135,977.39 2,488,603.73 57,929,088.78
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

44 

项目 年初金额 本年增加 本年减少 年末金额 
运输设备 10,944.00 485.00 1,600.00 9,829.00
其他设备 4,764,882.92 723,544.78 41,280.76 5,447,146.94
账面价值 1,307,041,201.44 - - 1,337,156,668.91
房屋建筑物 449,283,874.41 - - 447,227,770.13
机器设备 251,074,207.25 - - 208,565,559.10
电子设备及仪
器仪表 448,900,002.61 - - 533,502,983.24
运输设备 5,744,281.88 - - 5,574,517.70
其他设备 152,038,835.29 - - 142,285,838.74
1）本年增加的固定资产中，由在建工程转入的金额为 27,029,721.57 元。本年增加
的累计折旧中，本年计提 264,032,295.47 元。 
2）本集团本期对闲置的固定资产新增计提固定资产减值准备 2,528,710.35 元。  
3）年末固定资产中不存在抵押或担保情况。 
（2） 暂时闲置的固定资产 
项目 账面原值 累计折旧 减值准备 账面净值 备注 
机器设备 70,412,121.12 43,903,120.15 25,913,183.82 595,817.15 
运输工具 103,790.00 93,411.00 9,829.00 550.00 
电子设备仪器 215,494,077.77 150,834,433.50 55,768,309.38 8,891,334.89 
其他设备 43,558,044.00 37,559,770.00 5,447,146.94 551,127.06 
合计 329,568,032.89 232,390,734.65 87,138,469.14 10,038,829.10 
（3） 年末无融资租入的固定资产。 
（4） 年末无未办妥产权证书的固定资产。 
15. 在建工程  
（1） 在建工程明细表 
年末金额 年初金额 
项目 
账面余额 跌价 准备 账面价值 账面余额 
跌价 
准备 账面价值 
1.电镀线设备安装工程 - - - 23,900,917.77 - 23,900,917.77
2.电镀线配套工程 - - - 3,250,509.06 - 3,250,509.06
3.冷水机组设备工程 - - - 884,000.00 - 884,000.00
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

45 

年末金额 年初金额 
项目 
账面余额 跌价 准备 账面价值 账面余额 
跌价 
准备 账面价值 
4.热能设备工程 - - - 871,163.44 - 871,163.44
5.酸雾净化塔设备工程 - - - 269,000.00 - 269,000.00
6.水泵设备工程 - - - 101,120.00 - 101,120.00
7.冷却塔设备工程 - - - 80,400.00 - 80,400.00
8.电镀线改造工程 1,356,108.66 - 1,356,108.66 - - -
9.待安装设备 11,750,156.62 - 11,750,156.62 8,476,252.87 - 8,476,252.87
10.2号厂房3楼净化间装修 - - - 5,029,317.86 - 5,029,317.86
11.二期厂房基建 98,130,149.03 - 98,130,149.03 18,188,962.69 - 18,188,962.69
12.2期1号1层厂房工程 15,451,659.38 - 15,451,659.38 - - -
13.二期弱电工程设备采购 1,313,782.88 - 1,313,782.88 - - -
合计 128,001,856.57 - 128,001,856.57 61,051,643.69  61,051,643.69
（2） 重大在建工程项目变动情况 
本年减少 工程名称 年初金额 本年增加 
转入固定资产 其他减少 
年末金额 
1.电镀线设备安装工程 23,900,917.77 - - 23,900,917.77 -
2.电镀线配套工程 3,250,509.06 - - 3,250,509.06 -
3.冷水机组设备工程 884,000.00 - - 884,000.00 -
4.热能设备工程 871,163.44 - - 871,163.44 -
5.酸雾净化塔设备工程 269,000.00 - - 269,000.00 -
6.水泵设备工程 101,120.00 - - 101,120.00 -
7.冷却塔设备工程 80,400.00 - - 80,400.00 -
8、电镀线改造工程 - 27,122,173.15 - 25,766,064.49 1,356,108.66
9.待安装设备 8,476,252.87 25,274,307.46 22,000,403.71 - 11,750,156.62
10.2号厂房3楼净化间装修 5,029,317.86 - 5,029,317.86 - -
11.二期厂房基建 18,188,962.69 79,941,186.34 - - 98,130,149.03
12.2期1号1层厂房工程 - 15,451,659.38 - - 15,451,659.38
13.二期弱电工程设备采购 - 1,313,782.88 - - 1,313,782.88
合计 61,051,643.69 149,103,109.21 27,029,721.57 55,123,174.76 128,001,856.57



深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

46 


（续表） 
工程名称 预算数
工程投入
占预算比
例（%）
工程
进度
利息资本
化累计金
额 
其中：本年利息
资本化金额 
本年利息
资本化率
（%） 
资金来
源 
1.电镀线设备安装工程 45,541,916.21 93.90% - - - 自筹
2.电镀线配套工程 4,747,178.83 91.11% - - - 自筹
3.冷水机组设备工程 1,768,000.00 50.00% - - - 自筹
4.热能设备工程 1,414,000.00 61.61% - - - 自筹
5.酸雾净化塔设备工程 538,000.00 50.00% - - - 自筹
6.水泵设备工程 252,800.00 40.00% - - - 自筹
7.冷却塔设备工程 80,400.00 100.00% - - - 自筹
8、电镀线改造工程 - - - - - - 自筹
9.待安装设备 - - - - - 自筹
10.2号厂房3楼净化间装修 - - - - - 自筹
11.二期厂房基建 - - - - - 自筹
12.2期1号1层厂房工程 - - - - - 自筹
13.二期弱电工程设备采购 - - - - - 自筹
合计 54,342,295.04 - - - - 
上述 1 至 7 项在建工程主要为电镀线相关工程，该项工程为铝基片 2008 年投资建设，
由于市场前景不容乐观，一直未投入使用。本年公司管理层根据对未来市场的判断，将该
电镀线工程做报废处理，因此本年将其统一归类至第 8 项电镀线改造工程，共转入当期报
废损失 25,766,064.49 元。 
16. 无形资产 
项目 年初金额 本年增加 本年减少 年末金额 
原价 12,978,313.19 5,400.00 - 12,983,713.19
  土地使用权 12,978,313.19 - - 12,978,313.19
商标权 - 5,400.00 - 5,400.00
累计摊销 511,425.47 260,106.24 - 771,531.71
  土地使用权 511,425.47 259,566.24 - 770,991.71
商标权 - 540.00 - 540.00
账面净值 12,466,887.72 - - 12,212,181.48
  土地使用权 12,466,887.72 - - 12,207,321.48
商标权 - - - 4,860.00
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

47 

项目 年初金额 本年增加 本年减少 年末金额 
减值准备 - - - -
  土地使用权 - - - -
商标权 - - - -
账面价值 12,466,887.72 - - 12,212,181.48
  土地使用权 12,466,887.72 - - 12,207,321.48
商标权 - - - 4,860.00
本年增加的累计摊销中，本年摊销 260,106.24 元。 
17. 长期待摊费用 
项目 年初金额 本年增加 本年摊销 本年其他减少 年末金额 
其他减
少原因 
A栋装修工程 12,019,087.19 - 9,120,000.00 - 2,899,087.19 
B栋装修工程 21,150,510.54 - 7,800,000.00 - 13,350,510.54 
租入6号楼厂房装修 - 1,308,205.12 116,804.05 - 1,191,401.07 
租入厂房装修费 - 359,071.00 11,370.60 - 347,700.40 
合计 33,169,597.73 1,667,276.12 17,048,174.65 - 17,788,699.20 
18. 递延所得税资产和递延所得税负债 
（1） 已确认的递延所得税资产和递延所得税负债 
项目 年末金额 年初金额 
递延所得税资产 
计提资产减值准备产生的递延所得税资产 41,709,662.43 44,750,414.99
预提费用产生的递延所得税资产 3,313,897.55 4,727,774.47
抵消未实现内部销售损益产生的递延所得税资产 2,830,096.87 518,377.33
开办费产生的递延所得税资产 163,382.29 299,534.20
房屋装修费产生的递延所得税资产 37,496.71 213,376.00
可弥补亏损产生的递延所得税资产 - 19,792.64
固定资产残值差异产生的递延所得税资产 1,798.80 2,659.11
合计 48,056,334.65 50,531,928.74
递延所得税负债 
可供出售金融资产公允价值变动 31,666,328.02 -
收购少数股权产生的递延所得税负债 1,469,307.74 1,469,307.74
交易性金融资产公允价值变动产生的递延所得税负债 - 21,739.84
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

48 

项目 年末金额 年初金额 
未实现的内部销售亏损 1,282,208.26 -
合计 34,417,844.02 1,491,047.58
（2） 未确认递延所得税资产明细 
项目 年末金额 年初金额 
可抵扣亏损 66,401,450.34 -
合计 66,401,450.34 -
未确认递延所得税资产主要为开发磁及铝基片本年经营亏损，因无法预计未来是否有
足够的纳税所得抵扣，因此未予确认递延所得税资产。 
（3） 应纳税差异和可抵扣差异项目明细 
项目 暂时性差异金额 
应纳税差异项目 
可供出售金融资产公允价值变动 211,108,853.45
收购少数股权产生的资本溢价 8,904,895.39
未实现内部销售亏损 5,342,534.41
小计 225,356,283.25
可抵扣差异项目 
资产减值准备 219,288,024.48
预提费用 22,092,650.34
其中：预提产品保修费用 18,158,712.78
预提保函费 3,933,937.56
未实现内部销售损益  12,309,643.04
开办费 1,361,519.12
房屋装修费 312,472.55
固定资产残值差异  10,901.82
合计 255,375,211.35
19. 资产减值准备明细表 
本年减少 
项目 年初金额 本年增加 
转回 其他 转出 
年末金额 
坏账准备 146,598,093.57 16,511,421.83 30,726,104.03 1,506,304.00 130,877,107.37
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

49 

本年减少 
项目 年初金额 本年增加 
转回 其他 转出 
年末金额 
存货跌价准备 11,939,167.99 4,719,958.46 1,520,283.16 - 15,138,843.29
持有至到期投资减值准备 47,637,209.84 28,689,034.66 - - 76,326,244.50
长期股权投资减值准备 51,391,700.00 2,424,612.45 - 45,000,000.00 8,816,312.45
固定资产减值准备 97,920,842.19 2,528,710.35 - 11,150,304.00 89,299,248.54
合计 355,487,013.59 54,873,737.75 32,246,387.19 57,656,608.00 320,457,756.15
20. 短期借款 
借款类别 年末金额 年初金额 
质押借款 309,808,232.00 218,560,000.00
信用借款 441,343,104.73 221,365,596.48
合计 751,151,336.73 439,925,596.48
本集团的质押借款为海外代付业务借款。海外代付业务是指在借款人向贷款银行提交
了符合外管政策的贸易项下的全套单据后，贷款银行根据借款人申请，在借款人承担有关
代付费用的条件下，由指定的代付行按贷款银行的指示即期对外付款的融资业务。 
21. 应付账款 
（1） 应付账款 
项目 年末金额 年初金额 
合计 1,104,968,652.25 770,014,247.45
其中：1年以上 17,829,667.14 20,830,197.11
注：账龄超过 1 年的大额应付账款未偿还或未结转的原因为尚未收到供应商的结算单
证而未进行结算。 
（2） 年末应付账款中不含持有本集团 5%（含 5%）以上表决权股份股东单位的款项  
（3） 应付账款中外币余额 
年末金额 年初金额 
外币名称 
原币 折算 汇率 折合人民币 原币 
折算 
汇率 折合人民币 
美元 92,168,160.98 6.6227 610,402,079.72 77,683,673.01 6.8282 530,439,656.05
欧元 53,316.00 8.8065 469,527.35 100,587.50 9.7971 985,465.80
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

50 

日元 289,475,694.00 0.0813 23,534,373.92 259,588,743.22 0.0738 19,157,649.25
港元 35,251,600.75 0.8509 29,995,587.08 129,983,459.40 0.8805 114,450,436.00
新加坡元 58,298.14 5.1191 298,434.01 76,291.67 4.8605 370,815.66
合计 - - 664,700,002.08 - - 665,404,022.76
22. 预收款项 
（1） 预收款项 
项目 年末金额 年初金额 
合计 15,925,918.70 1,991,750.99
其中：1年以上 1,877,641.65 516,095.27
（2）年末预收款项中不含预收持本集团 5%（含 5%）以上表决权股份的股东单位款项。 
（3）预收款项中外币余额 
年末金额 年初金额 外币名称 
原币 折算汇率 折合人民币 原币 折算汇率 折合人民币 
美元 423,805.14 6.6227 2,806,734.30 212,042.08 6.8282 1,447,865.73
欧元 1,214.25 8.8065 10,693.29 - - -
港币 2,220.00 0.8509 1,889.00 - - -
合计 - - 2,819,316.59 - - 1,447,865.73
23. 应付职工薪酬 
项目 年初金额 本年增加 本年减少 年末金额 
工资、奖金、津贴和补贴 45,943,151.42 585,691,844.08 561,463,922.03 70,171,073.47
职工福利费 - 59,637,900.25 59,637,900.25 -
社会保险费 4,476,697.31 58,632,446.02 62,620,535.19 488,608.14
其中：医疗保险费 67,653.48 8,130,355.09 8,074,600.85 123,407.72
基本养老保险费 151,576.55 40,469,805.39 40,375,475.49 245,906.45
失业保险费 21,873.05 1,792,776.93 1,773,514.20 41,135.78
工伤保险费 21,925.96 886,303.86 867,094.04 41,135.78
生育保险费 19,718.27 1,307,534.75 1,290,230.61 37,022.41
其他 4,193,950.00 6,045,670.00 10,239,620.00 -
住房公积金 859,220.46 15,296,932.92 14,529,643.99 1,626,509.39
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

51 

项目 年初金额 本年增加 本年减少 年末金额 
工会经费和职工教育经费 1,491,221.63 9,165,447.16 7,658,451.92 2,998,216.87
非货币性福利 - 6,133,495.41 6,133,495.41 -
其他 - 79,965.00 79,965.00 -
其中:以现金结算的股份支付 - - - -
合计 52,770,290.82 734,638,030.84 712,123,913.79 75,284,407.87
本集团应付职工薪酬年末金额中有提取未发放的工资、奖金、补贴等 70,171,073.47
元，预计 2011 年 1 月发放 66,704,753.75 元、2 月发放 1,898,415.99 元、6 月发放 
1,567,903.73 元。 
24. 应交税费  
项目 年末金额 年初金额 
增值税 9,304,094.96 5,251,948.14
营业税 264,277.58 314,701.06
企业所得税 70,333,192.43 66,784,214.86
个人所得税 805,823.21 532,783.24
城市维护建设税 978,281.15 62,131.92
房产税 1,386,649.92 1,386,649.92
教育费附加 927,089.12 2,758.91
其他 14,184,970.03 664,551.61
合计 98,184,378.40 74,999,739.66
25. 应付利息 
项目 年末金额 年初金额 
短期借款应付利息 4,867,924.33 105,338.88
合计 4,867,924.33 105,338.88
26. 其他应付款 
（1） 其他应付款 
项目 年末金额 年初金额 
合计 85,243,530.85 116,636,740.79
其中：1年以上 62,554,194.47 38,932,397.10
注：账龄超过 1 年的大额其他应付款主要为收取的资金往来、技术服务保证金等。 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

52 

（2） 年末其他应付款中不含应付持有本集团 5%（含 5%）以上表决权股份的股东单位
款项 。 
（3） 年末大额其他应付款 
项目 金额 账龄 性质或内容 
深圳市长城科美科技有限公司 34,650,000.00 1-2年 资金往来 
3,466,170.08 3年以上 
中国机械设备进出口公司 
   2,872,568.55 1年以内 
应付研发费 
北京凯腾贸易有限公司 6,007,654.47 2-3年 预收技术服务保证金 
厂房技改 2,721,831.00 1年以内 厂房改造费 
1,115,463.25 1年以内 
14,400.00 1-2年 
679,986.00 2-3年 
沛顿科技（深圳）有限公司 
339,150.00 3年以上 
房租押金 
合计 51,867,223.35 - -
（4） 其他应付款中外币余额 
年末金额 年初金额 外币名称 
原币 折算汇率 折合人民币 原币 折算汇率 折合人民币 
美元 2,964,184.07 6.6227 19,630,901.84 84,647.78 6.8282 577,991.97
欧元 517,000.00 8.8065 4,552,960.50 517,000.00 9.7971 5,065,100.70
港币 16,841,188.79 0.8509 14,330,167.54 39,694,581.00 0.8805 34,951,078.57
合计 - - 38,514,029.88 - - 40,594,171.24
27. 预计负债 
项目 年初金额 本年增加 本年结转 年末金额 
保修费 17,555,946.38 5,359,960.87   4,757,194.47 18,158,712.78
合计 17,555,946.38 5,359,960.87 4,757,194.47 18,158,712.78
28. 股本 
年初金额 本年变动 年末金额 
 股东类别 
金额 比例（%） 发行新股 送股 公积金转股 其他 小计 金额 比例（%）
有限售条件股份     
国家持有股     
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

53 

年初金额 本年变动 年末金额 
 股东类别 
金额 比例（%） 发行新股 送股 公积金转股 其他 小计 金额 比例（%）
国有法人持股     
其他内资持股     
其中：境内法人持股     
境内自然人持股     
外资持股     
其中：境外法人持股     
      境外自然人持股     
高管股份 922,084 0.10% 184,417 276,625 461,042 1,383,126 0.10%
有限售条件股份合计 922,084 0.10% 184,417 276,625 461,042 1,383,126 0.10%
无限售条件股份     
人民币普通股 878,596,437 99.90% 175,719,287 263,578,931 439,298,218 1,317,894,655 99.90%
境内上市外资股     
境外上市外资股     
其他     
无限售条件股份合计 878,596,437 99.90% 175,719,287 263,578,931 439,298,218 1,317,894,655 99.90%
股份总额 879,518,521 100.00% 175,903,704 263,855,556 439,759,260 1,319,277,781 100.00%
根据本公司 2010 年 5 月 14 日召开的 2009 年度股东大会决议，以本公司现有总股
本 879,518,521 股为基数， 向全体股东每 10 股送红股 2 股，派 2 元人民币现金；同时，
以资本公积金向全体股东每 10 股转增 3 股，转增基准日为 2010 年 6 月 10 日，变更后
注册资本为人民币 1,319,277,781.00 元。 
本次变更经深圳市鹏城会计师事务所有限公司审验,并出具了深鹏所验字【2010】243 
号验资报告。 
截止 2010 年 12 月 31 日止，本公司已将资本公积 263,855,556.00 元、未分配利润
175,903,704.00 元，合计 439,759,260.00 元转增股本。 
29. 资本公积 
项目 年初金额 本年增加 本年减少 年末金额 
股本溢价 457,865,215.36 - 263,855,556.00 194,009,659.36
其他资本公积 8,063,769.64 434,048,952.43 62,614,522.89 379,498,199.18
其中：(1)被投资单位其他权益变动 8,063,769.64 222,940,098.98 30,948,194.87 200,055,673.75
(2)可供出售金融资产公允价值变动 - 211,108,853.45 31,666,328.02 179,442,525.43
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

54 

合计 465,928,985.00 434,048,952.43 326,470,078.89 573,507,858.54
如附注八、28 所述，股本溢价的减少为本公司以公积金转增股本 263,855,556.00 元。 
其他资本公积中被投资单位其他权益变动中本年增加为本公司之联营公司 O-Net 
Group 在 2010 年香港联合交易所主板上市形成的资本溢价；本年减少为本公司之子公司
开发香港出售持有 O-Net Group 股份结转原计入资本公积的金额。 
其他资本公积中可供出售金融资产公允价值变动中本年增加为本公司参股公司中国
长城计算机深圳股份有限公司和中国光大银行股份有限公司因上市形成的年末公允价值
变动；本年减少为确认的递延所得税负债。 
30. 盈余公积 
项目 年初金额 本年增加 本年减少 年末金额 
法定盈余公积 562,268,165.71 - - 562,268,165.71
任意盈余公积 422,860,145.68 - - 422,860,145.68
合计 985,128,311.39 - - 985,128,311.39
31. 未分配利润  
项目 金额 提取或分配比例（%） 
上年年末金额 1,289,075,572.42
加：年初未分配利润调整数 -
其中：会计政策变更 -
本年年初金额 1,289,075,572.42
加：本年归属于母公司股东的净利润 384,257,878.66
减：提取法定盈余公积 -
提取任意盈余公积 -
提取一般风险准备 -
应付普通股股利 175,903,704.20
转作股本的普通股股利 175,903,704.00
本年年末金额 1,321,526,042.88
如附注八、28 所述，根据本公司 2010 年 5 月 14 日召开的 2009 年度股东大会决议，
以本公司 2009 年末总股本 879,518,521 股为基数， 向全体股东每 10 股送红股 2 股，
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

55 

派 2 元人民币现金。共计派送 175,903,704.00 股，派发现金股利 175,903,704.20 元。 
32. 少数股东权益 
子公司名称 少数股权比例（%） 年末金额 年初金额 
开发磁 43% 294,312,583.38 321,309,901.99
开发技研 45% 986,566.96 596,072.97
合计 295,299,150.34 321,905,974.96
33. 营业收入、营业成本 
项目 本年金额 上年金额 
主营业务收入 20,717,278,115.82 13,353,968,184.28
其他业务收入 54,262,922.35 51,344,673.15
合计 20,771,541,038.17 13,405,312,857.43
主营业务成本 20,228,208,542.27 12,880,152,058.00
其他业务成本 37,230,883.72 34,871,191.21
合计 20,265,439,425.99 12,915,023,249.21
（1） 主营业务—按行业分类 
本年金额 上年金额 行业名称 
营业收入 营业成本 营业收入 营业成本 
电子产品制造 20,717,278,115.82 20,228,208,542.27 13,353,968,184.28 12,880,152,058.00
合计 20,717,278,115.82 20,228,208,542.27 13,353,968,184.28 12,880,152,058.00
（2） 主营业务—按产品分类 
本年金额 上年金额 产品名称 
营业收入 营业成本 营业收入 营业成本 
硬盘相关产品 8,806,187,964.78 8,666,518,176.91 7,391,751,879.97 7,128,206,165.98
自有产品 418,572,625.09 323,766,408.73 286,448,158.76 218,004,535.97
OEM产品 11,492,517,525.95 11,237,923,956.63 5,675,768,145.55 5,533,941,356.05
合计 20,717,278,115.82 20,228,208,542.27 13,353,968,184.28 12,880,152,058.00


深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

56 

（3） 主营业务—按地区分类 
本年金额 上年金额 地区名称 
营业收入 营业成本 营业收入 营业成本 
中国（含香港） 602,166,526.09 465,707,393.67 524,280,533.47 446,132,266.18
亚太地区（除中国外） 9,284,896,556.18 9,028,368,371.72 7,419,226,546.83 7,104,173,705.42
北美洲 10,792,497,116.63 10,704,574,209.63 5,390,632,877.33 5,315,469,622.08
其他地区 37,717,916.92 29,558,567.25 19,828,226.65 14,376,464.32
合计 20,717,278,115.82 20,228,208,542.27 13,353,968,184.28 12,880,152,058.00
（4） 前五名客户的营业收入情况 
客户名称 营业收入 占全部营业收入的比例（%） 
Kingston Technology International Ltd. 10,731,149,075.70 51.66%
Seagate Singapore IHQ P.L. 7,477,010,672.38 36.00%
SEAGATE-(SEGARMO) 394,347,560.13 1.90%
Hitachi Global Storage Technologies 342,092,394.41 1.65%
WD Media (Malaysia) Sdn.Bhd 336,042,051.64 1.62%
合计 19,280,641,754.26 92.83%
34. 营业税金及附加 
项目 本年金额 上年金额 计缴标准 
营业税 2,684,389.24 2,683,234.15 5% 
城市维护建设税 1,068,492.51 306,004.91 7%、1% 
教育费附加 962,960.19 7,177.24 3% 
堤围防护费 323,500.62 183,845.75 1亿以下0.01%，1亿以上0.008% 
房产税 2,067,119.22 2,325,520.55 1.20% 
合计 7,106,461.78 5,505,782.60  
35. 销售费用 
项目 本年金额 上年金额 
运输费 19,585,305.53 28,120,402.37
工资 16,446,413.02 17,955,245.24
福利费用 3,950,636.46 2,565,360.41
技术维护费 2,179,246.71 2,690,857.87
差旅费 1,588,092.37 1,503,778.50
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

57 

项目 本年金额 上年金额 
广告费 994,058.97 1,005,529.21
中介费 894,764.71 408,009.08
报关费 769,283.01 562,082.77
物料费 562,234.55 180,665.51
招待费 455,699.15 384,542.44
折旧费 143,873.98 195,632.24
其他 3,440,054.43 2,272,565.19
合计 51,009,662.89 57,844,670.83
36. 管理费用 
项目 本年金额 上年金额 
工资 69,275,929.20 60,407,528.29
研究与开发费用 49,973,995.50 25,537,659.59
福利费用 19,138,432.21 17,047,187.67
修理费 12,107,455.96 8,277,985.90
税金 11,760,039.96 8,644,081.62
租赁费 10,648,666.59 2,424,442.99
水电费 7,641,226.37 5,820,478.09
物料费 5,625,486.49 3,441,232.56
差旅费 5,199,666.25 3,985,185.57
折旧费 4,793,168.38 30,679,696.89
年金 4,456,704.22 4,183,549.05
保安费 3,890,970.86 3,414,993.00
中介机构费 2,721,005.67 2,994,802.83
清洁费 2,547,807.29 2,010,717.00
技术服务费 2,379,054.22 2,529,215.66
职工培训费 2,214,631.10 1,226,222.24
办公费 2,167,609.19 1,784,547.40
业务招待费 1,461,269.67 1,275,738.88
保险费 1,102,847.68 750,753.25
董事会费 682,856.80 729,523.80
其他 19,931,000.01 9,362,358.35
合计 239,719,823.62 196,527,900.63

深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

58 

37. 财务费用 
项目 本年金额 上年金额 
利息支出 16,171,387.54 3,636,622.43
减：利息收入 44,298,400.68 38,740,189.37
加：汇兑损失 6,787,276.27 2,760,915.99
加：银行手续费 1,626,987.31 -
加：其他支出 26,868.23 994,489.29
合计 -19,685,881.33 -31,348,161.66
38. 资产减值损失 
项目 本年金额 上年金额 
坏账损失 -14,214,682.20 -16,045,549.22
存货跌价损失 3,199,675.30 3,636,767.51
持有至到期投资减值损失 28,689,034.66 -18,920,062.89
长期股权投资减值损失 2,466,784.58 -
固定资产减值损失 2,528,710.35 2,738,404.72
合计 22,669,522.69 -28,590,439.88
39. 公允价值变动收益 
项目 本年金额 上年金额 
交易性金融资产 -98,817.46 98,817.46
合计 -98,817.46 98,817.46
40. 投资收益 
（1） 投资收益来源 
项目 本年金额 上年金额 
成本法核算的长期股权投资收益 7,207,936.44 11,015,597.64
权益法核算的长期股权投资收益 63,031,567.92 3,720,554.73
处置长期股权投资产生的投资收益 141,832,232.46
处置交易性金融资产取得的投资收益 267,814.09 357,099.04
合计 212,339,550.91 15,093,251.41
注：投资收益汇回的不存在重大限制。 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

59 

2011 年 5月、11 月开发香港分别以每股 2.9 港币和 5.5 港币转让持有的 O-Net Group 
13,759,183 股和 25,293,000 股，两次转让收益共计 137,616,684.46 元。 
2011 年 8 月，本公司以 4,226,000.00 元出售长城宽带 5%股权，转让收益共计
4,215,548.00 元。 
（2） 成本法核算的长期股权投资收益  
项目 本年金额 上年金额 本年比上年增减变动的原因 
合计 7,207,936.44 11,015,597.64  
其中：   
深圳海量存储设备有限公司 4,713,949.72 10,088,510.70 被投资单位分红 
东方证券股份有限公司 2,000,000.00 - 被投资单位分红 
中国光大银行 493,986.72 927,086.94 被投资单位分红 
（3） 权益法核算的长期股权投资收益  
项目 本年金额 上年金额 本年比上年增减变动的原因 
合计 63,031,567.92 3,720,554.73  
其中：  
O-Net Communications Ltd. 28,434,705.47 32,914,061.53 注1 
O-Net Communications (Group) 
Limited 30,219,498.47 - 注1 
Excelstor Group Limited 3,204,186.73 -29,925,083.44 被投资单位利润增加 
深圳长城科美技术有限公司 2,416,561.47 4,976,851.56 被投资单位利润减少 
深圳市长城科美科技有限公司 -7,406.95 -14,769.00 被投资单位利润增加 
韩国通用科技公司 -1,235,977.27 -3,819,475.09 长期股权投资差额摊销 
深圳东红开发磁盘有限公司 - -411,030.83 长期股权投资账面价值减记为零 
注 1、如附注八、12、（2）所述， O-Net Group 为由 O-Net Cayman 分拆而来并于
2010年4月29日在香港联合证券交易所上市交易的公司。本年权益法核算的O-Net Cayman
为分拆前 2010 年 1-4 月的净利润，权益法核算的 O-Net Group 为 2010 年 5-12 月的净利
润。 
41. 营业外收入 
（1） 营业外收入明细 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

60 

项目 本年金额 上年金额 计入本年非经常性损益的金额 
非流动资产处置利得 75,021.04 1,314,889.74 75,021.04
其中：固定资产处置利得 75,021.04 1,314,889.74 75,021.04
政府补助 9,891,326.76 4,718,214.04 9,891,326.76
其他 68,791.18 37,165.55 68,791.18
合计 10,035,138.98 6,070,269.33 10,035,138.98

（2） 政府补助明细 
项目 本年金额 上年金额 来源和依据 
一般贸易征退差补助 478,300.00 -
2009年上半年机电产品及高新
技术产品第二批获支持企业名
单 
财政委特色工业园规划补贴 2,600,000.00 -
关于下达2008 年认定的特色
工业园区第二批资金资助计划
的通知 
福田区总商会发展资助 250,000.00 - 收据 
深圳市节约用水办公室节水奖励 230,000.00 - 深圳市节约用水办公室通知 
财政局外贸稳定增长专项资金 1,000,000.00 -
中央保持外贸稳定增长专项资
金建设建设境外营销网络支持
计划公示 
来深建设者职业技能补贴 493,000.00 - 深圳市来深建设者职业技能培训补贴明细表 
深圳市市场监督管理局专利补贴及软件著作权补
贴 14,800.00 -
关于公布深圳市2010 年第一
批专利申请资助周转金拨款的
通知 
深圳市市场监督管理局专利补贴及软件著作权补
贴 2,400.00 -
关于公布深圳市2010 年第一
批计算机软件著作权登记资助
拨款项目的通知 
市福田贸工局经济发展资金扶持项目 1,830,200.00 - 福田区经济发展资金拟扶持项目公示通告 
2009年知识产权优势企业经费补贴 200,000.00 - 深圳市市场监督管理局文件深市监促字（2010）60号 
福田区城市管理局2009 年度行业卫生标兵单位
奖金 5,000.00 -
深圳市爱国卫生运动委员会文
件深爱卫（2010）9号 
福田区劳动局关爱外来建设者系列活动补贴 20,000.00 - 中国共产党深圳市福田区委员会（通报）福委（2010）12号
机电产品及高新技术产品出口资助金 1,179,189.00 - 09年下半年机电产品及高新技术产品资助申请书 
建设境外营销网络支持专项资金 500,000.00 - 建设境外营销网络支持计划（第二批）公示 
进口产品贴息资金 18,437.76 - 银行收款凭证 
财政局市级研发中心建设资助资金 - 3,000,000.00 深圳市财政局 
财政局特色工业园扶助费 - 480,000.00 深圳市财政局 
科技局科技发展资金资助款 - 6,000.00 福田区总商会 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

61 

项目 本年金额 上年金额 来源和依据 
一般贸易征退差补助 - 810,935.00 深圳市财政局 
福田区总商会资助款 - 300,000.00 福田区总商会 
福田总商会清洁生产企业奖励款 - 50,000.00 福田区总商会 
扶持循环经济资金 700,000.00 - 福田区总商会 
关爱新生代外来建设者系列活动补贴 20,000.00 - 福田区劳动局，福办发【2010】28号 
省清洁生产企业奖励奖金 50,000.00 - 深圳财政局 
保增长、保就业奖励 - 20,923.00 关于拨付09年保增长、保就业奖励的通知 
园区节能项目补贴 300,000.00 -
苏园管[2008]15号《苏州工业
园区节能专项资金管理暂行办
法》 
雇佣补助 - 50,356.04 新加坡政府 
合计 9,891,326.76 4,718,214.04
42. 营业外支出 
项目 本年金额 上年金额 计入本年非经常性损益的金额 
非流动资产处置损失 848,714.73 946,533.81 848,714.73
其中：固定资产处置损失 848,714.73 946,533.81 848,714.73
资产报废、毁损损失 25,766,064.49 - 25,766,064.49
对外捐赠 1,040,000.00 19,517.53 1,040,000.00
其他 181,741.96 255,630.30 181,741.96
合计 27,836,521.18 1,221,681.64 27,836,521.18
43. 所得税费用 
（1） 所得税费用 
项目 本年金额 上年金额 
当年所得税费用 39,643,491.24   38,993,724.28
递延所得税费用 3,736,062.51 5,460,268.65  
合计 43,379,553.75 44,453,992.93
（2） 当年所得税 
项目 金额 
本年合并利润总额 399,721,373.78
加：纳税调整增加额 86,983,304.04
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

62 

项目 金额 
减：纳税调整减少额 278,543,867.69
  加：境外应税所得弥补境内亏损 -
  减：弥补以前年度亏损 675,393.39
加：子公司本年亏损额 66,401,450.34
本年应纳税所得额 273,886,867.08
法定所得税税率 25%、22%、11%、16.5%
本年应纳所得税额 44,778,267.51
减：减免所得税额 4,426,022.78
减：抵免所得税额 -
本年应纳税额 40,352,244.73
加：境外所得应纳所得税额 -
减：境外所得抵免所得税额 -
加：其他调整因素 -708,753.49
当年所得税 39,643,491.24
44. 基本每股收益和稀释每股收益的计算过程 
项目 序号 本年金额 上年金额 
归属于母公司股东的净利润 1 384,257,878.66 258,619,909.73
归属于母公司的非经常性损益 2 93,521,094.73 12,889,707.06
归属于母公司股东、扣除非经常性损益后
的净利润 3=1-2 290,736,783.93 245,730,202.67
年初股份总数 4 879,518,521 879,518,521
公积金转增股本或股票股利分配等增加股
份数（Ⅰ） 5 439,759,260 439,759,260
发行新股或债转股等增加股份数（Ⅱ） 6 - -
增加股份（Ⅱ）下一月份起至年末的累计
月数 7 - -
因回购等减少股份数 8 - -
减少股份下一月份起至年末的累计月数 9 - -
缩股减少股份数 10 - -
报告期月份数 11 12 12
发行在外的普通股加权平均数 12=4+5+6×7÷11 
-8×9÷11-10 
1,319,277,781 1,319,277,781
基本每股收益（Ⅰ） 13=1÷12 0.2913 0.1960
基本每股收益（Ⅱ） 14=3÷12 0.2204 0.1863
已确认为费用的稀释性潜在普通股利息 15 - -
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

63 

项目 序号 本年金额 上年金额 
转换费用 16 - -
所得税率 17 - -
认股权证、期权行权、可转换债券等增加
的普通股加权平均数 18 - -
稀释每股收益（Ⅰ） 19=[1+(15-16)×(1-17)]÷(12+18) 0.2913 0.1960
稀释每股收益（Ⅱ） 19=[3+(15-16)×(1-17)]÷(12+18) 0.2204 0.1863
45. 其他综合收益 
项目 本年金额 上年金额 
1．可供出售金融资产产生的利得（损失）金额 211,108,853.45 -
减：可供出售金融资产产生的所得税影响 31,666,328.02 -
前期计入其他综合收益当期转入损益的净额 - -
小计 179,442,525.43 -
2．按照权益法核算的在被投资单位其他综合收益中所享有
的份额 222,940,098.98 -
减：按照权益法核算的在被投资单位其他综合收益中所享
有的份额产生的所得税影响 - -
前期计入其他综合收益当期转入损益的净额 30,948,194.87 -
小计 191,991,904.11 -
3．现金流量套期工具产生的利得（损失）金额 - -
减：现金流量套期工具产生的所得税影响 - -
前期计入其他综合收益当期转入损益的净额 - -
转为被套期项目初始确认金额的调整额 - -
小计 - -
4．外币财务报表折算差额 -28,366,011.58 -4,861,886.08
减：处置境外经营当期转入损益的净额  
小计 -28,366,011.58 -4,861,886.08
5．其他  
减：由其他计入其他综合收益产生的所得税影响  
前期其他计入其他综合收益当期转入损益的净额  
小计  
合计 343,068,417.96 -4,861,886.08
46. 现金流量表项目 
（1） 收到/支付的其他与经营/投资/筹资活动有关的现金 
1） 收到的其他与经营活动有关的现金 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

64 

项目 本年金额 
资金往来 42,966,923.63
利息收入 35,085,777.41
政府补助收入 9,891,326.76
2009年保函保证金解除受限 3,098,952.06
其他暂收、预付退回款 2,289,887.03
水电费增值税退款 2,274,257.91
废料收购交增值税关税补偿金 772,553.38
合计 96,379,678.18
2） 支付的其他与经营活动有关的现金 
项目 本年金额 
研究与开发费用 49,973,995.50
保函保证金 25,467,243.54
运杂费 22,321,087.15
往来款 20,300,659.57
修理费 12,107,455.96
租金支出 10,648,666.59
水电空调费 7,666,490.66
差旅费 6,787,758.62
物料费 6,187,721.04
班车费 5,604,530.00
技术服务费 4,558,300.93
保安费 3,890,970.86
中介服务费 3,615,770.38
清洁费 2,547,807.29
办公费 2,167,609.19
招待费 1,916,968.82
银行手续费 1,653,855.54
保险费 1,102,847.68
广告费 994,058.97
董事会会费 682,856.80
开办费 551,604.74
其他  14,776,765.24
合计 205,525,025.07
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

65 

3） 收到的其他与筹资活动有关的现金 
项目 本年金额 
海外代付借款保证金利息收入 5,070,922.73
合计 5,070,922.73
4） 支付的其他与筹资活动有关的现金 
项目 本年金额 
海外代付借款保证金 95,314,267.54
合计 95,314,267.54
（2） 合并现金流量表补充资料 
项目 本年金额 上年金额 
1.将净利润调节为经营活动现金流量： 
净利润 356,341,820.03 265,936,519.33
加：资产减值准备 22,669,522.69 -28,590,439.88
    固定资产折旧、油气资产折耗、生产性生物资产折旧 273,469,538.96 227,774,523.85
    无形资产摊销 260,106.24 259,566.24
    长期待摊费用摊销 17,048,174.65 17,440,000.00
处置固定资产、无形资产和其他长期资产的损失（收益以“-”填
列） 25,826,322.85 -1,313,101.75
    固定资产报废损失（收益以“-”填列） 713,435.33 944,745.82
    公允价值变动损益（收益以“-”填列） 98,817.46 -98,817.46
    财务费用（收益以“-”填列） 22,958,663.81 2,760,916.00
    投资损失（收益以“-”填列） -212,339,550.91 -15,093,251.41
    递延所得税资产的减少（增加以“-”填列） 2,475,594.09 5,439,973.88
    递延所得税负债的增加（减少以“-”填列） 1,260,468.42 21,739.84
    存货的减少（增加以“-”填列） -220,922,153.53 42,340,592.81
    经营性应收项目的减少（增加以“-”填列） -460,046,149.21 -93,511,432.46
    经营性应付项目的增加（减少以“-”填列） 284,619,360.26 69,379,913.50
    其他 
    经营活动产生的现金流量净额 114,433,971.14 493,691,448.31
2.不涉及现金收支的重大投资和筹资活动： -
    债务转为资本 -
    一年内到期的可转换公司债券 -
    融资租入固定资产 -
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

66 

项目 本年金额 上年金额 
3.现金及现金等价物净变动情况： -
    现金的期末余额 1,439,982,060.80 1,644,346,846.30
减：现金的期初余额 1,644,346,846.30 1,472,922,407.21
    加：现金等价物的期末余额 - -
    减：现金等价物的期初余额 - -
现金及现金等价物净增加额 -204,364,785.50 171,424,439.09
（3） 现金和现金等价物 
项目 本年金额 上年金额 
现金 1,439,982,060.80 1,644,346,846.30
其中：库存现金 1,206,322.18 1,702,120.00
      可随时用于支付的银行存款 1,438,775,738.62 1,620,903,535.20
      可随时用于支付的其他货币资金 - 21,741,191.10
      可用于支付的存放中央银行款项 - -
      存放同业款项 - -
      拆放同业款项 - -
现金等价物 - -
其中：三个月内到期的债券投资 - -
期末现金和现金等价物余额 1,439,982,060.80 1,644,346,846.30
其中：母公司或集团内子公司使用受限制的现金和现金等价物 - -
九、 关联方及关联交易 
（一） 关联方关系 
1. 母公司及最终控制方 
（1） 母公司及最终控制方 
母公司及最终控制方名称 企业类型 注册地 业务性质 法人代表 组织机 构代码 
长城科技 股份公司 深圳 工业 刘烈宏 27953640X 
CEC 有限公司 北京 工业 熊群力 100010249 


深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

67 

（2） 母公司的注册资本及其变化 
母公司 年初金额 本年增加 本年减少 年末金额 
长城科技 1,197,742,000.00 - - 1,197,742,000.00
（3） 母公司的所持股份或权益及其变化 
持股金额 持股比例（%） 母公司 
年末金额 年初金额 年末比例 年初比例 
长城科技 436,559,901.00 436,559,901.00 49.64% 49.64%
2. 子公司 
（1） 子公司 
子公司名称 企业类型 注册地 业务性质 法人代表 组织机构代码 
开发磁 股份公司 深圳 工业 司马能 618911623
开发香港 有限责任 香港 商业 - -
开发光磁 有限责任 深圳 工业 陈朱江 745199448
开发微电子 有限责任 深圳 工业 陈朱江 754288362
开发苏州 有限责任 深圳 工业 陈朱江 77641814-8
开发技研 有限责任 深圳 工业  刘仁 68944037-1
开发海南 有限责任 海南 工业 陈朱江 56241627-8
（2） 子公司的注册资本及其变化 
子公司名称 币种 年初金额 本年增加 本年减少 年末金额 
开发磁 人民币 251,362,600.00 - - 251,362,600.00
开发香港 港币 3,900,000.00 - - 3,900,000.00
开发光磁 人民币 16,000,000.00 - - 16,000,000.00
开发微电子 美元 20,000,000.00 - - 20,000,000.00
开发苏州 美元 44,000,000.00 16,000,000.00 - 60,000,000.00
开发技研 人民币 6,500,000.00 - - 6,500,000.00
开发海南 人民币 - 7,000,000.00 - 7,000,000.00



深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

68 

（3） 对子公司的持股比例或权益及其变化 
持股金额 持股比例（%） 子公司名称 
币种 年末金额 年初金额 年末比例 年初比例 
开发磁 人民币 396,477,751.63 396,477,751.63 57% 57%
开发香港 港币 1.00 1.00 100% 100%
开发光磁 人民币 16,000,000.00 16,000,000.00 100% 100%
开发微电子 美元 20,000,000.00 20,000,000.00 100% 100%
开发苏州 美元 60,000,000.00 44,000,000.00 100% 100%
开发技研 人民币 3,575,000.00 1,100,000.00 55% 55%
开发海南 人民币 7,000,000.00 - 100% -
3. 合营企业及联营企业见附注八、12、（3） 
4. 其他关联方 
关联关系类型 关联方名称 主要交易内容 组织机构代码
（1）受同一母公司及最终控制
方控制的其他企业 

 深圳易拓科技有限公司 购买商品、 转让固定资产  
 ExcelStor Greatwall Technology Ltd. 销售商品  
 Excelstor Great Wall International 
Limited. 销售商品 

 长城易拓信息产品(深圳)有限公司 销售商品  
 Amoi Electronice （Singapore） Pte Led 销售商品  
 中国长城计算机深圳股份有限公司 房屋租金  
 中国电子财务有限责任公司 存款  
（2）其他关联关系方   
 昂纳信息技术(深圳)有限公司 转供水电、空调费  
（二） 关联交易 
1. 购买商品 
本年 上年 关联方类型及关联方名称 
金额 比例（%） 金额 比例（%）
受同一母公司及最终控制方控制的其他企业 1,443,240.45 0.01% 37,127.12 0.00%
  其中：深圳易拓科技有限公司 1,443,240.45 0.01% 25,000.00 0.00%
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

69 

本年 上年 关联方类型及关联方名称 
金额 比例（%） 金额 比例（%）
      Excelstor GreatWall International Limited. - - 12,127.12 0.00%
合计 1,443,240.45 0.01% 37,127.12 0.00%
注：关联交易的定价政策为参照市场价格的合同定价。 
2. 销售商品 
本年 上年 关联方类型及关联方名称 
金额 比例（%） 金额 比例（%）
合营及联营企业 52,318,749.36 0.25% 32,027,118.42 0.24%
  其中：深圳长城科美技术有限公司 52,318,749.36 0.25% 32,027,118.42 0.24%
受同一母公司及最终控制方控制的其他企业 23,555,550.19 0.11% 26,254,222.88 0.20%
  其中：深圳易拓科技有限公司 - - 21,050,698.08 0.16%
         长城易拓信息产品(深圳)有限公司 23,281,042.38 0.11% 2,848,127.10 0.02%
Amoi Electronice （Singapore） Pte Led - - 2,355,397.70 0.02%
ExcelStor GreatWall International Limited. 274,507.81 0.00% - -
合计 75,874,299.55 0.36% 58,281,341.30 0.44%
注：关联交易的定价政策为参照市场价格的合同定价。 
3. 提供劳务 
本年 上年 关联方类型及关联方名称 
金额 比例（%） 金额 比例（%） 
合营及联营企业 2,646,219.86 4.88% 3,521,002.00 6.86%
  其中：深圳长城科美技术有限公司 - - 56,690.00 0.11%
         深圳东红开发磁盘有限公司 2,646,219.86 4.88% 3,464,312.00 6.75%
受同一母公司及最终控制方控制的其他企业 1,231,646.91 2.27% 9,442,710.99 18.39%
  其中：深圳易拓科技有限公司 792,724.66 1.46% 9,442,710.99 18.39%
长城易拓信息产品(深圳)有限公司 438,922.25 0.81% - -
其他关联关系方 - - 76,553.02 0.15%
  其中：昂纳信息技术(深圳)有限公司 - - 76,553.02 0.15%
合计 3,877,866.77 7.15% 13,040,266.01 25.40%

深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

70 

4. 出租情况  
出租方 
名称 
承租方 
名称 
租赁资 
产种类 
租赁 
起始日 
租赁 
终止日 
租赁收益 
定价依据 
本年确认的 
租赁收益 
开发磁 深圳东红开发磁盘有限公司 房屋 2009年1月 2010年12月 
参照市场价格的
合同定价 2,340,600.00
本公司 深圳易拓科技有限公司 房屋 2009年2月 2010年4月 
参照市场价格的
合同定价 792,724.66
5. 承租情况  
本年 上年 关联方类型及关联方名称 
金额 比例（%） 金额 比例（%）
母公司及最终控制方 4,724,803.56 10.68% 675,259.20 2.56%
  其中：长城科技 4,724,803.56 10.68% 675,259.20 2.56%
受同一母公司及最终控制方控制的其他企业 29,435,148.38 66.57% 15,571,124.16 59.20%
  其中：中国长城计算机深圳股份有限公司 29,435,148.38 66.57% 15,571,124.16 59.20%
合计 34,159,951.94 77.25% 16,246,383.36 61.76%
6. 关联方资金拆借  
关联方名称 拆借金额 起始日 到期日 备注 
深圳东红开发磁盘有限公司 76,326,244.50 2005年4月 2011年9月15日  
合计 76,326,244.50    
7. 关联方资产转让情况 
本年 上年 
关联方名称 关联交易类型 
金额 比例（%） 金额 比例（%）
深圳易拓科技有限公司 受让固定资产 5,076,109.40 1.58% 29,544.10 0.62%
8. 关联方存款 
本年 上年 
关联方名称 关联交易类型 存入金额 取出金额 利息收入 存入金额 取出金额 利息收入
中国电子财务有
限责任公司 
关联 
存款 190,013,050.00 - 55,341.67 - - -
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

71 

（三） 关联方往来余额 
1. 关联方应收账款 
年末金额 年初金额 关联方（项目） 
账面余额 坏账准备 账面余额 坏账准备 
合营及联营企业 37,547,284.61 375,472.85 60,324,798.02 603,247.98
  其中：深圳长城科美技术有限公司 37,547,284.61 375,472.85 60,324,798.02 603,247.98
受同一母公司及最终控制方控制的其他企业 10,884,836.23 108,848.36 7,789,584.20 77,895.84
  其中：ESGW International Ltd. - - 2,195,947.63 21,959.48
ExcelStor Great Wall International Limited - - 5,223.04 52.23
Excelstor Great Wall Technology Ltd. - - 2,316,112.11 23,161.12
长城易拓信息产品(深圳)有限公司 10,884,836.23 108,848.36 2,847,982.40 28,479.82
深圳易拓科技有限公司 - - 424,319.02 4,243.19
合计 48,432,120.84 484,321.21 68,114,382.22 681,143.82

2. 关联方其他应收款 
年末金额 年初金额 关联方（项目） 
账面余额 坏账准备 账面余额 坏账准备 
合营及联营企业 1,208,442.00 12,084.42 1,694,059.72 16,940.60
其中：深圳东红开发磁盘有限公司 1,208,442.00 12,084.42 500,307.52 5,003.08
韩国通用科技公司 1,193,752.20 11,937.52
受同一母公司及最终控制方控制的其他企业 2,378,600.88 153,522.11 3,816,706.71 38,167.07
  其中：深圳易拓科技有限公司 57,838.40 578.38 1,629,220.19 16,292.20
中国长城计算机深圳股份有限公司 2,320,762.48 152,943.73 2,187,486.52 21,874.87
其他关联关系方 - - 29,893,771.72 298,937.72
  其中：昂纳信息技术(深圳)有限公司 - - 29,893,771.72 298,937.72
合计 3,587,042.88 165,606.53 35,404,538.15 354,045.39

3. 关联方应付账款 
关联方（项目） 年末金额 年初金额 
受同一母公司及最终控制方控制的其他企业 2,185,484.85 34,901.05
  其中：深圳易拓科技有限公司 2,185,484.85 34,901.05
合计 2,185,484.85 34,901.05

深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

72 

4. 关联方其他应付款 
关联方（项目） 年末金额 年初金额 
合营及联营企业 35,438,830.00 35,865,592.50
  其中：深圳市长城科美科技有限公司 34,650,000.00 34,650,000.00
深圳长城科美技术有限公司 - 426,762.50
深圳东红开发磁盘有限公司 788,830.00 788,830.00
受同一母公司及最终控制方控制的其他企业 - 1,879,944.00
  其中：深圳易拓科技有限公司 - 1,879,944.00
其他关联关系方 - 215,460.00
  其中：昂纳信息技术(深圳)有限公司 - 215,460.00
合计 35,438,830.00 37,960,996.50

5. 关联方存款 
关联方（项目） 年末金额 年初金额 
受同一母公司及最终控制方控制的其他企业 190,013,050.00 -
  其中：中国电子财务有限责任公司 190,013,050.00 -
十、 或有事项 
1. 履约保函担保 
本公司与中国机械设备进出口总公司(以下简称“CMEC”)合作出口意大利 ENEL 公司
智能电表，中国银行为该项目开立履约保函，保函申请人为 CMEC。 
由于本公司负责该项目资金、技术、质量和生产，并向意大利 ENEL 公司直接发货，
所以合同的实际履约人为本公司，保函担保风险实质由本公司控制。截止资产负债表日，
中国银行已开出未到期履约保函的金额为折人民币 5,405.12 万元，本公司为上述履约保
函提供等额担保。该项目履约情况良好。 
2. 预计负债 
截至资产负债表日，本公司按照电表产品销售合同中约定的保修条款预计的保修费余
额为 1,815.87 万元，详见本附注八、27。 
3. 除存在上述或有事项外，截至 2010 年 12 月 31 日，本集团无其他重大或有事项。 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

73 

十一、 承诺事项 
1． 重大承诺事项 
1） 已签订的尚未履行或尚未完全履行的对外投资合同及有关财务支出 
截至 2010 年 12 月 31 日，本集团尚有已签订合同但未付的约定重大对外投资支出共
计 5280 万美元，具体情况如下： 
投资项目名称 合同投资额 已付投资额 未付投资额 预计投资期间 
LED 项目 5280 万美元 - 5280 万美元 自 2011 年开始分期出资
合计 5280 万美元 - 5280 万美元  
2010 年 12 月 27 日，本公司、Epistar JV Holding（BVI）Co.,Ltd.（以下简称 Epistar）、
亿冠晶（福建）光电有限公司（以下简称亿冠晶）以及 Country Lighting（BVI）Co.,Ltd.
（以下简称 Country Lighting）签订合资经营合同，拟投资成立开发晶照明（厦门）有
限公司。合资公司的经营范围：研发、制造、销售 LED 外延片、芯片、LED 光源模块、LED
灯源和 LED 灯具，并提供相关售后服务。 
合资公司拟投资总额为 1.6 亿美元，注册资本为 1.2 亿美元。各方全部以现金方式出
资。本公司出资 5,280 万美元,占合资公司注册资本的 44%；Epistar 出资 4,800 万美元，
占注册资本的 40%；亿冠晶出资 1,080 万美元,占注册资本的 9%；Country Lighting 出资
840 万美元，占注册资本的 7%。 
2） 已签订的正在或准备履行的大额发包合同 
截至 2010 年 12 月 31 日，本集团尚有已签订但未支付的约定大额发包合同支出共计
1,392.62 万元，具体情况如下： 
项目名称 合同金额 已付金额 未付金额 预计投资期间 
苏州二期厂房土建、设计工程 92,158,800.00 86,949,120.00 5,209,680.00 2011年 
苏州一期二号厂房3楼车间装修工程 6,200,000.00 6,120,877.26 79,122.74 已完工 
苏州二期厂房车间装修工程 20,600,000.00 13,985,118.21 6,614,881.79 2011年 
苏州闭路监控系统工程合同 1,076,703.00 590,000.00 486,703.00 2011年 
苏州二期厂房BTU冷却水系统工程 525,000.00 105,000.00 420,000.00 2011年 
苏州二期厂房LEED认证合同 430,000.00 86,000.00 344,000.00 2011年 
苏州二期厂房LEED调试合同 400,000.00 80,000.00 320,000.00 2011年 
苏州雨水回用处理系统合同 330,000.00 99,000.00 231,000.00 2011年 
苏州二期变配电系统工程合同 226,800.00 215,460.00 11,340.00 2011年 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

74 

苏州二期厂房辅助区地板合同 212,344.00 104,528.00 107,816.00 2011年 
苏州环氧树脂地坪工程合同 101,622.00 - 101,622.00 2011年 
合计 122,261,269.00 108,335,103.47 13,926,165.53  
3） 已签订的正在或准备履行的租赁合同及财务影响 
于 2010 年 12 月 31 日，本集团就租赁南山区长城科技大厦厂房、办公楼、华富工业
园厂房、仓库、宿舍等项目之不可撤销经营租赁所需于下列期间承担款项如下： 
期间 经营租赁 融资租赁 
2011年 27,661,746.81 -
2012年 13,226,160.34 -
2013年 903,733.28 -
2013年以后 - -
合计 41,791,640.43 -
2． 前期承诺履行情况 
本集团前期承诺履行情况良好。 
3． 除上述承诺事项外，截至 2010 年 12 月 31 日，本集团无其他重大承诺事项。 
十二、 资产负债表日后事项 
1. 2011 年 2 月 22 日，本公司董事会审议，为进一步完善开发苏州生产经营的配套
设施，稳定员工队伍，为开发苏州可持续健康发展提供强有力的人员保障和配套支持，同
意其收购自然人沈刚祥和沈惠英所持有的苏州金冠科技有限公司（以下简称金冠科技）
100%股权，从而获得其地面及其地面房产物业。本次收购以金冠科技 2010 年经深圳市天
健国众联资产评估土地房地产估价有限公司评估的净资产值 3,422.68 万为定价参考，双
方协商确定股权收购价格为 3,743 万元人民币。 
2. 2011 年 2 月 22 日，本公司董事会审议，鉴于公司电表业务的战略发展需要，决
定如下：（1）同意由开发香港以人民币 1 元收购沃美国际有限公司（以下简称沃美国际）
所持有的本公司之联营企业深圳长城科美技术有限公司（以下简称科美技术）3%股权。为
进一步支持科美技术做大做强国内电表业务，同意将本公司拥有的 3 项授权和 7 项已受理
的电表国内专利、8 项已获证书的软件著作权、53 项作为商业秘密的软件和程序、20 类
商业秘密文件类别以及国内研发团队转入科美技术；（2）本次收购完成后，本公司、北京
沃美科贸有限公司、沃美国际、开发香港分别持有科美技术 35%、35%、27%和 3%的股权，
即本公司直接和间接持有科美技术 38%股权。 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

75 

3. 2011 年 3 月 2 日，本公司董事会审议，同意公司在 CEC 东莞产业基地独资设立东
莞长城开发科技有限公司建设长城开发东莞产业基地，该项目投资总额 9 亿元人民币，注
册资本 3 亿元人民币，主要从事 ODM 研发制造、提供消费类电子、医疗电子、汽车电子、
LED 产品等。 
4. 2011 年 3 月 8 日，本公司董事会审议，根据公司电子产品业务发展需要，同意设
立深圳长城开发科技股份有限公司石岩分公司。 
5. 2011 年 3 月 8 日，本公司董事会审议，同意本公司与关联方中国长城计算机深圳
股份有限公司签订《房地产租赁合同》，租赁其位于深圳市宝安区石岩镇宝石公路北侧黄
草浪村显示器厂房 1 栋厂房 02。 
6. 除存在上述资产负债表日后事项外，本集团无其他重大资产负债表日后事项。 
十三、 其他重要事项 
1． 非货币性资产交换 
2010年，本公司与捷荣科技集团有限公司（以下简称捷荣科技）、捷荣模具工业（东
莞）有限公司（以下简称捷荣模具）签署合资协议，本公司以价值9,354,382.00元人民币
的自有设备投资捷荣科技的全资子公司捷荣模具。投资后，本公司持有捷荣模具19.82%
股权，投资成本以深融资评报字（2010）05009号评估报告价值确定，换出资产公允价值
为9,354,382.00元，账面价值为9,354,382.00元。 
2． 租赁 
（1） 经营租出资产 
经营租赁租出资产类别 年末金额 年初金额 
房屋建筑物 135,084,077.74 155,587,178.99
合计 135,084,077.74 155,587,178.99
（2） 重大经营租赁最低租赁付款额 
剩余租赁期 最低租赁付款额 
1年以内 27,661,746.81
1-2年 13,226,160.34
2-3年 903,733.28
3年以上 -
合计 41,791,640.43
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

76 

3． 处置长城宽带股权 
本公司持有参股公司长城宽带 5%股权，投资成本为 4500 万元，已全额计提减值准备。 
2010 年 4 月 14 日，本公司董事会审议，根据集团产业规划调整，为更好的发展本公
司主营业务，拟出售所持有的长城宽带 5%股权。股权出售需通过公开挂牌的方式进行。 
2010年8月11日，本公司与中信网络有限公司签订产权交易合同，股权转让价格为
4,226,000 元，处置收益4,215,548.00元。 
十四、 母公司财务报表主要项目注释 
1. 应收账款 
（1） 应收账款分类 
年末金额 年初金额 
账面余额 坏账准备 账面余额 坏账准备 项目 
金额 比例（%） 金额 比例（%） 金额 比例（%） 金额 比例（%）
单项金额重大并单项
计提坏账准备的应收
账款 
  - - - -
按组合计提坏账准备
的应收账款   - - - -
账龄组合 926,627,943.67 100.00% 21,814,923.60 100.00% 850,218,831.20 100.00% 20,992,638.02 100.00%
组合小计 926,627,943.67 100.00% 21,814,923.60 100.00% 850,218,831.20 100.00% 20,992,638.02 100.00%
单项金额虽不重大但
单项计提坏账准备的
应收账款 
  - - - -
合计 926,627,943.67 100.00% 21,814,923.60 100.00% 850,218,831.20 100.00% 20,992,638.02 100.00%
1） 组合中，按账龄分析法计提坏账准备的应收账款 
年末金额 年初金额 
账面余额 账面余额 项目 
金额 比例（%）
坏账准备 
金额 比例（%） 
坏账准备 
1年以内 913,351,757.01 98.57% 9,133,517.57 837,231,268.08 98.47% 8,372,312.68
1-2年 379,306.87 0.04% 37,930.68 363,006.35 0.04% 36,300.64
2-3年 362,006.35 0.04% 108,601.91 57,902.96 0.01% 17,370.89
3年以上 12,534,873.44 1.35% 12,534,873.44 12,566,653.81 1.48% 12,566,653.81
合计 926,627,943.67 100.00% 21,814,923.60 850,218,831.20 100.00% 20,992,638.02
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

77 

（2） 年末应收账款中不含持本公司（或本集团）5%（含 5%）以上表决权股份的股东
单位欠款。 
（3） 应收账款金额前五名单位情况 
单位名称 与本公司关系 金额 账龄 占应收账款总额的比例(%) 
开发香港 子公司 605,290,619.45 1年以内 65.32%
43,333,464.27 1年以内 4.68%
中国机械设备进出口总公司 客户 
8,896,272.43 4-5年 0.96%
Maharashtra State Electricity 
Distribution Company Limited 客户 40,227,763.28 1年以内 4.34%
深圳长城科美技术有限公司 联营企业 37,547,284.61 1年以内 4.05%
深圳市中兴康讯电子有限公司 客户 33,981,202.44 1年以内 3.67%
合计 769,276,606.48  83.02%
（4） 应收关联方账款情况 
单位名称 与本公司关系 金额 占应收账款总额的比例(%) 
开发香港 子公司 605,290,619.45 65.32%
深圳长城科美技术有限公司 联营企业 37,547,284.61 4.05%
开发苏州 子公司 5,173,710.78 0.56%
开发技研 子公司 423,442.42 0.05%
长城易拓信息产品(深圳)有限公司 同一控股股东 14,729.61 0.00%
合计 648,449,786.87 69.98%
（5） 应收账款中外币余额 
年末金额 年初金额 外币名称 
原币 折算汇率 折合人民币 原币 折算汇率 折合人民币 
美元 107,506,217.70 6.6227 711,981,427.96 104,666,522.03 6.8282 714,683,945.73
欧元 4,195,968.80 8.8065 36,951,799.24 770,136.89 9.7971 7,545,108.13
合计 - - 748,933,227.20 - - 722,229,053.86



深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

78 

2. 其他应收款 
（1） 其他应收款分类 
年末金额 年初金额 
账面余额 坏账准备 账面余额 坏账准备 项目 
金额 比例（%） 金额 比例（%） 金额 比例（%） 金额 比例（%）
单项金额重大并单项
计提坏账准备的其他
应收款 
- - - - - - - -
按组合计提坏账准备
的其他应收款 - - - - - - - -
账龄组合 85,589,036.68 100.00% 64,971,959.58 100.00% 136,432,334.80 100.00% 84,212,340.55 100.00%
组合小计 85,589,036.68 100.00% 64,971,959.58 100.00% 136,432,334.80 100.00% 84,212,340.55 100.00%
单项金额虽不重大但
单项计提坏账准备的
其他应收款 
- - - - - - - -
合计 85,589,036.68 100.00% 64,971,959.58 100.00% 136,432,334.80 100.00% 84,212,340.55 100.00%
1） 组合中，按账龄分析法计提坏账准备的其他应收款 
年末金额 年初金额 
账面余额 账面余额 项目 
金额 比例（%） 
坏账准备 
金额 比例（%） 
坏账准备 
1年以内 19,024,423.96 22.23% 190,244.23 26,767,956.93 19.62% 267,679.57
1-2年 1,949,447.75 2.28% 194,944.78 165,458.09 0.12% 16,545.81
2-3年 40,563.43 0.05% 12,169.03 36,529,720.87 26.77% 10,958,916.26
3年以上 64,574,601.54 75.44% 64,574,601.54 72,969,198.91 53.49% 72,969,198.91
合计 85,589,036.68 100.00% 64,971,959.58 136,432,334.80 100.00% 84,212,340.55
（2） 本年度坏账准备转回（或收回）情况 
单位名称 其他应收款账面余额 
转回或收回前
累计已计提坏
账准备金额 
本年转回（或收
回）金额 
确定原坏账
准备的依据 
本年转回或
收回）原因 
昂纳信息技术(深圳)有限公司 29,893,771.72 29,893,771.72 29,893,771.72 账龄 见八、7.(2)
合计 29,893,771.72 29,893,771.72 29,893,771.72  
（3） 年末其他应收款中不含持有本公司 5%（含 5%）以上表决权股份的股东单位欠款  
（4） 其他应收款金额前五名单位情况 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

79 

单位名称 与本公司关系 金额 账龄 
占其他应收
款总额的比
例（%） 
性质或内容 
中国机械设备进出口总公司 客户 55,895,420.51 3-5年 65.31% 加工费 
成武有线电视公司 外部单位 6,900,000.00 5年以上 8.06% 保证金抵押款 
沛顿科技（深圳）有限公司 客户 4,116,150.11 1年以内 4.81% 中央关务费及水电空调费 
开发磁 子公司 2,347,246.63 1年以内 2.74% 房租水电费等款 
中国长城计算机深圳股份有限公司 同一控股股东 1,574,788.20 1-2年 1.84% 房租押金 
合计 70,833,605.45  82.76% 
（5） 应收关联方款项 
单位名称 与本公司关系 金额 占其他应收款总额的比例（%） 
开发磁 子公司 2,347,246.63 2.74%
中国长城计算机深圳股份有限公司 同一控股股东 1,574,788.20 1.84%
开发微电子 子公司 730,262.84 0.85%
开发光磁 子公司 92,532.13 0.11%
深圳易拓科技有限公司 同一控股股东 57,838.40 0.07%
开发技研 子公司 54,060.40 0.06%
合计 4,856,728.60 5.67%
（6） 其他应收款中外币余额 
年末金额 年初金额 外币名称 
原币 折算汇率 折合人民币 原币 折算汇率 折合人民币 
美元 95,305.70 6.6227 631,181.06 65,691.72 6.8282 448,556.20
欧元 14,400.00 0.8509 12,252.96 - - -
合计 - - 643,434.02 - - 448,556.20
3. 可供出售金融资产 
项目 年末金额 年初金额 
可供出售权益工具 392,558,850.25 -
合计 392,558,850.25 -


深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

80 

4. 长期股权投资 
（1） 长期股权投资分类 
项目 年末金额 年初金额 
按成本法核算长期股权投资 985,253,164.14 924,108,582.14
按权益法核算长期股权投资 49,557,444.13 47,148,289.61
长期股权投资合计 1,034,810,608.27 971,256,871.75
减：长期股权投资减值准备 6,391,700.00 51,391,700.00
长期股权投资价值 1,028,418,908.27 919,865,171.75
（2） 按成本法、权益法核算的长期股权投资 
被投资单位名称 持股 比例（%） 
表决权比例
（%） 
初始 
金额 
年初 
金额 
本年 
增加 
本年 
减少 
年末 
金额 
本年现 
金红利 
成本法核算     
开发香港 100.00% 100.00% 1.07 1.07 - - 1.07 -
开发光磁 75.00% 75.00% 12,000,000.00 12,000,000.00 - - 12,000,000.00 -
开发微电子 70.00% 70.00% 57,937,600.00 105,981,400.00 - - 105,981,400.00 47,057,394.68
开发苏州 75.00% 75.00% 47,222,500.00 203,121,625.00 108,765,200.00 - 311,886,825.00 
开发磁 57% 57% 92,181,661.76 396,477,751.63 - - 396,477,751.63 
开发技研 55% 55% 1,100,000.00 1,100,000.00 2,475,000.00 - 3,575,000.00 
开发海南 100.00% 100.00% 7,000,000.00 - 7,000,000.00 - 7,000,000.00 
深圳粤银投资有限公司 15.00% 15.00% 4,500,000.00 4,192,300.00 - - 4,192,300.00 
长城宽带网络服务有限公司 5.00% 5.00% 45,000,000.00 45,000,000.00 - 45,000,000.00 - 
深圳海量存储设备有限公司 10.00% 10.00% 49,524,356.80 49,524,356.80 - - 49,524,356.80 4,713,949.72
中国光大银行 0.15% 0.15% 21,450,000.00 21,450,000.00 - 21,450,000.00 - 493,986.72
山东云龙科技电子股份有限公司 13.16% 13.16% 5,000,000.00 5,000,000.00 - - 5,000,000.00 -
湖南银洲股份有限公司 1.41% 1.41% 2,391,700.00 2,391,700.00 - - 2,391,700.00 -
华旭金卡股份有限公司 18.11% 18.11% 12,507,063.85 6,319,447.64 - - 6,319,447.64 -
东方证券股份有限公司 0.30% 0.30% 71,550,000.00 71,550,000.00 - - 71,550,000.00 2,000,000.00
捷荣模具工业（东莞）有限公司 19.82% 19.82% 9,354,382.00 - 9,354,382.00 - 9,354,382.00 
小计   438,719,265.48 924,108,582.14 127,594,582.00 66,450,000.00 985,253,164.14 54,265,331.12
权益法核算     
深圳长城科美技术有限公司 35.00% 35.00% 3,500,000.00 12,163,058.61 2,416,561.47 - 14,579,620.08 
深圳市长城科美科技有限公司 35.00% 35.00% 7,000,000.00 34,985,231.00 - 7,406.95 34,977,824.05 
小计   10,500,000.00 47,148,289.61 2,416,561.47 7,406.95 49,557,444.13 -





深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

81 

（3） 对合营企业、联营企业投资 
被投资单位名称 
持股 
比例
（%） 
表决权
比例（%） 年末 资产总额 
年末 
负债总额 
年末 
净资产总额 
本年 
营业收入总额 
本年 
净利润 
联营企业    
1、深圳长城科美技术有限公司 35.00% 35.00% 93,131,373.86 51,488,113.66 41,643,260.20 90,697,886.18 6,904,461.34
2、深圳市长城科美科技有限公司 35.00% 35.00% 99,910,672.79 24,000.00 99,886,672.79 - -21,162.71
合计   193,042,046.65 51,512,113.66 141,529,932.99 90,697,886.18 6,883,298.63
注：1）联营企业的重要会计政策、会计估计与本集团的会计政策、会计估计不存在
重大差异。 
2）本集团对被投资公司持股比例与其在被投资单位表决权比例一致。 
（4） 长期股权投资减值准备 
被投资单位名称 年初金额 本年增加 本年减少 年末金额 计提原因 
湖南银洲股份有限公司 2,391,700.00 - - 2,391,700.00 
深圳粤银投资有限公司 4,000,000.00 - - 4,000,000.00 
长城宽带网络服务有限公司 45,000,000.00 - 45,000,000.00 - 处置结转
合计 51,391,700.00 - 45,000,000.00 6,391,700.00 
5. 营业收入、营业成本 
项目 本年金额 上年金额 
主营业务收入 3,251,895,571.44 1,966,801,732.47
其他业务收入 77,932,824.31 74,192,561.40
合计 3,329,828,395.75 2,040,994,293.87
主营业务成本 3,049,000,979.24 1,791,582,956.61
其他业务成本 56,069,838.66 53,601,431.07
合计 3,105,070,817.90 1,845,184,387.68




深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

82 

（1） 主营业务—按行业分类 
本年金额 上年金额 行业名称 
营业收入 营业成本 营业收入 营业成本 
电子产品制造 3,251,895,571.44 3,049,000,979.24 1,966,801,732.47 1,791,582,956.61
合计 3,251,895,571.44 3,049,000,979.24 1,966,801,732.47 1,791,582,956.61
（2） 主营业务—按产品分类 
本年金额 上年金额 产品名称 
营业收入 营业成本 营业收入 营业成本 
硬盘相关产品 2,320,585,413.67 2,292,791,351.99 1,449,229,096.70 1,381,597,048.91
自有产品 637,977,068.20 506,579,114.14 286,003,780.96 211,677,978.24
OEM 产品 293,333,089.57 249,630,513.11 231,568,854.81 198,307,929.46
合计 3,251,895,571.44 3,049,000,979.24 1,966,801,732.47 1,791,582,956.61
（3） 主营业务—按地区分类 
本年金额 上年金额 地区名称 
营业收入 营业成本 营业收入 营业成本 
中国(含香港) 2,830,952,871.55 2,695,149,211.07 1,904,248,724.84 1,743,491,177.08
亚太地区（除中
国外） 116,911,296.81 98,513,844.20 42,724,780.98 37,837,836.00
其他地区 304,031,403.08 255,337,923.97 19,828,226.65 10,253,943.53
合计 3,251,895,571.44 3,049,000,979.24 1,966,801,732.47 1,791,582,956.61
（4） 前五名客户的营业收入情况 
客户名称 营业收入 占全部营业收入的比例（%） 
开发香港 2,580,301,801.52 79.35%
中国机械设备进出口总公司 126,930,902.60 3.90%
惠州三星电子有限公司 126,703,284.17 3.90%
深圳市中兴康讯电子有限公司 67,815,345.42 2.09%
Maharashtra State Electricity 
Distribution Company Limited 64,859,364.89 1.99%
合计 2,966,610,698.60 91.23%


深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

83 

6. 投资收益 
（1） 投资收益来源 
项目 本年金额 上年金额 
成本法核算的长期股权投资收益 54,265,331.12 64,942,785.63
权益法核算的长期股权投资收益 2,409,154.52 -3,942,055.46
处置长期股权投资产生的投资收益 4,215,548.00
处置交易性金融资产取得的投资收益 194,391.97 205,248.25
合计 61,084,425.61 61,205,978.42
（2） 成本法核算的长期股权投资收益 
项目 本年金额 上年金额 本年比上年增减变动的原因 
合计 54,265,331.12 64,942,785.63
其中： 
开发微电子 47,057,394.68 41,068,038.03 被投资单位分红 
深圳海量存储设备有限公司 4,713,949.72 10,088,510.70 被投资单位分红 
东方证券股份有限公司 2,000,000.00 - 被投资单位分红 
中国光大银行 493,986.72 927,086.94 被投资单位09年1-9月分红 
开发光磁 - 12,859,149.96 被投资单位本年未分红 
（3） 权益法核算的长期股权投资收益 
项目 本年金额 上年金额 本年比上年增减变动的原因 
合计 2,409,154.52 -3,942,055.46
其中： 
开发磁 - -8,904,138.02 本年改为成本法核算 
深圳长城科美技术有限公司 2,416,561.47 4,976,851.56 被投资单位盈利 
深圳市长城科美科技有限公司 -7,406.95 -14,769.00 被投资单位亏损 
7. 母公司现金流量表补充资料 
项目 本年金额 上年金额 
1.将净利润调节为经营活动现金流量：   
净利润 119,180,249.96 167,641,469.78
加：资产减值准备 -15,889,385.04 -16,463,303.49
固定资产折旧、油气资产折耗、生产性生物资产折旧 84,739,627.64 57,858,829.24
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

84 

项目 本年金额 上年金额 
无形资产摊销 - -
长期待摊费用摊销 - -
处置固定资产、无形资产和其他长期资产的损失（收益以“-”填
列） 
104,870.92 -1,314,889.74
固定资产报废损失（收益以“-”填列） - -
公允价值变动损益（收益以“-”填列） 98,817.46 -98,817.46
财务费用（收益以“-”填列） 18,317,579.33 2,744,947.72
投资损失（收益以“-”填列） -61,084,425.61 -61,205,978.42
递延所得税资产的减少（增加以“-”填列） 15,052,042.25 5,234,366.80
递延所得税负债的增加（减少以“-”填列） -21,739.84 21,739.84
存货的减少（增加以“-”填列） -116,797,068.48 -18,148,608.42
经营性应收项目的减少（增加以“-”填列） -91,000,415.35 184,876,481.78
经营性应付项目的增加（减少以“-”填列） 216,482,716.46 -105,751,360.42
其他 - -
经营活动产生的现金流量净额 169,182,869.70 215,394,877.21
2.不涉及现金收支的重大投资和筹资活动： 
债务转为资本 - -
一年内到期的可转换公司债券 - -
融资租入固定资产 - -
3.现金及现金等价物净变动情况： 
现金的期末余额 1,006,990,925.52 1,153,966,084.13
减：现金的期初余额 1,153,966,084.13 1,054,074,548.84
加：现金等价物的期末余额 - -
减：现金等价物的期初余额 - -
现金及现金等价物净增加额 -146,975,158.61 99,891,535.29
十五、 补充资料 
1. 本年非经营性损益表 
按照中国证券监督管理委员会《公开发行证券的公司信息披露解释性公告第 1 号—非
经常性损益（2008）》的规定，本集团 2010 年度非经营性损益如下： 
项目 本年金额 上年金额 说明 
非流动资产处置损益 115,292,474.28 368,355.93 
越权审批或无正式批准文件或偶发性的税收返还、减免 - 
深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

85 

项目 本年金额 上年金额 说明 
计入当期损益的政府补助 9,891,326.76 4,718,214.04 
计入当期损益的对非金融企业收取的资金占用费 - - 
企业取得子公司、联营企业及合营企业的投资成本小于取得投资时
应享有被投资单位可辨认净资产公允价值产生的收益 - - 
非货币性资产交换损益 - - 
委托他人投资或管理资产的损益 - - 
因不可抗力因素，如遭受自然灾害而计提的各项资产减值准备 - - 
债务重组损益 - - 
企业重组费用 - - 
交易价格显失公允的交易产生的超过公允价值部分的损益 - - 
同一控制下企业合并产生的子公司期初至合并日的当期净损益 - - 
与公司正常经营业务无关的或有事项产生的损益 - - 
除同公司正常经营业务相关的有效套期保值业务外，持有交易性金
融资产、交易性金融负债产生的公允价值变动损益，以及处置交易
性金融资产、交易性金融负债和可供出售金融资产取得的投资收益
267,814.09 357,099.04 
单独进行减值测试的应收款项减值准备转回 -28,689,034.66 18,920,062.89 
对外委托贷款取得的损益  - - 
采用公允价值模式进行后续计量的投资性房地产公允价值变动产生
的损益 - - 
根据税收、会计等法律、法规的要求对当期损益进行一次性调整对
当期损益的影响 - - 
受托经营取得的托管费收入 - 
除上述各项之外的其他营业外收入和支出 -1,152,950.78 -237,982.28 
其他符合非经常性损益定义的损益项目 - - 
小计 95,609,629.69 24,125,749.62 
所得税影响额 25,316,636.11 5,225,490.17 
少数股东权益影响额（税后） -23,228,101.15 6,010,552.39 
合计 93,521,094.73 12,889,707.06 
非流动资产处置损益主要为(1) 开发香港处置持有的 O-Net Group 股权收益共计     
137,616,684.46 元；（2）铝基片电镀线工程报废损失 25,766,064.49 元；（3）本公司
处置长城宽带收益 4,215,548.00 元。 
如附注八、11 所述，单独进行减值测试的应收款项减值准备转回-28,689,034.66 元
为本公司之子公司开发磁委托贷款全额计提减值准备。 

深圳长城开发科技股份有限公司财务报表附注 
2010 年 1 月 1 日至 2010 年 12 月 31 日 
（本财务报表附注除特别注明外，均以人民币元列示）                         

86 

2. 净资产收益率及每股收益 
按照中国证券监督管理委员会《公开发行证券的公司信息披露编报规则第 9 号——
净资产收益率和每股收益的计算及披露（2010 年修订）》的规定，本集团 2010 年度加权
平均净资产收益率、基本每股收益和稀释每股收益如下： 
每股收益 报告期利润 加权平均净资产收益率（%） 基本每股收益 稀释每股收益
归属于母公司股东的净利润 10.29% 0.2913 0.2913
扣除非经常性损益后归属于母公司股东的
净利润  7.78% 0.2204 0.2204
十六、 财务报告批准 
本财务报告于 2011 年 3 月 29 日由本公司董事会批准报出。 
深圳长城开发科技股份有限公司 
二○一一年三月二十九日 




'''
# str2 = str1.lstrip()
# temp = str2.decode('utf8')
reObj = re.compile(r'（(.*?)。）', re.M|re.S)
result = reObj.findall(str1)
print result[0]
